Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/addons.po
Languages: es

source: Extend Plone with Add-On Packages
es: Extiende Plone con paquetes Complementos

source: There are more than 2,000 add-ons for Plone. We will cover only a handful today.
es: Hay más de 2000 complementos para Plone. Nosotros vamos a cubrir sólo un puñado de hoy.

source: Using them can saves a lot of time
es: Usándolos puedes ahorrarte mucho tiempo

source: The success of a project often depends on finding the right add-on
es: El éxito de un proyecto a veces depende en encontrar el complemento adecuado

source: Their use, usefulness, quality and complexity varies a lot
es: Su uso, utilidad, calidad y complejidad varia mucho

source: How to find add-ons
es: ¿Como buscar complementos?

source: https://pypi.python.org/pypi - use the search form!
es: https://pypi.python.org/pypi - ¡Use el formulario de búsqueda!

source: https://github.com/collective >1200 repos
es: https://github.com/collective > 1200 repositorios

source: https://github.com/plone >260 repos
es: https://github.com/plone > 260 repositorios

source: google (e.g. `Plone+Slider <http://lmgtfy.com/?q=plone+slider>`_)
es: Navegando en Google (por ejemplo `Plone+Slider <http://lmgtfy.com/?q=plone+slider>`_)

source: Check shortlist `Plone Paragon <http://paragon.plone.org/>`_ (Launched August 2014)
es: Verifica una lista corta en `Plone Paragon <http://paragon.plone.org/>`_ (Lanzado en Agosto de 2014)

source: ask in irc and on the mailing list
es: Pregunta en el canal irc y la lista de correo

source: A talk on finding and managing ad-dons: https://www.youtube.com/watch?v=Sc6NkqaSjqw
es: Una conversación sobre encontrar y administrar complementos: https://www.youtube.com/watch?v=Sc6NkqaSjqw

source: Some notable add-ons
es: Algunos complementos notables

source: A form generator
es: Un generador de formularios

source: Photo galleries with a huge selection of various js-libraries
es: Galerías de fotos con una gran selección de varios librerías Javascript

source: UI to create complex landing-pages
es: Interfaz para crear páginas de inicios (landing pages) complejas

source: Flexible bundle of add-ons to georeference content and display in maps
es: Paquete flexible de complementos para georeferenciar contenido y mostrar mapas

source: Allows visitors to subscribe to mailchimp newsletters
es: Permite a los visitantes suscribirse a noticias Mailchimp

source: Create faceted navigation and searches through the web.
es: Crear la navegación facetada y búsquedas a través de la Web.

source: Turns global navigation into dropdowns
es: Convierte la navegación global en menú desplegables

source: Multi-file upload using drag&drop
es: Subida de múltiples archivos usando el concepto drag & drop

source: A flexible doormat
es: Un flexible pie de página basado en el patrón de diseño Doormat

source: Add decorative banners and sliders
es: Agrega banners decorativos y pasarelas

source: Allows multilingual sites by translating content
es: Permite sitios plurilingüe mediante la traducción de contenido

source: `Plomino <http://plomino.net/>`_
es: `Plomino <http://www.plomino.net/>`_

source: Powerful and flexible web-based application builder for Plone
es: Un poderoso y flexible constructor de aplicaciones basado en Web para Plone

source: Installing Add-ons
es: Instalando complementos

source: Installation is a two-step process.
es: La instalación es un proceso de dos pasos.

source: Making the add-on packages available to Zope
es: Haciendo los paquetes Complementos disponibles para Zope

source: First, we must make the add-on packages available to Zope. This means, that Zope can import the code. Buildout is responsible for this.
es: Primero, debemos asegurarnos que los paquetes Complementos estén disponible para Zope. Esto significa, que Zope puede importar el código. Buildout es responsable de esto.

source: Look at ``buildout.cfg`` file in ``/vagrant/buildout``.
es: Busca el archivo ``buildout.cfg`` en ``/vagrant/buildout``.

source: If you're using our Vagrant kit, the Plone configuration is available in a folder that is shared between the host and guest operating systems. Look in your Vagrant install directory for the ``buildout`` folder. You may edit configuration files using your favorite text editor in the host operating system, then switch into your virtual machine to run buildout on the guest operating system.
es: Si estás utilizando nuestro kit Vagrant, la configuración Plone está disponible en una carpeta que se comparte entre los sistemas operativos anfitrión y huésped. Busque en su directorio de instalación Vagrant la carpeta ``buildout``. Puede editar los archivos de configuración utilizando su editor de texto favorito en el sistema operativo huésped, luego cambiar en la máquina virtual para ejecutar buildout en el sistema operativo invitado.

source: In the section ``[instance]`` there is a variable called ``eggs``, which has a list of *eggs* as a value. Add the following eggs:
es: En la sección ``[instance]`` existe una variable llamada ``eggs``, la cual tiene una lista de *eggs* como valor. Agregue los siguientes paquetes eggs:

source: We already have added the ad-dons that we will use now:
es: Ya hemos agregado los complementos que usaras ahora:

source: Usually, one enters the eggs by adding one more line per egg into the configuration. You must write the egg name indented, this way buildout understands that the current line is part of the last variable and not a new variable.
es: Generalmente, uno ingresa los paquetes eggs agregando una linea adicional por cada paquete egg en la configuración, Debes escribir el nombre del paquete egg de forma indentada, así el buildout entiende que la linea actual es parte de la ultima variable y no una nueva variable.

source: If you add new add-ons here you will have to run buildout and restart the site:
es: Si agregas nuevos complementos tendrás que ejecutar buildout y reiniciar el sitio:

source: Now the code is available from within Plone.
es: Ahora el código está disponible desde a dentro de Plone.

source: Installing add-ons in your Plone Site
es: Instalando complementos en su sitio de Plone

source: Your Plone site has not yet been told to use the add-on. For this, you have to activate the add-ons in your Plone Site.
es: Tu sitio de Plone no ha sido especificado para usar el complemento. Para esto debes activar los complementos en tu sitio de Plone.

source: Why the extra step of activating the add-on package? You my have multiple Plone sites in a single Zope installation. It's common to want to activate some add-ons in one site, others in another.
es: ¿Por qué el paso adicional de activar el paquete complemento? Usted mi tiene varios sitios Plone en una única instalación de Zope. Es normal que desee activar algunos complementos en un sitio, otros complementos en otro sitio.

source: In your browser, go to Site Setup (shortcut: add ``/@@overview-controlpanel`` to the Plone site URL), and open the ``Add-ons`` Panel. You will see that you can install the add-ons there.
es: En el navegador, vaya a Configuración del sitio (atajo: añadir en su dirección URL ``/@@overview-controlpanel`` del sitio Plone), y abrir el panel ``Complementos``. Usted verá que puede instalar los complementos allí.

source: Install **PloneFormGen** and **Plone True Gallery** them now.
es: Instala **PloneFormGen** y **Plone True Gallery** ahora.

source: This is what happens: The GenericSetup profile of the product gets loaded. This does things like:
es: Esto es lo que sucede: el perfil GenericSetup del producto se ha cargado. esto hace cosas como:

source: configuring new actions,
es: Configurando nuevas acciones

source: registering new content types
es: Registrando nuevos tipos de contenido

source: registering css- and js-files
es: Registrando archivos CSS y Javascripts

source: creating some content/configuration objects in your Plone site.
es: Creando algunos objetos contenidos / configuración en tu sitio de Plone.

source: Let's have a look at what we just installed.
es: Miremos lo que hemos instalado.

source: There are many ways to create forms in Plone:
es: Hay muchas formas de crear formularios en Plone:

source: pure: html and python in a view
es: Puro: HTML y Python en una vista

source: framework: z3c.form, formlib, deform
es: Usando framework: z3c.form, formlib, deform

source: TTW: Products.PloneFormGen
es: A través de la Web: Products.PloneFormGen

source: The basic concept of PloneFormGen is that you build a form by adding a Form Folder, to which you add form fields as content items. Fields are added, deleted, edited and moved just as with any other type of content. Form submissions may be automatically emailed and/or saved for download. There are many PFG add-ons that provide additional field types and actions.
es: El concepto básico de PloneFormGen es usted construye un formulario mediante la adición de una carpeta de formulario, a esta agrega campos de formulario como elementos de contenido. Se añaden, eliminar, editar campos y mueven al igual que con cualquier otro tipo de contenido. Los envíos de formularios pueden ser enviados por correo electrónico de forma automática y / o guardarse para descargar, por ejemplo en un archivo CSV. Hay muchas complementos para PloneFormGen que proporcionan los tipos de campo adicionales y acciones.

source: Let's build a registration form:
es: Vamos a construir un formulario de registro:

source: Activate PloneFormGen for this site via the add-on configuration panel in site setup
es: Activar PloneFormGen para este sitio a través del panel de configuración Complementos en la Configuración del sitio.

source: Add an object of the new type 'Form Folder' in the site root. Call it "Registration"
es: Agrega un objeto del nuevo tipo 'Form Folder' en el raíz del sitio llamado "Registro"

source: Save and view the result, a simple contact form that we may customize
es: Guarde y ver el resultado, un sencillo formulario de contacto el cual puede personalizar

source: Click in QuickEdit
es: Haga clic en QuickEdit (para la edición rápida)

source: Remove field "Subject"
es: Remueva el campo "Subject"

source: Add fields for food preference and shirt size
es: Añadir campos para preferencia de alimentos y el tamaño de la camisa

source: Add a DataSave Adapter
es: Agregar un adaptador DataSave

source: Customize the mailer
es: Personalizar el script de envío de correo

source: Need CAPTCHAs? Add the ``collective.recaptcha`` package to your buildout and PFG will have a CAPTCHA field.
es: ¿Necesita CAPTCHA? Agregue el paquete ``collective.recaptcha`` a su buildout y PloneFormGen - PFG tendrá un campo de CAPTCHA.

source: Need encryption? Add GPG encryption to your system, add a GPG configuration for the Plone daemon user that includes a public keys for the mail targets, and you'll be able to encrypt email before sending.
es: ¿Necesita cifrado? Añadir cifrado GPG para su sistema, añada una configuración GPG para el usuario demonio de Plone que incluye unas claves públicas para los objetivos de correo, y usted será capaz de cifrar el correo electrónico antes de enviar.

source: Think PFG is too complicated for your site editors? Administrators (and we're logged in as an administrator) see lots of more complex options that are invisible to site editors.
es: ¿Piensa que PloneFormGen es demasiado complicado para sus editores del sitio? Los administradores (y estamos iniciado sesión de usuario como un administrador) ven un montón de opciones más complejas que son invisibles para editores del sitio.

source: By the way, while PloneFormGen is good at what it does, is not a good model for designing your own extensions. It's was created before the Zope Component Architecture became widely used. The authors would write it much differently if they were starting from scratch.
es: Por cierto, mientras PloneFormGen es bueno en lo que hace, no es un buen modelo para el diseño de sus propias extensiones. Se fue creado antes de la arquitectura de componentes de Zope convirtió ampliamente utilizado. Los autores desean escribir de manera muy diferente si estaban empezando desde cero.

source: Add Photogallery with collective.plonetruegallery
es: Agregar Galerías de fotos con collective.plonetruegallery

source: To advertise the conference we want to show some photos showing past conferences and the city where conference is taking place in.
es: Para promocionar la conferencia queremos mostrar algunas fotos mostrando conferencias pasadas y la ciudad donde la conferencia se esta realizando.

source: Instead of creating custom content types for galleries, it integrates with the Plone functionality to choose different views for folderish content types.
es: En vez de crear tipos de contenido personalizados para galerías, este se integra con la funcionalidad de Plone para elegir diferentes vistas de tipos de contenidos en carpeta.

source: Activate the add-on
es: Activar el producto

source: Enable the behavior ``Plone True Gallery`` on the type ``Folder``: http://localhost:8080/Plone/dexterity-types/Folder/@@behaviors (This step is only required because plonetruegallery does not yet know about the newer plone.app.contenttypes, which we activated to replace Plone's old content types with newer, Dexterity-style, ones.)
es: Habilitar el comportamiento ``Plone True Gallery`` en el tipo ``Carpeta``: http://localhost:8080/Plone/dexterity-types/Folder/@@behaviors (sólo este paso es necesario porque PloneTrueGallery todavía no sabe sobre los nuevos tipos de contenidos en el paquete plone.app.contenttypes, entonces hay activamos para reemplazar viejos tipos de contenido de Plone con más nuevos, de estilo Dexterity.)

source: Add a folder /the-event/location
es: Agregue una carpeta /el-evento/ubicacion

source: Upload some photos from http://lorempixel.com/600/400/city/
es: Suba algunas fotos desde http://lorempixel.com/600/400/city/

source: Enable the view ``galleryview``
es: Habilite la vista ``galleryview``

source: collective.plonetruegallery is a better model for how to write a Plone Extension.
es: collective.plonetruegallery es un mejor modelo para escribir una extensión de Plone.

source: Internationalization
es: Internacionalización

source: Plone can run the same site in many different languages.
es: Plone puede ejecutar el mismo sitio en múltiples lenguajes.

source: We're not doing this with the conference-site since the *lingua franca* of the Plone-community is English.
es: No estamos haciendo esto con el sitio de la conferencia ya que la *lengua franca* de la comunidad Plone es el Ingles.

source: We would use https://pypi.python.org/pypi/plone.app.multilingual for this. It is the successor of Products.LinguaPlone (which only works with Archetypes).
es: Para esto debe usar https://pypi.python.org/pypi/plone.app.multilingual. Ese es el sucesor del Products.LinguaPlone (el cual solo usa tipos de contenidos Archetypes).

source: Building a multi-lingual site requires activating ``plone.app.multilingual``, but no add-on is necessary to build a site in a single language other than English. Just select a different site language when creating a Plone site, and all the basic messages will be translated and and LTR or RTL needs handled.
es: La construcción de un sitio multilingüe exige activar el producto ``plone.app.multilingual``, pero no es necesario un complemento para construir un sitio en un solo idioma que no sea Inglés. Sólo tienes que seleccionar un lenguaje sitio diferente al crear un sitio Plone, y todos los mensajes básicos serán traducidos y LTR o RTL necesidades manejados.

source: Summary
es: Resumen

source: We are now able to customize and extend many parts of our website. We can even install extensions that add new functionality.
es: Ahora somos capaces de personalizar y ampliar muchas partes de nuestro sitio web. Incluso podemos instalar extensiones que añaden nuevas funcionalidades.

source: But:
es: Pero:

source: Can we submit talks now?
es: ¿Podemos enviar Charlas al jurado evaluador ahora?

source: Can we create lists with the most important properties of each tasks?
es: ¿Podemos crear listas con las propiedades mas importantes de cada tarea?

source: Can we allow a jury to vote on talks?
es: ¿Podemos permitir a un miembro del jurado votar en las Charlas?

source: We often have to work with structured data. Up to a degree we can do all this TTW, but at some point we reach barriers. In the next part of the training, we'll teach you, how to break through these barriers.
es: Algunas veces trabajamos con data estructurada. Hasta un grado podemos hacer todo a través de la Web, pero a algún punto nos encontramos con barreras, en la siguiente parte de nuestro entrenamiento, te enseñaremos como romper esas barreras.
