Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/advanced-python.po
Languages: es

source: The Web and Python
es: La Web y Python

source: In the days before the popularity of frameworks like Django, Flask and other frameworks soared, development with Python for the web was a bit harder for comers.
es: En los días anteriores a que la popularidad de frameworks como Django, Flask y otros frameworks se disparara, el desarrollo con Python para la web era un poco más difícil para los recién llegados.

source: Python applications were often designed for only one of CGI, FastCGI, mod_python or some other custom API of a specific web server. This wide variety of choices can be a problem for new Python users,because generally speaking, their choice of web framework limited their choice of usable web servers, and vice versa.
es: Las aplicaciones de Python a menudo se diseñaban solo para uno de los CGI, FastCGI, mod_python o alguna otra API personalizada de un servidor web específico. Esta amplia variedad de opciones puede ser un problema para los nuevos usuarios de Python, porque en términos generales, su elección de marco web limitó su elección de servidores web utilizables, y viceversa.

source: WSGI was created as a low-level interface between web servers and web applications or frameworks to promote a common ground for portable web application development. This is similar to Java's "servlet" API makes it possible for applications written with any Java web application framework to run in any web server that supports the servlet API. [pep-333]
es: WSGI se creó como una interfaz de bajo nivel entre servidores web y aplicaciones web o marcos para promover un terreno común para el desarrollo de aplicaciones web portátiles. Esto es similar a la API de "servlet" de Java, lo que hace posible que las aplicaciones escritas con cualquier marco de aplicación web de Java se ejecuten en cualquier servidor web que admita la API de servlet. [PEP-333]

source: As stated above, WSGI was created to ease the development of Python web applications. The handling of the requests from browser is done by a normal HTTP server, which routes the request to the WSGI container, which in turn runs the WSGI application.
es: Como se indicó anteriormente, WSGI se creó para facilitar el desarrollo de aplicaciones web de Python. El manejo de las solicitudes desde el navegador se realiza mediante un servidor HTTP normal, que enruta la solicitud al contenedor WSGI, que a su vez ejecuta la aplicación WSGI.

source: The following illustration demonstrates this setup:
es: En la siguiente ilustración se muestra esta configuración:

source: This setup promotes scalability and flexibility. As a result you can mix and match any of the above mentioned servers, with any of the WSGI framework, below. In fact, if you desire to, you build a web application mixing parts from different WSGI frameworks.
es: Esta configuración promueve la escalabilidad y la flexibilidad. Como resultado, puede mezclar y combinar cualquiera de los servidores mencionados anteriormente, con cualquiera de los marcos WSGI, a continuación. De hecho, si lo desea, cree una aplicación web mezclando partes de diferentes marcos WSGI.

source: Exploiting Python's data model
es: Explotación del modelo de datos de Python

source: To make our session store easy to as if it was a dictionary, we implement out middleware by crafting a class which behaves like that. For that purpose, we are taking a small diversion from WSGI to Python's Data Model. We enter the realm of so called **magic methods** also known as ``__dunder__`` (which stands of double underscore).
es: Para que nuestro almacén de sesiones sea fácil de usar como si fuera un diccionario, implementamos nuestro middleware creando una clase que se comporta así. Para ese propósito, estamos tomando un pequeño desvío de WSGI al modelo de datos de Python. Entramos en el reino de los llamados **métodos mágicos** también conocidos como ``__dunder__`` (que significa doble guión bajo).

source: The first thing to know about special methods is that they are meant to be called by the Python interpreter, and not by you. [Fluent Python, pg. 8].
es: Lo primero que hay que saber sobre los métodos especiales es que están pensados para ser llamados por el intérprete de Python, y no por usted. [Python fluido, pág. 8].

source: Our goal is to build the following elements of a WSGI framework.
es: Nuestro objetivo es construir los siguientes elementos de un framework WSGI.

source: A Dictionary like Session storage
es: Un diccionario como el almacenamiento de sesión

source: Using a Python session like storage we should be able to check membership use `in`, e.g.::
es: Usando una sesión de Python como el almacenamiento, deberíamos poder verificar el uso de la membresía `en`, por ejemplo::

source: We should also be able to retrieve items as if was a dictionary::
es: También deberíamos ser capaces de recuperar elementos como si fuera un diccionario::

source: Our goal is to create a middleware that stores information in some kind of a persistent storage. For simplicity we start by writing this information to a file on a disk, but this can easily be extended to a Redis storage, MongoDB or any database of your liking. Let's assume though that session data is unstructured might look like a dictionary of session ID as keys, with values which are another dictionary:
es: Nuestro objetivo es crear un middleware que almacene información en algún tipo de almacenamiento persistente. Para simplificar, comenzamos escribiendo esta información en un archivo en un disco, pero esto se puede extender fácilmente a un almacenamiento Redis, MongoDB o cualquier base de datos de su agrado. Sin embargo, supongamos que los datos de sesión no estructurados pueden parecerse a un diccionario de ID de sesión como claves, con valores que son otro diccionario:

source: Requests read only attributes
es: Solicitudes de atributos de solo lectura

source: A Request object is a wrapper around the environment. Some frameworks, like Bottle, Flask and WebOb, make the attribute of a Request object read only.
es: Un objeto Request es un contenedor alrededor del entorno. Algunos marcos, como Bottle, Flask y WebOb, hacen que el atributo de un objeto Request sea de solo lectura.

source: The most obvious way is to use ``@property``, but this creates a very verbose code, here is an example from `web.request.Request` (which is almost 1000 lines of code long!):
es: La forma más obvia es usar ``@property``, pero esto crea un código muy detallado, aquí hay un ejemplo de `web.request.Request` (¡que tiene casi 1000 líneas de código!):

source: We can do much better than creating methods and decorating them with properties. Instead we craft a special container class which wrapps the environment and allows us to access keys as if they where attributes.
es: Podemos hacer mucho mejor que crear métodos y decorarlos con propiedades. En su lugar, creamos una clase contenedor especial que se adapta al entorno y nos permite acceder a las claves como si fueran atributos.

source: Quick access to properties
es: Acceso rápido a las propiedades

source: Sometimes accessing a property can be expensive! As can be seen in the example above, building the host URL, we make 4 dictionary lookups, which isn't taking much, but if we pass our Request object through 4 middlewares each asking for this property, we already make 16 lookups. This could be improved by calculating such properties and save the result, by using a specially crafted decorator:
es: ¡A veces acceder a una propiedad puede ser costoso! Como se puede ver en el ejemplo anterior, al construir la URL del host, hacemos 4 búsquedas en el diccionario, lo que no está tomando mucho, pero si pasamos nuestro objeto Request a través de 4 middlewares cada uno solicitando esta propiedad, ya hacemos 16 búsquedas. Esto podría mejorarse calculando dichas propiedades y guardar el resultado, mediante el uso de un decorador especialmente diseñado:

source: Abitility to extened
es: Capacidad para extened

source: If we want our framework to be public it might be a good idea to have some kind of a plugin system. But even if our framework is intended for a use of a small team of developers, it might be a good idea to supply some base classes and maybe meta-classes to make sure development and extension are easy enough, but also safe to use. For example, suppose we want to replace our dictionary based session with a Redis cache, but we don't want to break the API. We do this with caution, and we think, we might want to replace Redis in some other Key-Value storage. We demonstrate, how the use of meta classes can enforce programmers, to obay some certain structure, with out throwing a ``RuntimeError`` or an ``AttributeError``, which in some cases might be too late.
es: Si queremos que nuestro framework sea público, puede ser una buena idea tener algún tipo de sistema de plugins. Pero incluso si nuestro marco está diseñado para el uso de un pequeño equipo de desarrolladores, podría ser una buena idea proporcionar algunas clases base y tal vez metaclases para asegurarse de que el desarrollo y la extensión sean lo suficientemente fáciles, pero también seguros de usar. Por ejemplo, supongamos que queremos reemplazar nuestra sesión basada en diccionario por una caché de Redis, pero no queremos romper la API. Hacemos esto con precaución y pensamos que es posible que queramos reemplazar Redis en algún otro almacenamiento de clave-valor. Demostramos cómo el uso de metaclases puede obligar a los programadores a obtener una cierta estructura, sin lanzar un ``RuntimeError`` o un ``AttributeError``, que en algunos casos podría ser demasiado tarde.

source: Functional Python
es: Python Funcional

source: Hello WSGI
es: Hola WSGI

source: A WSGI application is just a callable object the responds to requests by taking two arguments. The first one is the WSGI ``environment`` and the second is the ``start_response``. The ``environment`` is a Python dictionary containing information about the CGI environment. ``start_response`` is a callback which takes two inputs the response ``status`` and ``headers``. The status is astring representation like ``200 OK`` or any other HTTP status code followed by a word. ``headers`` is a list of two values tuples or possible HTTP headers. The return value of ``start`` response is another callable which when invoked return the body of the response.
es: Una aplicación WSGI no es más que un objeto invocable que responde a las solicitudes tomando dos argumentos. El primero es el ''ambiente'' del WSGI y el segundo es el ``start_response``. El ``environment`` es un diccionario de Python que contiene información sobre el entorno CGI. ``start_response`` es una devolución de llamada que toma dos entradas: la respuesta, ``status`` y ``headers``. El estado es una representación de cadena como ``200 OK`` o cualquier otro código de estado HTTP seguido de una palabra. ``headers`` es una lista de dos valores, tuplas o posibles encabezados HTTP. El valor devuelto de la respuesta ``start`` es otro invocable que, cuando se invoca, devuelve el cuerpo de la respuesta.

source: It is the responsiblity of the WSGI server to implement this callback. That is, the Python web application or the framework simply recieve it.
es: Es responsabilidad del servidor WSGI implementar esta devolución de llamada. Es decir, la aplicación web Python o el framework simplemente lo reciben.

source: The WSGI application is invoked with the ``environment`` and ``start_response``, it may or may not use information from the ``environment``, when done it should return an iterable yielding zero or more strings which then become the body of the response. It may also manipulate the headers passed on to ``start_response`` before invoking it.
es: La aplicación WSGI se invoca con el ``environment`` y ``start_response``, puede o no usar información del ``environment``, cuando se hace debe devolver un iterable que produce cero o más cadenas que luego se convierten en el cuerpo de la respuesta. También puede manipular los encabezados pasados a ``start_response`` antes de invocarlo.

source: The following is a complete valid WSGI application:
es: La siguiente es una solicitud WSGI válida y completa:

source: Running a WSGI application
es: Ejecución de una aplicación WSGI

source: To actually make use of the above example, you need to invoke it with a valid WSGI server. Luckily, we don't need to fully setup a HTTP server, because the Python standard library already has already s simple HTTP server which implements the WSGI protocal which we can use to test our app. To make use of it you can do:
es: Para hacer uso del ejemplo anterior, debe invocarlo con un servidor WSGI válido. Afortunadamente, no necesitamos configurar completamente un servidor HTTP, porque la biblioteca estándar de Python ya tiene un servidor HTTP simple que implementa el protocolo WSGI que podemos usar para probar nuestra aplicación. Para hacer uso de ella puedes hacer:

source: In reality, a WSGI server is usually depoloyed behing a full blown HTTP server, which serves as a reverse proxy for the WSGI server. That is, the HTTP server (for example NGinx) listen to HTTP or HTTPS requests on port 80 or 443 and then redirects them to the appropriate socket to which the WSGI server is bound to.
es: En realidad, un servidor WSGI generalmente se divide detrás de un servidor HTTP completo, que sirve como un proxy inverso para el servidor WSGI. Es decir, el servidor HTTP (por ejemplo, Nginx) escucha las solicitudes HTTP o HTTPS en el puerto 80 o 443 y, a continuación, las redirige al socket adecuado al que está enlazado el servidor WSGI.

source: Excercise 1
es: Ejercicio 1

source: Write your own callable class which is a valid WSGI application.
es: Escriba su propia clase invocable, que es una aplicación WSGI válida.

source: Solution
es: Solución

source: How to build your own webframework from scracth
es: Cómo construir tu propio marco web a partir desde cero

source: Contents:
es: Contenidos:

source: Indices and tables
es: Indices y tablas

source: About this course
es: Acerca de este curso

source: This one day course invites you to build your own micro web framework in Python. It will help you to fundamentally understand how common Python web frameworks work.
es: Este curso de un día te invita a construir tu propio framework micro web en Python. Le ayudará a comprender fundamentalmente cómo funcionan los marcos web comunes de Python.

source: To get the most out of this course, it is expected that you already, have some experience working with Python some background on web development with Python.
es: Para sacar el máximo provecho de este curso, se espera que ya tengas algo de experiencia trabajando con Python y algunos antecedentes en desarrollo web con Python.

source: We will start by exploring WSGI, a Python protocol for connecting Python application to web servers. We continue our journey to build the framework using Python language features which might be less familiar to Python beginners and maybe even developers with several years of experience in Python.
es: Comenzaremos explorando WSGI, un protocolo de Python para conectar aplicaciones de Python a servidores web. Continuamos nuestro viaje para construir el marco utilizando características del lenguaje Python que pueden ser menos familiares para los principiantes de Python y tal vez incluso para los desarrolladores con varios años de experiencia en Python.

source: These topics are Python's data model, meta-classes and functional programming.
es: Estos temas son el modelo de datos de Python, las metaclases y la programación funcional.

source: Metaclasses
es: Metaclases

source: A middleware is an object that wrapps the original application, hence the name. A middle is called between the application and the server. It can modify the response or the environment or route requests to different application objects.
es: Un middleware es un objeto que crea la aplicación original, de ahí su nombre. Se llama a un intermediario entre la aplicación y el servidor. Puede modificar la respuesta o el entorno o enrutar solicitudes a diferentes objetos de la aplicación.

source: Middlewares and apps are agnostic to each other, so we can plumb any WSGI app to our middleware, and our middleware to any WSGI app. Middleware can be chained, allowing our response or request to go through multiple phases of processing.
es: Los middlewares y las aplicaciones son independientes entre sí, por lo que podemos conectar cualquier aplicación WSGI a nuestro middleware, y nuestro middleware a cualquier aplicación WSGI. El middleware se puede encadenar, lo que permite que nuestra respuesta o solicitud pase por múltiples fases de procesamiento.

source: Here is for example how the Django web framework chains multiple middlewares before calling the application:
es: A continuación, se muestra un ejemplo de cómo el marco web Django encadena varios middlewares antes de llamar a la aplicación:

source: Django imports these middlewares from the their specified module and plumbs them one after another. Let's see how we can do that too.
es: Django importa estos middlewares desde el módulo especificado y los sondea uno tras otro. Veamos cómo podemos hacer eso también.

source: Other frameworks use ``extensions`` sometimes also called ``plugins`` or ``includes``. For example, the Flask framework really wraps the ``Application`` instance:
es: Otros frameworks usan ``extensiones`` a veces también llamados ``plugins`` o ``includes``. Por ejemplo, el marco Flask realmente envuelve la instancia de ``Application``:

source: ``Bottle.py`` has a similar approach:
es: ``Bottle.py`` tiene un enfoque similar:

source: Bottle hides the fact the the ``app.install`` command is wrapping your application with a call plugin which takes place before your application and after your application login. These action could be for example opening and closing connections to the database before and after the request if needed.
es: Bottle oculta el hecho de que el comando ``app.install`` está envolviendo su aplicación con un complemento de llamada que tiene lugar antes de su aplicación y después de iniciar sesión en su aplicación. Estas acciones podrían ser, por ejemplo, abrir y cerrar conexiones a la base de datos antes y después de la solicitud, si es necesario.

source: A Simple WSGI Middleware
es: Un simple middleware WSGI

source: As an example we show a simple WSGI middle which logs the environment dictionary to the console:
es: A modo de ejemplo, mostramos un medio WSGI simple que registra el diccionario del entorno en la consola:

source: Exercise 2
es: Ejercicio 2

source: Implement your own middleware which capitalizes the response you original application return.
es: Implemente su propio middleware que capitalice la respuesta que devuelve la aplicación original.

source: Exercise 3
es: Ejercicio 3

source: Implement your own middleware which reverses the response. Upon calling this middleware twice you should see the original response, e.g.:
es: Implemente su propio middleware que revierta la respuesta. Al llamar a este middleware dos veces, debería ver la respuesta original, por ejemplo:

source: From Raw WSGI to a framework
es: Desde un Crudo Raw WSGI a un framework

source: While useful for understanding how WSGI works, the examples shown until now are still far being called a framework. A Python webframework usually has the following attributes:
es: Si bien es útil para comprender cómo funciona WSGI, los ejemplos mostrados hasta ahora todavía están lejos de llamarse un marco. Un marco web de Python suele tener los siguientes atributos:

source: It pre-process the environment and yields some `request` object for the programmer to work with. This request is sometimes injected to the callable we program, as for example in Pyramid:
es: Preprocesa el entorno y produce algún objeto de "solicitud" para que el programador trabaje con él. Esta solicitud a veces se inyecta en el invocable que programamos, como por ejemplo en Pyramid:

source: or in Django:
es: o en Django:

source: In other cases it is a global instance object you have to explicitly import and make use of, as in the case of `Flask` or `Bottle`:
es: En otros casos, se trata de un objeto de instancia global que hay que importar y utilizar de forma explícita, como en el caso de `Flask` o `Bottle`:

source: Add a Response wrapper, which makes it easier to write correct responses. As such, we don't have manually call `start_response` every time. Nor do we remember that our return value is some kind of iterable. Here is an example from `Flask`:
es: Agregue un contenedor de respuesta, lo que facilita la escritura de respuestas correctas. Como tal, no tenemos que llamar manualmente a `start_response` cada vez. Tampoco recordamos que nuestro valor de retorno es una especie de iterable. Aquí hay un ejemplo de `Flask`:

source: Add some smart way of handling URL and request query parameters. For example Django injects URL parameter to your application logic, which allowes you to make explicit use of them:
es: Agregue alguna forma inteligente de manejar los parámetros de consulta de URL y solicitud. Por ejemplo, Django inyecta el parámetro URL en la lógica de su aplicación, lo que le permite hacer un uso explícito de ellos:

source: Forms are processed and saved into a Dictionary like object, request.POST_ and query data in saved into a request.GET_.
es: Los formularios se procesan y se guardan en un diccionario como objeto, request.POST_ y los datos de consulta se guardan en una request.GET_.

source: Add session and cookie management such that you manage some state. Using cookies you can store information in the browser, for example login cookie. And using sessions you can remember how the user interacted with your website, for example you can remember the login date and time.
es: Agregue la administración de sesiones y cookies de modo que administre algún estado. Mediante el uso de cookies, puede almacenar información en el navegador, por ejemplo, una cookie de inicio de sesión. Y usando sesiones, puede recordar cómo interactuó el usuario con su sitio web, por ejemplo, puede recordar la fecha y la hora de inicio de sesión.

source: Optionally, add HTML templating.
es: Opcionalmente, agregue plantillas HTML.

source: Optionally, add some persistency layer, e.g ORM or a NoSQL abstraction layer.
es: Opcionalmente, agregue alguna capa de persistencia, por ejemplo, ORM o una capa de abstracción NoSQL.

source: Alas, we are not going to implement all those in just a couple of hours. Instead, we are going to see how we can exploit Python's data model to build convenient Python APIs for out Nano Python framework. We start by implementing dictionary like session storage.
es: Por desgracia, no vamos a implementar todo eso en solo un par de horas. En su lugar, vamos a ver cómo podemos explotar el modelo de datos de Python para crear API de Python convenientes para nuestro marco de trabajo Nano Python. Comenzamos implementando el almacenamiento de sesión similar al diccionario.

source: Routing
es: Rutas

source: Routing is the mechanism which allows our application to call different parts according to the requested URL. Until now only saw applications that always give the same response to any requested URL.
es: El enrutamiento es el mecanismo que permite a nuestra aplicación llamar a diferentes partes según la URL solicitada. Hasta ahora solo se veían aplicaciones que siempre dan la misma respuesta a cualquier URL solicitada.

source: Using ``PATH_INFO``
es: Usando ``PATH_INFO``
