Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/advanced-python.po
Languages: es

source: The requested URL contains a ``PATH_INFO`` which is passed to our WSGI application via the ``environment`` dictionary. We can write our application as a giant case switch to match a specific ``PATH_INFO`` to a specific behavior:
es: La URL solicitada contiene un ``PATH_INFO`` que se pasa a nuestra aplicación WSGI a través del diccionario ``environment``. Podemos escribir nuestra aplicación como un interruptor de caso gigante para que coincida con un ``PATH_INFO`` específico con un comportamiento específico:

source: This would be very un-pythonic and cumbersome to extend. Essentially, this problem is solved by all web framework with some kind of a routing middleware. But before we examine how it is done by some of the most famous WSGI frameworks, we implement a primitive routing middleware on our own.
es: Esto sería muy poco pythonico y engorroso de extender. Esencialmente, este problema se resuelve mediante todos los marcos web con algún tipo de middleware de enrutamiento. Pero antes de examinar cómo lo hacen algunos de los frameworks WSGI más famosos, implementamos un middleware de enrutamiento primitivo por nuestra cuenta.

source: Exercise 4
es: Ejercicio 4

source: A small improvement would be to replace the giant ``if ... elif ... else`` with a dictionary and map a ``PATH_INFO`` to a callable. The middleware should use this mapping to call the correct WSGI callable.
es: Una pequeña mejora sería reemplazar el gigante ``if ... elif ... else`` con un diccionario y asigna un ``PATH_INFO`` a un invocable. El middleware debe usar esta asignación para llamar al WSGI correcto.

source: While this solution is pretty primitive it is understand and extend. Essententialy, many WSGI framework have some kind of a ``Mapping`` class which is responsible for this mechanism. For example, in Djanog one defines in ``urls.py`` a list of patters, which are a regular expression and callable ``view``. Here is an example from the most venerable Django polls tutorial:
es: Si bien esta solución es bastante primitiva, es comprensible y ampliada. Esencialmente, muchos marcos WSGI tienen algún tipo de clase de ``Mapeo`` que es responsable de este mecanismo. Por ejemplo, en Djanog se define en ``urls.py`` una lista de patrones, que son una expresión regular y una ``view`` invocable. Aquí hay un ejemplo del tutorial de encuestas de Django más venerable:

source: The ``url`` items are then matched by django.urls.resolvers.ResolverMatch_ A similar approach is also taken by the more modern ``aiohttp`` (an honorable reference, even though it's not a WSGI framework):
es: Los elementos ``url`` son entonces comparados por django.urls.resolvers.ResolverMatch_Un enfoque similar también es adoptado por el más moderno ``aiohttp`` (una referencia honorable, aunque no es un marco WSGI):

source: Pyramid does this too:
es: Pyramid también hace esto:

source: Here ``add_route`` creates an association between a ``route_name`` and a pattern. ``add_view`` connects the callable ``hello_world`` with the route just created.
es: Aquí ``add_route`` crea una asociación entre un ``route_name`` y un patrón. ``add_view`` conecta el ``hello_world`` invocable con la ruta que se acaba de crear.

source: ``Flask`` and ``Bottle`` have an implicit way of adding ``route`` items to the ``Mapping``:
es: ``Flask`` y ``Bottle`` tienen una forma implícita de añadir elementos de ``ruta`` al ``Mapeo``:

source: ``app.route`` adds the wrapped callable to the internal mapping inside the ``Flask`` instance. In a later part of this course, we will examine later how this decorator works.
es: ``app.route`` agrega el invocable envuelto al mapeo interno dentro de la instancia de ``Flask``. En una parte posterior de este curso, examinaremos más adelante cómo funciona este decorador.

source: Working with URL parameters
es: Trabajar con parámetros de URL

source: So far, we have a simple routing middleware. But it can't work with parameters, as seen in the Django and Pyramid examples above. A middleware can modify the response or the environment. Modifying the latter, we can pass new objects via the environment dictionary to the callable.
es: Hasta ahora, tenemos un middleware de enrutamiento simple. Pero no puede trabajar con parámetros, como se ve en los ejemplos de Django y Pyramid anteriores. Un middleware puede modificar la respuesta o el entorno. Modificando este último, podemos pasar nuevos objetos a través del diccionario del entorno al invocable.

source: Exercise 5
es: Ejercicio 5

source: Modify the main app matching mechanism to use regular expression groups, to match certain URL parts as groups. These groups are the URL args, the application can make use of. For example, calling ``/hello/`` should return ``hello wolrd!``. Calling ``/hello/frank`` should return ``/hello/frank!``.
es: Modifique el mecanismo principal de coincidencia de aplicaciones para usar grupos de expresiones regulares, a fin de que coincidan con determinadas partes de URL como grupos. Estos grupos son los argumentos de URL que la aplicación puede utilizar. Por ejemplo, llamar a ``/hello/`` debería devolver ''¡hola mundo!''. Llamar a ``/hello/frank`` debería devolver ``/hello/frank!``.

source: Summary
es: Resumen

source: The amalgamation of the ideas we showed here can be demonstrated by the nano-framework ``Chick``:
es: La amalgama de las ideas que mostramos aquí se puede demostrar mediante el nano-framework ``Chick``:
