Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/api.po
Languages: es

source: Programming Plone
es: Programando en Plone

source: The most important tool nowadays for plone-developers is the addon `plone.api <https://docs.plone.org/external/plone.api/docs/index.html>`_ hat covers 20% of the tasks any Plone developer does 80% of the time. If you are not sure how to handle a certain task be sure to first check if plone.api has a solution for you.
es: La herramienta más importante actualmente para desarrolladores Plone es el complemento `plone.api <https://docs.plone.org/external/plone.api/docs/index.html>`_ , el cual cubre el 20% de las tareas que cualquier desarrollador Plone que normalmente hace en 80% de su tiempo. Si no estas seguro de como manejar alguna tarea, verifica primero si plone.api tiene una solución para ti.

source: The api is devided in five sections. Here is one example from each:
es: El api esta divido en cinco (5) secciones. Este es un ejemplo de cada uno:

source: `Content`: `Create content <https://docs.plone.org/external/plone.api/docs/content.html#create-content>`_
es: `Contenido`: `Crear contenido <https://docs.plone.org/external/plone.api/docs/content.html#create-content>`_

source: `Portal`: `Send E-Mail <https://docs.plone.org/external/plone.api/docs/portal.html#send-e-mail>`_
es: `Portal`: `Enviar E-Mail <https://docs.plone.org/external/plone.api/docs/portal.html#send-e-mail>`_

source: `Groups`: `Grant roles to group <https://docs.plone.org/external/plone.api/docs/group.html#grant-roles-to-group>`_
es: `Grupos`: `Asignar roles al grupo <https://docs.plone.org/external/plone.api/docs/group.html#grant-roles-to-group>`_

source: `Users`: `Get user roles <https://docs.plone.org/external/plone.api/docs/user.html#get-user-roles>`_
es: `Usuarios`: `Obtener roles de usuario <https://docs.plone.org/external/plone.api/docs/user.html#get-user-roles>`_

source: `Environment`: `Switch roles inside a block <https://docs.plone.org/external/plone.api/docs/env.html#switch-roles-inside-a-block>`_
es: `Entorno`: `Cambiar roles dentro de un bloque <https://docs.plone.org/external/plone.api/docs/env.html#switch-roles-inside-a-block>`_

source: plone.api is not yet part of the Plone core. Therefore you will not see any use of plone.api in in Plone itself. But we are sure it will be part of Plone 5 if someone gets around to submitting the PLIP.
es: plone.api aun no es parte del nucleo de Plone, Por lo tanto no veras ningun uso de plone.api dentro de Plone. Pero estamos seguros que sera parte de Plone 5 si alguien se encarga de enviar el PLIP.

source: In existing code you'll often encounter methods that don't mean anything to you. You'll have to use the source to find out about what they do.
es: En el código existente a veces encontraras métodos que no significan nada para usted. Usted tiene que usar el código fuente para averiguar que hacen.

source: Some of these methods will be replaced by plone.api in the future:
es: Algunos de estos métodos serán reemplazados por ``plone.api`` en el futuro:

source: portal-tools
es: Herramientas del portal

source: Some parts of Plone are very complex modules in themselves (e.g. the while versioning-machinery of ``Products.CMFEditions``). Some of them have an api that you will have to learn sooner or later.
es: Algunas partes de Plone son módulos muy complejos entre si (ej. blanco mecanismo de versionado de ``Products.CMFEditions``). Algunos de ellos tienen una API que usted aprenderá a usar tarde o temprano.

source: Here are a few examples:
es: Aquí tienes unos ejemplos:

source: ``unrestrictedSearchResults()`` returns search-results without checking if the current user has the permission to access the objects.
es: ``unrestrictedSearchResults()`` regresa los resultados de búsqueda sin verificar si el usuario actual tiene permiso de acceso a los objetos.

source: ``uniqueValuesFor()`` returns all entries in a index
es: ``uniqueValuesFor()`` regresa todas las entradas en un indice

source: ``runAllExportSteps()`` generates a tarball containing artifacts from all export steps.
es: ``runAllExportSteps()`` genera un archivo comprimido en formato Tar conteniendo los artefactos de todos los pasos de exportación.

source: ``isProductInstalled()`` checks wether a product is installed.
es: ``isProductInstalled()`` verifica si un producto esta instalado.

source: Usually the best way to learn about the api of a tool is to look in the ``interfaces.py`` in the respective package and read the docstrings.
es: Usualmente la mejor forma para aprender acerca de la herramienta de un API es mirando en el archivo ``interfaces.py`` en el respectivo paquete y leer la documentación incluida en ``docstrings``.

source: Debugging
es: Depurando

source: Here are some tools and techniques we often use when developing and debugging. We use some of them in various situations during the training.
es: Aquí hay algunas herramientas y técnicas que usamos frecuentemente cuando desarrollamos y depuramos. Usamos algunas de ellas en varias situaciones durante el entrenamiento.

source: tracebacks and the log
es: Rastreos y el registro

source: The log (and the console when running in foreground) collect all log-messages Plone prints. When a exception occurs Plone thows a traceback. Most of the time the traceback is everything you need to find out what is going wrong. Also adding your own information to the log is very simple.
es: El registro (y la consola cuando ejecutamos en modo foreground) recolecta todos los mensajes de registro que Plone imprime. Cuando ocurre una excepción Plone lanza un rastreo. La mayoría del tiempo el rastreo es todo lo que necesitas para averiguar que esta sucediendo. También agregando tu propia información al registro es muy simple.

source: The python debugger pdb is the single most important tool for us when programming. Just add ``import pdb; pdb.set_trace()`` in your code and debug away!
es: El depurador de Python pdb, es la herramienta simple más importante para nosotros cuando programemos. ¡Solo agrega ``import pdb; pdb.set_trace()`` en tu código y empieza a depurar!

source: A addon that has two killer-features.
es: Un complemento que tiene dos características esenciales para su uso.

source: **Post-mortem debugging**: throws you in a pdb whenever a exception occurs. This way you can find out what is going wrong.
es: **Post-mortem debugging**: le lanza en un pdb cuando ocurra una excepción. De esta forma puedes averiguar que es lo que esta mal.

source: **pdb-view**: simply adding ``/pdb`` to a url drops you in a pdb-session with the current context as ``self.context``. From there you can do just about anything.
es: **pdb-view**: simplemente agregando ``/pdb`` a una dirección URL, le lanza a una sesión pdb con el contexto actual como ``self.context``. De allí puedes hacer casi todo.

source: Debug-mode
es: Modo Depuración

source: When starting Plone using ``./bin/instance debug -O Plone`` you'll end up in a interactive debugger.
es: Cuando se inicia Plone usando el comando ``./bin/instance debug -O Plone`` usted terminará en una depurador Interactivo.

source: A addon that allows you to inspect nearly everything. It even has a interactive console and a tester for TALES-expressions.
es: Un complemento que permite inspeccionar todo muy cercanamente. Incluso tiene una consola interactiva y un probador para expresiones TALES.

source: An addon that allows to reload code that you changed without restarting the site. It is also used by plone.app.debugtoolbar.
es: Un complemento que permite recargar el código que has cambiado sin reiniciar el sitio. Esto es también usado por plone.app.debugtoolbar.

source: A addon that prevents Plone from sending mails. They are instead logged.
es: Un complemento que previene a Plone de enviar mensajes. Ellos son registrados como eventos en el registro o log del servicio.

source: Addon that allows to use pdb and ipdb in python skin-scripts. Very useful.
es: Complemento que permite usar pdb y ipdb en scripts Python skin. Muy útil.

source: A option for the recipe *plone.recipe.zope2instance* that logs the detailed reasons why a user might not be authorized to see something.
es: Una opción para la receta *plone.recipe.zope2instance* que registra las razones detalladas sobre por que un usuario no puede ser autorizado a ver algo.

source: A option when running buildout that logs all the pulled packages and versions.
es: Una opción que cuando se ejecute buildout realiza registros de los paquetes traídos y sus versiones.

source: `Sentry <https://github.com/getsentry/sentry>`_ is a error logging application you can host yourself. It aggregarates tracebacks from many sources and (here comes the killer-feature) even the values of variables in the stacktrace. We use it in all our production-sites.
es: `Sentry <https://github.com/getsentry/sentry>`_ es una aplicación de registro de errores que puede usar usted mismo. Agrega rastreos de muchas fuentes y (aquí viene la característica esencial para su uso) incluso los valores de las variables en el stacktrace. Lo usamos en todos nuestro sitios en producción.

source: Buildout can create a python-shell for you that has all the packages from your plone-site in it's python-path. Add the part like this::
es: Buildout puede crear un script shell de python para ti que tiene los paquetes de su sitio plone en su path de python. Agrega la parte como esto::
