Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/behaviors1.po
Languages: es

source: Behaviors
es: Comportamientos

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: You can extend the functionality of your dexterity object by writing an adapter that adapts your dexterity object to add another feature or aspect.
es: Usted puede extender la funcionalidad de su objeto Dexterity solo creando un adaptador que se adapte a su objeto Dexterity para agregar otra característica o aspecto.

source: But if you want to use this adapter, you must somehow know that an object implements that. Also, you could not easily add more fields to an object with such an approach.
es: Pero si usted desea utilizar este adaptador, debe saber saber de alguna manera que un objeto implementa este. Además, usted no puede fácilmente agregar más campos a un objeto con ese enfoque.

source: Dexterity Approach
es: Enfoque Dexterity

source: Dexterity has a solution for it, with special adapters that are called and registered by the name behavior.
es: Dexterity tiene una solución para ello, con adaptadores especiales los cuales se llaman y registran por el nombre del comportamiento.

source: A behavior can be added to any content type through the web and during runtime.
es: Un comportamiento puede ser agregado a cualquier tipo de contenido a través de la Web y durante el tiempo de ejecución.

source: All default views know about the concept of behaviors and when rendering forms, the views also check whether there are behaviors referenced with the current context and if these behavior have a schema of their own, these fields get shown in addition.
es: Todas las vistas predeterminadas deben conocer el concepto de comportamientos y cuando renderizar los formularios, las vistas también comprueban si hay comportamientos referenciados con el contexto actual y si estos comportamientos tienen un esquema propio, esos campos se mostraran adicionalmente.

source: This this functionality in place, you can extend your content types during runtime, through the web.
es: Esta funcionalidad en lugar, usted puede extender los tipos de contenido durante la corrida, y a traves de la web.

source: Names and Theory
es: Nombres y Teoria

source: Such an object allows you to apply the `Open/closed principle`_ to your dexterity objects.
es: Como un objeto le permite aplicar el `principio Abierto/cerrado`_ a los objetos de Dexterity.

source: Practical example
es: Ejemplo práctico

source: So, let us write our own small behavior.
es: Así que, vamos a escribir nuestro propio pequeño comportamiento.

source: So for now, our behavior just adds a new field for storing the url to Lanyrd.
es: Así que por ahora, nuestro comportamiento sólo añade un nuevo campo para almacenar la dirección URL del servicio Lanyrd.

source: We want to keep a clean structure, so we create a :file:`behaviors` directory first, and include it into the zcml declarations of our :file:`configure.zcml`.
es: Queremos mantener una estructura limpia, así que creamos primero un directorio :file:`behaviors`, y luego lo incluimos dentro de las declaraciones ZCML de nuestro archivo :file:`configure.zcml`.

source: Then, we add an empty :file:`behaviors/__init__.py` and a :file:`behaviors/configure.zcml` containing
es: Entonces, agregamos un archivo vacio :file:`behaviors/__init__.py` y un archivo :file:`behaviors/configure.zcml` conteniendo el siguiente código:

source: Advanced reference
es: Referencia avanzada

source: The original documentation is doctest code, so no documentation and no debuggable test.
es: La documentación original tiene código doctest, así que no hay documentación y ninguna prueba depurable.

source: It can be a bit confusing of when to use factory, or marker interfaces and when not.
es: Puede ser un poco confuso cuándo se utilizar la factory, o las interfaces marker y cuando no.

source: If you do not define a factory, your attributes will be stored directly on the object. This can result in clashes with other behaviors.
es: Si usted no define un factory, sus atributos se almacenan directamente en el objeto. Esto puede dar lugar a resultar en comportamientos no deseados.

source: You can avoid this by using the plone.behavior.AnnotationStorage factory. This one stores your attributes in an :ref:`Annotation <plone:annotations>`. But then you *must* use a marker interface if you want to have custom viewlets, browser views or portlets.
es: Esto se puede evitar mediante el uso de la fábrica ``plone.behavior.AnnotationStorage``. Éste almacena sus atributos en una :ref:`Annotation <plone:annotations>`. Pero entonces usted *debe* utilizar una interfaz marcador si usted quiere tener viewlets personalizados, browser views o portlets.

source: Without it, you would have no interface against which you could register your views.
es: Sin ella, no tendrías interfaz contra el cual podría registrar sus vistas.

source: And a :file:`behaviors/social.py` containing:
es: Y un archivo :file:`behaviors/social.py` conteniendo el siguiente código:

source: Lets get through this step by step.
es: Vamos a llevarlo a través de este paso a paso.

source: We register a behavior in :ref:`behaviors/configure.zcml <social-behavior-zcml-label>`. We do not say for which content type this behavior is valid. You do this, through the web or in the GenericSetup profile.
es: Registramos un comportamiento en el archivo :ref:`behaviors/configure.zcml <social-behavior-zcml-label>`. Nosotros decimos para qué tipo de contenido este comportamiento es válido. Para hacer esto, a través de la Web o en el perfil GenericSetup.

source: We create a marker interface in :ref:`behaviors/social.py <social-behavior-python-label>` for our behavior and make it also a schema containing the fields we want to declare. We could just use define schema fields on a zope.intereface class, but we use an extended form from `plone.supermodel`_, else we could not use the fieldset features.
es: Creamos una interfaz marcador en :ref:`behaviors/social.py <social-behavior-python-label>` para nuestro comportamiento y hacer que sea también un esquema el cual contiene los campos que queremos declarar. Podríamos simplemente utilizar definiciones de campos de esquema en una clase ``zope.interface``, pero utilizar un formulario extendido desde el paquete `plone.supermodel`_, de lo contrario nosotros podríamos no usar las características del conjunto de campos.

source: We add a normal `URI`_ schema field to store the URI to lanyrd.
es: Añadimos un campo de esquema `URI`_ normal para almacenar la dirección URI del servicio Lanyrd.

source: Adding it to our talk
es: Agregandolo a nuestra charla

source: We could add this behavior now via the plone control panel. But instead, we will do it directly properly in our GenericSetup profile
es: Podríamos añadir este comportamiento ahora a través del panel de control de Plone llamado ``Tipos de contenidos Dexterity``. Pero en cambio, lo haremos directamente adecuadamente en nuestro perfil GenericSetup

source: We must add the behavior to :file:`profiles/default/types/talk.xml`:
es: Debemos agregar el comportamiento al archivo :file:`profiles/default/types/talk.xml`:
