Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/CHANGES.po
Languages: es

source: Changelog
es: Cambios

source: This changelog is only very rough. For the full changelog please refer to https://github.com/plone/training/commits/master
es: Este registro de cambios es solo muy difícil. Para el registro completo de cambios, consulte la siguiente dirección URL https://github.com/plone/training/commits/master

source: 1.2.5 (unreleased)
es: 1.2.5 (sin publicar)

source: Fixes to Advanced Python Training [oz123]
es: Corregir el Entrenamiento en Python Avanzado [oz123]

source: Add one more chapter to Advanced Python Training [oz123]
es: Agregar uno capítulo de más al Entrenamiento en Python Avanzado [oz123]

source: Updates and Fixes in the JavaScript training section [staeff]
es: Actualizar y Corregir la sección de entrenamiento JavaScript [staeff]

source: Reorder Javascript exercises [frapell]
es: Reordenar ejercicios Javascript [frapell]

source: Add content of Advanced Python Training [oz123]
es: Agregar contenido al Entrenamiento en Python Avanzado [oz123]

source: Markup fixes and small edits [jean]
es: Corregir etiquetado y ediciones pequeñas [jean]

source: different buildout invocation in vagrant setup [tschorr]
es: diferentes invocación de buildout en la instalación vagrant [tschorr]

source: Bring similar chapters into sync (ttw/mastering) [jean]
es: Ponga los capítulos similares en sincronización (ttw/mastering) [jean]

source: Add missing Build step [jean]
es: Agregar paso de Construcción perdida [jean]

source: Fix some more Sphinx warnings [jean]
es: Corregir algunas advertencias Sphinx [jean]

source: Update to ttw-advanced-2 in theming training [jean]
es: Actualizar el ttw-advanced-2 en entrenamiento de temas [jean]

source: Update Mastering Plone Chapters for Ploneconf 2017 and use Plone 5.1rc1 [pbauer]
es: Actualizar Capítulos de "Maestria en Plone 5" para la Ploneconf 2017 y usar la versión de Plone 5.1rc1 [pbauer]

source: More formatting, markup and editing [jean]
es: Más formatos, etiquetado y edición [jean]

source: Update link [sgrepos]
es: Actualizar enlace [sgrepos]

source: Add angular training [barbichu, fulv]
es: Agregar entrenamiento de angular [barbichu, fulv]

source: Fix some IDs and filename references [jean]
es: Corregir algun IDs y las referencias de nombre de archivo [jean]

source: Update and restructure theming documentation. [tmassman, RobZoneNet]
es: Actualizar y reestructurar la documentación de temas. [tmassman, RobZoneNet]

source: Use correct links for ZCA itself and its usage in Pyramid, as well in translation files. [stevepiercy]
es: Use los enlaces correctos para el ZCA y su uso en Pyramid, así como en archivos de traducción. [stevepiercy]

source: Update Features training to reflect that Dexterity is now supported by Working Copy Support and Placeful Workflow. [robinsjm2]
es: Actualizar Caracteristicas de entrenamiento ara reflejar que Dexterity ahora es soportado por Working Copy Support y Placeful Workflow. [robinsjm2]

source: Fix a typo [staeff, b4oshany]
es: Corregir un tipo [staeff, b4oshany]

source: Fix typos, improve wording [svx]
es: Corregir errores tipográficos, mejorar la redacción [svx]

source: Clarify which template we're editing [djowett]
es: Clarificar cual plantilla nosotros estamos editando [djowett]

source: Fix typos [tkimnguyen]
es: Corregir errores tipográficos [tkimnguyen]

source: Fix Sphinx warnings emitted on clean build [stevepiercy]
es: Corregir advertencias emitida Sphinx y limpiar construcción [stevepiercy]

source: Update README.rst to refer to how to build the docs locally. [stevepiercy]
es: Actualizar archivo README.rst para referenciar a como construir la documentación localmente. [stevepiercy]

source: Add CONTRIBUTING.md [stevepiercy]
es: Agregar archivo CONTRIBUTING.md [stevepiercy]

source: Move PloneConf 2016 to Previous Trainings [stevepiercy]
es: Mover PloneConf 2016 a la sección Entrenamientos Previos [stevepiercy]

source: Update JavaScript training with latest exercises and documentation using collective.jstraining [vangheem]
es: Actualizar entrenamiento JavaScript con los últimos ejercicios y documentación usando el paquete collective.jstraining [vangheem]

source: Update theming training to reflect the changes in bobtemplates.plone and general cleanup, also add refs to ttw training, remove usage of resource registry for theming [MrTango]
es: Actualizar entrenamiento de temas para reflejar los cambios en el paquete bobtemplates.plone y limpieza general, también agregar referencias al entrenamiento ttw, remover uso de registro de recursos para los temas [MrTango]

source: Add solr training [tomgross]
es: Agregar entrenamiento en solr [tomgross]

source: Rearrange structure so Mastering Plone now lives in it's own folder. [pbauer]
es: Reorganiza la estructura para que el entrenamiento Maestría en Plone ahora viva en su propia carpeta. [pbauer]

source: Fix directions which led to duplicate resourcess being delivered Closes https://github.com/plone/training/issues/174 [davilima6]
es: Repare las instrucciones que llevaron a que se entreguen recursos duplicados https://github.com/plone/training/issues/174 [davilima6]

source: Plone Doc Style for Javascript part. [jensens]
es: Estilos de documentación Plone para la parte Javascript. [jensens]

source: Add spell-checker, auto-build and travis-tests [svx]
es: Agregar corrección ortográfica, auto-build y pruebas travis [svx]

source: Use Plone 5 final and simplify vagrant-setup. [pbauer, fulv]
es: Usar versión final Plone 5 y simplificar la instalación vagrant. [pbauer, fulv]

source: Rewrite chapter on relations. [pbauer]
es: Revisar capítulo en relaciones. [pbauer]

source: Add a training on javasript. [frappel, thet]
es: Agregar un entrenamiento en javasript. [frappel, thet]

source: Add a training theming Plone 5. [MrTango, simahawk]
es: Agregar entrenamiento de temas para Plone 5. [MrTango, simahawk]

source: A ton of fixes in the development-training in preparation to Ploneconf 2015 in Bucarest. [fulv]
es: Un montón de correcciones en el entrenamiento de desarrollo en preparación en la Ploneconf 2015 en Bucarest. [fulv]

source: Update vagrant installation to include BIOS virtualization note. [lbrannon]
es: Actualizar instalación vagrant para incluir nota del BIOS para virtualización. [lbrannon]

source: Editing while reading. Edited Rapido chapter for language and formatting. [jean]
es: Editando mientras se leía. Editado capítulo Rapido por lenguaje y formato. [jean]

source: Fix a couple of duplicate labels, unmatched literal ending, typo [jean]
es: Corregir un par de etiquetas duplicadas, final literal sin coincidencia, error ortográfico [jean]

source: Fix code blocks that made Pygments lexer choke [jean]
es: Corregir bloques de código que hicieron Pygments lexer choke [jean]

source: Fix some typos, clarify some examples [jean]
es: Corregir algunos errores tipográficos, clarificar algunos ejemplos [jean]

source: Some exercises, draft of a new chapter on plone.restapi and some changes [tschorr]
es: Algunos ejercicios, borrador de un nuevo capítulo en plone.restapi y algunos cambios [tschorr]

source: Exercises for behaviors_2, fix some emphasis [tschorr]
es: Ejercicios para behaviors_2, corregir algunos enfasis [tschorr]

source: Fix some typos, apply inline directives: file, Python domain, GUI, literals [jean]
es: Corregir algunos errores tipográficos, aplicar directivas inline: file, dominio Python, GUI, literales [jean]

source: Add Plone 5 Workflow Training [calvinhp]
es: Agregar Entrenamiento Flujo de trabajo en Plone 5 [calvinhp]

source: Editing Dexterity chapters (typos, markup, some grammar) [jean]
es: Editando capítulos Dexterity (errores tipográficos, markup, algunas cosas gramatical) [jean]

source: Fix reST lists [davisagli]
es: Corregir listas reST [davisagli]

source: Specify Python version for virtualenv using option, not command alias, as alias is not always present [jean]
es: Especificar versión de Python para virtualenv usando opción, sin alias de comando, como alias no siempre esta presente [jean]

source: Fix duplicate labels [jean]
es: Corregir etiquetas duplicadas [jean]

source: Fix tests [gforcada]
es: Corregir pruebas [gforcada]

source: Review solr docs [gforcada]
es: Revisión de documentación solr [gforcada]

source: Revision of part one for Ploneconf 2014, Bristol [smcmahon]
es: Revision de parte uno para Ploneconf 2014, Bristol [smcmahon]

source: Revised for Ploneconf 2014, Bristol [pbauer, gomez]
es: Revisado para Ploneconf 2014, Bristol [pbauer, gomez]

source: Add first exercises and create css+js for expanding/collapsing the solutions [pbauer]
es: Agregue los primeros ejercicios y cree archivos css + js para expandir/colapsar las soluciones de las practicas [pbauer]

source: Fix local build with the rtd-Theme [pbauer]
es: Corregir la compilación local con el paquete rtd-Theme [pbauer]

source: Add Spanish translation. [macagua]
es: Agregar traducción al Español. [macagua]

source: Add support for translations on transifex [macagua]
es: Agregar soporte para las traducciones en transifex [macagua]

source: Move sources to https://github.com/plone/training and render at https://plone-training.readthedocs.io/en/legacy/ [pbauer]
es: Mover fuentes a https://github.com/plone/training y renderizar en https://plone-training.readthedocs.io/en/legacy/ [pbauer]

source: Integrate with docs.plone.org and papyrus [do3cc]
es: Integrar con docs.plone.org y papyrus [do3cc]

source: Change license to https://creativecommons.org/licenses/by/4.0/ [pbauer]
es: Cambiar licencia a https://creativecommons.org/licenses/by/4.0/ [pbauer]

source: Document how to contribute [pbauer]
es: Documento de como contribuir [pbauer, hellfish2]

source: Update introduction [pbauer]
es: Actualizar introducción [pbauer, hellfish2]

source: Fix all mistakes found during the training in May 2014 [pbauer]
es: Arreglar todos los errores encontrados durante el entrenamiento en Mayo 2014 [pbauer, hellfish2]

source: Move rst-files to https://github.com/starzel/training [pbauer]
es: Mover archivos rst al repositorio https://github.com/starzel/training [pbauer]

source: Publish verbose version on http://starzel.github.io/training/index.html [pbauer]
es: Publicar una versión detallada en http://starzel.github.io/training/index.html [pbauer, hellfish2]

source: Add bash-command to copy the code from ploneconf.site_sneak to ploneconf.site for each chapter [pbauer]
es: Agregar un comando bash, para copiar el código de ploneconf.site_sneak a ploneconf.site para cada capítulo [pbauer, hellfish2]

source: include vagrant-setup as zip-file [pbauer]
es: incluir instalación vagrant como un archivo zip [pbauer]

source: several small bug fixes [pbauer]
es: serios pequeños bugfixes [pbauer]

source: Heavily expanded and rewritten for a training in Mai 2014 [pbauer, do3cc]
es: Ampliamente expandido y reescrito para un entrenamiento en Mayo 2014 [pbauer, do3cc, hellfish2]

source: remove grok [pbauer]
es: remover grok [pbauer]

source: use plone.app.contenttypes from the beginning [pbauer]
es: usar plone.app.contenttypes desde el principio [pbauer, hellfish2]

source: use plone.api [pbauer]
es: usar plone.api [pbauer, hellfish2]

source: rewrite vagrant-setup [pbauer]
es: reescribir la instalación vagrant [pbauer]

source: drop use of plone.app.themeeditor [pbauer]
es: eliminar el uso de plone.app.themeeditor [pbauer]

source: add more chapters: Dexterity Types II: Growing up, User generated content, Programming Plone, Custom Search, Events, Using third-party behaviors, Dexterity Types III: Python, ... [pbauer, do3cc]
es: agregar más capítulos: Tipos Dexterity - Parte II: Creciendo, Contenido generado por el usuario, Programando en Plone, Búsqueda Personalizada, Eventos, Usando comportamientos de complementos de terceros, Tipos Dexterity - Parte III: Python, ... [pbauer, do3cc]

source: 1.1 (October 2013)
es: 1.1 (Octubre del 2013)

source: Revised and expanded for Ploneconf 2013, Brasilia [pbauer, do3cc]
es: Revisado y ampliado para la Ploneconf 2013, Brasilia [pbauer, do3cc]

source: 1.0 (October, 2012)
es: 1.0 (Octubre del 2012)

source: First version under the title 'Mastering Plone' for Ploneconf 2012, Arnhem [pbauer, do3cc]
es: Primera versión bajo el titulo 'Mastering Plone' para la Ploneconf 2012, Arnhem [pbauer, do3cc]

source: 0.2 October 2011
es: 0.2 Octubre 2011

source: Expanded as Plone-Tutorial for PyCon De 2011, Leipzig [pbauer]
es: Ampliado como el tutorial Plone para la PyCon De 2011, Leipzig [pbauer]

source: 0.1 (October 2009)
es: 0.1 (Octubre del 2009)

source: Initial parts created for the Plone-Einsteigerkurs (http://www.plone.de/trainings/einsteiger-kurs/kursuebersicht) [pbauer]
es: Partes iniciales creadas para el Plone-Einsteigerkurs (http://www.plone.de/trainings/einsteiger-kurs/kursuebersicht) [pbauer, hellfish2]
