Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/changelog.po
Languages: es

source: Changelog
es: Cambios

source: Move sources to https://github.com/plone/training and render at http://plone-training.readthedocs.io/en/legacy/ [pbauer]
es: Mover las fuentes de https://github.com/plone/training y renderizarlo en http://plone-training.readthedocs.io/en/legacy/ [pbauer]

source: Integrate with docs.plone.org and papyrus [do3cc]
es: integrar con docs.plone.org y papyrus [do3cc, hellfish2]

source: Change license to https://creativecommons.org/licenses/by/4.0/ [pbauer]
es: Cambiar licencia a https://creativecommons.org/licenses/by/4.0/ [pbauer]

source: Document how to contribute [pbauer]
es: Documento de como contribuir [pbauer, hellfish2]

source: Update introduction [pbauer]
es: Actualizar introducción [pbauer, hellfish2]

source: Fix all mistakes found during the training in May 2014 [pbauer]
es: Arreglar todos los errores encontrados durante el entrenamiento en Mayo 2014 [pbauer, hellfish2]

source: Move rest-files to https://github.com/starzel/training [pbauer]
es: Mover los rest-files a https://github.com/starzel/training [pbauer, hellfish2]

source: Publish verbose version on http://starzel.github.io/training/index.html [pbauer]
es: Publicar una versión verbosa en http://starzel.github.io/training/index.html [pbauer, hellfish2]

source: Add bash-command to copy the code from ploneconf.site_sneak to ploneconf.site for each chapter [pbauer]
es: Agregar un comando bash, para copiar el código de ploneconf.site_sneak a ploneconf.site para cada capítulo [pbauer, hellfish2]

source: include vagrant-setup as zip-file [pbauer]
es: Incluir vagrant-setup como un archivo Zip [pbauer, hellfish2]

source: several small bugfixes [pbauer]
es: Serios pequeños bugfixes [pbauer, hellfish2]

source: Heavily expanded and rewritten for a training in Mai 2014 [pbauer, do3cc]
es: Ampliamente expandido y reescrito para un entrenamiento en Mayo 2014 [pbauer, do3cc, hellfish2]

source: remove grok [pbauer]
es: Remover grok [pbauer, hellfish2]

source: use plone.app.contenttypes from the beginning [pbauer]
es: usar plone.app.contenttypes desde el principio [pbauer, hellfish2]

source: use plone.api [pbauer]
es: usar plone.api [pbauer, hellfish2]

source: rewrite vagrant-setup [pbauer]
es: Reescribir vagrant-setup [pbauer, hellfish2]

source: drop use of plone.app.themeeditor [pbauer]
es: Eliminar el uso de plone.app.themeeditor [pbauer, hellfish2]

source: add more chapters:
es: Agregue más capítulos:

source: Dexterity Types II: Growing up
es: Tipos Dexterity II: Creciendo

source: User generated content
es: Usar contenido generado

source: Programming Plone
es: Programando en Plone

source: Custom Search
es: Búsqueda Personalizada

source: Events
es: Eventos

source: Using third-party behaviors
es: Usando comportamientos de complementos de terceros

source: Dexterity Types III: Python
es: Tipos Dexterity - III: Python

source: 1.1 (October 2013)
es: 1.1 (Octubre 2013)

source: Revised for Ploneconf 2013, Brasilia [pbauer, do3cc]
es: Revisado para Ploneconf 2013, Brasilia [pbauer, do3cc, hellfish2]

source: 1.0 (October, 2012)
es: 1.0 (Octubre, 2012)

source: First version for Ploneconf 2012, Arnhem [pbauer, do3cc]
es: Primera versión de Ploneconf 2012, Arnhem [pbauer, do3cc, hellfish2]

source: 0.1 (October 2009)
es: 0.1 (Octubre 2009)

source: Initial parts created for the Plone-Einsteigerkurs (http://www.plone.de/trainings/einsteiger-kurs/kursuebersicht) [pbauer]
es: Partes iniciales creadas para el Plone-Einsteigerkurs (http://www.plone.de/trainings/einsteiger-kurs/kursuebersicht) [pbauer, hellfish2]
