Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/custom_search.po
Languages: es

source: Custom search
es: Búsqueda personalizada

source: We can use the indexes we created in the last chapter to further improve the talk-list.
es: Podemos usar los índices creados en el último capítulo para mejorar la lista de charlas.

source: If the chapters about views seem complex this might also be a great alternative until you feel comfortable writing views and templates. There are several tools that allow you to add amazing custom searches and content-listings through the web in Plone.
es: Si los capítulos acerca de las Vistas parece complejo este puede ser una gran alternativa hasta que te sientas confortable escribiendo vistas y plantillas. también hay muchas herramientas que permitan agregar impresionantes búsquedas personalizadas y listados de contenidos a través de la web en Plone.

source: Install `eea.facetednavigation <http://pypi.python.org/pypi/eea.facetednavigation/>`_
es: Instale el complemento `eea.facetednavigation <http://pypi.python.org/pypi/eea.facetednavigation/>`_.

source: Enable faceted navigation on a new folder "Discover talks" by clicking on *actions* > *Enable faceted navigation*
es: Habilita navegación en facetas en una nueva carpeta "Descubriendo charlas" haciendo clic en el menú de edición *Acciones* > *Enable faceted navigation*.

source: Click on the tab *Faceted criteria* to configure it
es: Haga clic en la pestaña *Faceted criteria* para configurar esta.

source: Select 'Talk' for *Portal type*, hide *Results per page*
es: Selecciona "Talk" para *Portal type*, oculta *Results per page*.

source: Add a checkboxes-widget to left and use the catalog index *Audience* for it.
es: Agregue un widget de selección a la izquierda y usa el indice de catalogo *Audience* para eso.

source: Add a select-widget for speaker
es: Agrega un widget de selección para el Speaker.

source: Add a radio-widget for type_of_talk
es: Agregue un widget de radio para type_of_talk.

source: Other noteable widgets are: tagcloud, a-z, search
es: Otros widgets notables son: tagcloud, a-z, search.

source: Examples:
es: Ejemplos:

source: We use the new catalog indexes to provide the data for the widgets and search the results. For other use-cases we could also use either the built-in vocabularies (https://pypi.python.org/pypi/plone.app.vocabularies) or create custom vocabularies for this.
es: Usaremos el nuevo índice de catálogo para proveer la data de los widgets y buscar los resultados. Para otros casos de uso podremos usar entre los vocabularios integrados (https://pypi.python.org/pypi/plone.app.vocabularies) o crear vocabularios personalizados para este.

source: Custom vocabularies ttw using `Products.ATVocabularyManager <https://pypi.python.org/pypi/Products.ATVocabularyManager>`_
es: Vocabularios personalizados a través de la Web usando `Products.ATVocabularyManager <https://pypi.python.org/pypi/Products.ATVocabularyManager>`_

source: Programming using Vocabularies: https://docs.plone.org/external/plone.app.dexterity/docs/advanced/vocabularies.html
es: Programando usando vocabularios: https://docs.plone.org/external/plone.app.dexterity/docs/advanced/vocabularies.html
