Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/deployment_code.po
Languages: es

source: Deploying your code
es: Desplegando tu código

source: pypi-test egg deployment
es: Despliegue de prueba en pypi del paquete egg

source: We finally have some working code! Depending on your policies, you need repeatable deployments and definitive versions of software. That means you don't just run your production site with your latest source code from your source repository. You want to work with eggs.
es: ¡Finalmente tenemos algo de código funcionando! dependiendo de sus políticas, usted necesitaras despliegues repetitivos y versiones definitivas de software. Lo que significa que no corres tu sitio en producción con tu ultimo fuente de tu repositorio de fuentes. Quieres trabajar con paquetes eggs.

source: Making eggs is easy, making them properly not so much. There are a number of good practices that you would like to ensure. Lets see. You want to have a sensible version number. By looking at the version number alone, one should get a good idea, how many changes there are (semantic version number scheme). You of course always document everything, but for upgrades it is even more important to have complete changelogs.
es: Haciendo los paquetes eggs es fácil, hacerlos apropiadamente no tanto, hay un gran numero de buenas practicas que le gustaría asegurar. Veamos. Quieres tener un número sensible de versión. Mirando solamente al número de versión, uno debería tener una idea, de cuantos cambios hay (esquema semántico de numero de versión). Tu por supuesto siempre debes documentar todo, pero para las actualizaciones es incluso más importante tener un registro de cambios.

source: Sometimes, you cannot upgrade to a newer version, but you need a hotfix or whatever. It is crucial that you are able to checkout the exact version you use for your egg.
es: Algunas veces no puedes actualizar a una nueva versión, pero necesitas un parche o algo. Es crucial que seas capaz de chequear la versión exacta que usas de su paquete egg.

source: This is a lot of steps to do, and there are a lot of actions that can go wrong. luckily, there is a way to automate it. zest.releaser provides scripts to release an egg, to check what has changed since the release and to check if the documentation has errors.
es: Hay muchos pasos que hacer, y muchas acciones que pueden salir mal. Afortunadamente, hay una forma de automatizarlo. zest.releaser provee scripts para publicar un paquete egg, chequear que ha cambiado y ver si la documentación tiene errores.

source: There once was a book on python. It also had a chapter on releasing an egg with sample code. The sample code was about a printer of nested lists. There are a lot of packages to print out nested lists on pypi.
es: Hubo una vez un libro en python. Ese tenia un capítulo de como instalar un paquete egg con un código ejemplo. El código ejemplo fue acerca de una lista anidada de impresoras. Hay muchos paquetes para imprimir listas anidadas en el Indice de paquetes Python (PyPI).

source: We will avoid this. Everybody, go to `testpypi.python.org <https://testpypi.python.org>`_ and create an account now.
es: Vamos a evitar esto. Todos, vayan a `testpypi.python.org <https://testpypi.python.org>`_ y creen una cuenta.

source: Next, copy the pypirc_sample file to ~/.pypirc, modify it to contain your real username and password.
es: Siguiente, copia el archivo pypirc_sample a ~/.pypirc, modifiquelo para contener tu usuario y contraseña real.

source: Now that we are prepared, let's install zest.releaser.
es: Ahora que estamos preparados, Instale el paquete zest.releaser.
