Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/dexterity_2.po
Languages: es

source: Get the code!
es: ¡Obtén el código!

source: The existing talks are still lacking some functionality we want to use.
es: Las charlas existentes todavía faltan algunas funciones que queremos utilizar.

source: In this part we will:
es: En esta parte vamos a tratar:

source: query the catalog for them
es: Hacer consultas al catálogo a estos.

source: Marker Interfaces
es: Interfaces Marcador

source: Let them be instances of a class that implements this Interface.
es: Dejemos que sean las instancias de una clase que implementa esta interfaz.

source: Register this interface as a behavior and enable it on talks.
es: Registra esta interfaz como un comportamiento y habilite este en el tipo de contenido Talk.

source: And enable it on the type in ``profiles/default/types/talk.xml``
es: Y habilite ese comportamiento en la definición de tipo de contenido en su configuración GenericSetup en el archivo ``profiles/default/types/talk.xml``

source: Either reinstall the addon, apply the behavior by hand or run an upgrade step (see below) and the interface will be there.
es: Vuelva a instalar el complemento, aplicar el comportamiento a mano o ejecutar una paso de actualización GenericSetup (ver más abajo) y la interfaz estará allí.

source: Then we can safely bind the talkview to the new marker interface.
es: Entonces podemos con seguridad unir la vista ``talkview`` a la nueva interfaz marker, agregando el siguiente código ZCML:

source: Now the ``/talkview`` can only be used on objects that implement said interface. We can now also query the catalog for objects providing this interface ``catalog(object_provides="ploneconf.site.interfaces.ITalk")``. The `talklistview` and the `demoview` do not get this constraint since they are not only used on talks.
es: Ahora la vista ``/talkview`` puede solamente se usada en objetos que implementan dicha interfaz. Ahora también podemos consultar el catálogo para los objetos que proporcionan esta interfaz ``catalog(object_provides="ploneconf.site.interfaces.ITalk")``. Las vistas `talklistview` y `demoview` no reciben esta restricción, ya que no sólo son utilizados en los tipos de contenidos talks.

source: Just for completeness sake, this is what would have to happen for the first option:
es: Sólo para completarlo, esto es lo que tendría que pasar por la primera opción:

source: Create a new class that inherits from ``plone.dexterity.content.Container`` and implements the marker interface.
es: Crear una nueva clase que herede desde ``plone.dexterity.content.Container`` e implementa la interfaz marker.

source: Modify the class for new talks in ``profiles/default/types/talk.xml``
es: Modificar la clase para los nuevos tipos de contenidos talks en el archivo ``profiles/default/types/talk.xml``

source: Create an upgrade step that changes the class of the existing talks. A reuseable method to do such a thing is in is `plone.app.contenttypes.migration.dxmigration.migrate_base_class_to_new_class <https://github.com/plone/plone.app.contenttypes/blob/master/plone/app/contenttypes/migration/dxmigration.py#L130>`_.
es: Crear un paso de actualización para modificar la clase de tipo de contenido existente. Un código ejemplo de como hacer esto lo encuentra en el paquete `ftw.upgrade <https://github.com/4teamwork/ftw.upgrade/blob/master/ftw/upgrade/step.py#L270>`_.

source: When projects evolve you'll sometimes have to modify various things while the site is already up and brimming with content and users. Upgrade steps are pieces of code that run when upgrading from one version of an addon to a newer one. They can do just about anything.
es: Cuando los proyectos se desarrollan a veces tendrá que modificar varias cosas mientras que el sitio ya este arriba, lleno de contenido y usuarios. Los pasos de actualización son piezas de código que se ejecutan al actualizar de una versión de un complemento a una más reciente. Ellos pueden hacer casi cualquier cosa.

source: runs the typeinfo step (i.e. loads the GenericSetup configuration stores in ``profiles/default/types.xml`` and ``profiles/default/types/...`` so we don't have to reinstall the addon to have our changes from above take effect) and
es: Ejecute el paso ``typeinfo`` (es decir, carga los almacenes de configuración GenericSetup en ``profiles/default/types.xml`` y ``profiles/default/types/...`` por lo que no tiene que volver a instalar el complemento para tener nuestros cambios hechos) y

source: cleans up some content that might be scattered around the site in the early stages of creating it. We will move all talks to a folder ``talks`` (unless they already are there).
es: haga una limpieza de algún contenido que pudiera estar esparcidos alrededor del sitio en las primeras etapas de su creación. Nos movemos todas los tipos de contenidos talks en una carpeta llamadas ``talks`` (a menos que ya están allí).

source: Upgrade steps are usually registered in their own zcml file. Create ``upgrades.zcml``
es: Los pasos de actualización son usualmente registrados en en su propio archivo ZCML. Cree el archivo ``upgrades.zcml``, agregando el siguiente código ZCML:

source: The upgrade step bumps the version number of the GenericSetup profile of ploneconf.site from 1 to 1001. The version is stored in ``profiles/default/metadata.xml``. Change it to
es: El paso de actualización cambia la versión número del perfil GenericSetup del complemento ``ploneconf.site`` de 1 a 1001. La versión se almacena en ``profiles/default/metadata.xml``. Cámbielo a:

source: Include the new ``upgrades.zcml`` in our ``configure.zcml`` by adding:
es: Incluir el nuevo archivo ``upgrades.zcml`` en nuestro archivo ``configure.zcml``, agregando el siguiente código ZCML:

source: GenericSetup now expects the code as a method ``upgrade_site`` in the file ``upgrades.py``. Let's create it.
es: Ahora GenericSetup espera el código como un método ``upgrade_site`` en el archivo ``upgrades.py``. Vamos a crearlo, agregando el siguiente código Python:

source: After restarting the site we can run the step:
es: Después de iniciar de nuevo el sitio, nosotros podemos ejecutar el paso de actualización:

source: Go to the Add-ons controlpanel http://localhost:8080/Plone/prefs_install_products_form. There should now be a warning **This add-on has been upgraded. Old profile version was 1. New profile version is 1001** and a button next to it.
es: Valla al panel control Complementos en la dirección URL http://localhost:8080/Plone/prefs_install_products_form. Ahora debe haber una advertencia **This add-on has been upgraded. Old profile version was 1. New profile version is 1001** y un botón al lado de él.

source: Alternatively you can select which upgrade steps to run like this:
es: Alternativamente, usted puede seleccionar los pasos de actualización para ejecutarlo de la siguiente manera:

source: In the ZMI got to *portal_setup*
es: En la ZMI valla a la herramienta *portal_setup*

source: Go to the tab *Upgrades*
es: Valla a la pestaña *Upgrades*

source: Select *ploneconf.site* from the dropdown and click *Choose profile*
es: Seleccione *ploneconf.site* desde la lista desplegable y haga clic *Choose profile*

source: Run the upgrade step.
es: Ejecutar el paso de actualización.

source: Upgrading from an older version of Plone to a newer one also runs upgrade steps from the package ``plone.app.upgrade``. You should be able to upgrade a clean site from 2.5 to 5.0a2 with a click.
es: Actualizando desde una versión anterior de Plone a uno más reciente también puede ejecutar los pasos de actualización del paquete ``plone.app.upgrade``. Usted debe ser capaz de actualizar un sitio limpio de Plone 2.5 a Plone 5.0a2 con un solo clic.

source: For an example see the upgrade-step to Plone 5.0a1 https://github.com/plone/plone.app.upgrade/blob/master/plone/app/upgrade/v50/alphas.py#L23
es: Para un ejemplo ver el paso de actualización para Plone 5.0a1 https://github.com/plone/plone.app.upgrade/blob/master/plone/app/upgrade/v50/alphas.py#L23

source: Add a browserlayer
es: Agregar una browserlayer

source: A browserlayer is another such marker interface. Browserlayers allow us to easily enable and disable views and other site functionality based on installed add-ons and themes.
es: Una BrowserLayer es otro ejemplo de la interfaz marker. Las BrowserLayers nos permiten fácilmente habilitar y deshabilitar opiniones y funcionalidad de otro sitio basado en complementos y temas instalados.

source: Since we want the features we write only to be available when ploneconf.site actually is installed we can bind them to a browserlayer.
es: Como queremos que las características que escribimos sólo estén disponible cuando el paquete ``ploneconf.site`` actualmente este instalado podemos asociarlos a una BrowserLayer.

source: Our package already has a browserlayer (``bobtemplates.plone`` added it). See ``interfaces.py``:
es: En el archivo ``interfaces.py`` nosotros agregamos el siguiente código Python:

source: Is is enabled by GenericSetup when installing the package since it is registered in ``profiles/default/browserlayer.xml``
es: Nosotros registramos la BrowserLayer en GenericSetup en el archivo ``profiles/default/browserlayer.xml``

source: We should bind all views to it. Here is an example using the talkview.
es: Después de volver a instalar el complemento podemos obligar a las vistas ``talkview``, ``demoview`` y ``talklistview`` a que sean parte de nuestra layer. Aquí hay un ejemplo usando la vista ``talkview``.

source: Note the relative python path ``..interfaces.IPloneconfSiteLayer``. It is equivalent to the absolute path ``ploneconf.site.interfaces.IPloneconfSiteLayer``.
es: Tenga en cuenta el ruta relativa Python ``..interfaces.IPloneconfSiteLayer``. Es equivalente a la ruta absoluta ``ploneconf.site.interfaces.IPloneconfSiteLayer``.

source: Exercise
es: Ejercicio

source: http://docs.plone.org/develop/plone/views/layers.html
es: ¿Es necesario vincular el viewlet social desde el capítulo 20 de este nuevo Browser-Layer?

source: Add catalog-indexes
es: Agregar índices del catálogo

source: Do you need to bind the :ref:`viewlets1-social2-label` from chapter 22 to this new browser layer?
es: En la vista `talklistview` nosotros tuvimos que despertar todos los objetos para acceder a algunos de sus atributos. Eso está bien si no tenemos muchos objetos y ellos son objetos Dexterity ligeros. Si tuviéramos miles de objetos que esto podría no ser una buena idea.

source: No, it would make no difference since the viewlet is already bound to the marker interface ``ploneconf.site.behaviors.social.ISocial``.
es: En lugar de cargar a todos en la memoria usaremos índices del catálogo para obtener los datos que queremos mostrar.

source: Instead of loading them all into memory we will use catalog indexes to get the data we want to display.
es: Esto agrega los nuevos índices para los tres campos que queremos mostrar en el listado. No es que *audience* es un ``KeywordIndex`` porque el campo es de varios valores, pero queremos una entrada de índice independiente para cada valor a un objeto.

source: This adds new indexes for the three fields we want to show in the listing. Not that *audience* is a ``KeywordIndex`` because the field is multi-valued, but we want a separate index entry for every value in an object.
es: La entrada ``column ..`` nos permite visualizar estos valores de estos índices en la vista ``tableview`` de colecciones.

source: The ``column ..`` entry allows us to display the values of these indexes in the tableview of collections.
es: Hasta Plone 4.3.2 agregar índices en el archivo ``catalog.xml`` era perjudicial porque ¡al volver a instalar el complemento purgaba los índices! Ver mas detalles en la dirección URL https://www.starzel.de/blog/a-reminder-about-catalog-indexes.

source: Until Plone 4.3.2 adding indexes in catalog.xml was harmful because reinstalling the addon purged the indexes! See http://www.starzel.de/blog/a-reminder-about-catalog-indexes.
es: Para ejecutar código personalizado adicional al volver instalar un complemento que puedes usar un archivo `setuphandler.py <http://docs.plone.org/4/en/develop/addons/components/genericsetup.html#custom-installer-code-setuphandlers-py>`_.

source: Reinstall the addon
es: Volver a instalar el complemento

source: Go to http://localhost:8080/Plone/portal_catalog/manage_catalogIndexes to inspect and manage the new indexes
es: Valla a la URL http://localhost:8080/Plone/portal_catalog/manage_catalogIndexes para inspeccionar el ingreso de datos e inspeccionar los nuevos índices al catálogo

source: http://docs.plone.org/develop/plone/searching_and_indexing/indexing.html
es: http://docs.plone.org/4/en/develop/plone/searching_and_indexing/indexing.html

source: Query for custom indexes
es: Consulta para índices personalizados

source: The new indexes behave like the ones that Plone has already built in:
es: Los nuevos índices se comportan como los que Plone tiene construido en:

source: We now can use the new indexes to improve the talklistview so we don't have to *wake up* the objects any more. Instead we use the brains new attributes.
es: Ahora podemos usar los nuevos índices para mejorar la vista ``talklistview`` así que no tenemos que despertar los objetos nunca más.

source: The template does not need to be changed and the result in the browser did not change, either.
es: La plantilla no necesita ser cambiado y el resultado no cambió también.

source: Add collection criteria
es: Agregar criterio de colección

source: To be able to search content in collections using these new indexes we would have to register them as criteria for the querystring widget that collections use. As with all features make sure you only do this if you really need it!
es: Para ser capaz de buscar contenido en tipo de contenidos `Colecciones` utilizando los nuevos índices tendríamos que registrarlos como criterios para el widget de cadena de consulta que usan las `Colecciones`.

source: Add a new file ``profiles/default/registry.xml``
es: Agregar un nuevo archivo ``profiles/default/registry.xml``, agregando el siguiente código XML:

source: http://docs.plone.org/develop/plone/functionality/collections.html#add-new-collection-criteria-new-style-plone-app-collection-installed
es: http://docs.plone.org/4/en/develop/plone/functionality/collections.html#add-new-collection-criteria-new-style-plone-app-collection-installed

source: Configure the versioning policy and a diff-view for talks through GenericSetup.
es: Habilitar el control de versiones y una visión del diff para los tipos de contenidos talks a través de GenericSetup.

source: Add new file ``profiles/default/repositorytool.xml``
es: Agregar nuevo archivo ``profiles/default/repositorytool.xml``, con el siguiente código XML:
