Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/dexterity_3.po
Languages: es

source: Dexterity Types III: Python
es: Tipos Dexterity - III: Python

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: Without sponsors a conference would be hard to finance plus it is a good opportunity for Plone-companies to advertise their services.
es: Sin patrocinadores una conferencia sería difícil de financiar además de que es una buena oportunidad para las empresas Plone para hacer publicidad de sus servicios.

source: In this part we will:
es: En esta parte vamos a tratar:

source: create the content-type *sponsor* that has a python-schema
es: Crear el tipo de contenido *sponsor* que tiene un esquema Python

source: create a viewlet that shows the sponsors sorted by level
es: Crear un viewlet que muestra los patrocinadores ordenados por el nivel

source: discuss image-scales
es: Discutir las escalas de imagen.

source: First we create the schema for the new type. Instead of xml we use python now. Create a new folder ``content`` with a empty ``__init__.py`` in it. Now add a new file ``content/sponsor.py``.
es: Primero creamos el esquema para el nuevo tipo de contenido. En lugar del código XML ahora usamos código Python. Cree una nueva carpeta ``content`` con un archivo vacío ``__init__.py`` en esta. Ahora agregue un nuevo archivo ``content/sponsor.py``, con el siguiente código Python:

source: Some things are notable here:
es: Algunas cosas son notables aquí:

source: The fields in the schema are mostly from ``zope.schema``. A reference of available fields is at http://docs.plone.org/4/en/external/plone.app.dexterity/docs/reference/fields.html
es: Los campos en el esquema son en su mayoría basado en el paquete ``zope.schema``. Una referencia de campos está disponible en la siguiente dirección URL: http://docs.plone.org/4/en/external/plone.app.dexterity/docs/reference/fields.html

source: In ``directives.widget(level=RadioFieldWidget)`` we change the default widget for a Choice-field from a dropdown to radioboxes. A incomplete reference of available widgets is at http://docs.plone.org/4/en/external/plone.app.dexterity/docs/reference/widgets.html
es: En ``directives.widget(level=RadioFieldWidget)`` cambiamos el widget predeterminado para un campo de elección de un menú desplegable para casilla de selección simple. Una referencia incompleta de widgets está disponible en la siguiente dirección URL: http://docs.plone.org/4/en/external/plone.app.dexterity/docs/reference/widgets.html

source: ``LevelVocabulary`` is used to create the options used in the field ``level``. This way we could easily translate the displayed value.
es: ``LevelVocabulary`` se utiliza para crear las opciones que se utilizan en el campo ``level``. De esta manera se podría traducir fácilmente el valor mostrado.

source: ``fieldset('Images', fields=['logo', 'advertisment'])`` moves the two image-fields to another tab.
es: ``fieldset('Images', fields=['logo', 'advertisment'])`` mueve las dos campos de imágenes a otra pestaña.

source: ``directives.read_permission(...)`` sets the read- and write-permission for the field ``note`` to users who can add new members. Usually this permission is only granted to Site-Administrators and Managers. We use it to store information that should not be publicly visible. Please note that ``obj.note`` is still accessible in templates and python. Only using the widget (like we do in the view later) checks for the permission.
es: ``directives.read_permission(...)`` establece el permiso de lectura y escritura, para el campo ``note`` a los usuarios que pueden agregar nuevos usuarios de tipoMiembro. Por lo general, este permiso sólo se concede a Administradores de Sitio y Administradores. Lo utilizamos para almacenar información que no debe ser visible públicamente. Tenga en cuenta que ``obj.note`` sigue siendo accesible en plantillas y código Python. Sólo utilizando el widget (como lo hacemos en la vista posterior) comprueba el permiso.

source: We use no grok here
es: Nosotros no usaremos Grok aquí

source: Second we create the FTI for new type in ``profiles/default/types/sponsor.xml``
es: Segundo nosotros creamos el *Factory Type Information - FTI* para el nuevo tipo de contenido en el archivo ``profiles/default/types/sponsor.xml``, con el siguiente código XML:

source: Then we register the FTI in ``profiles/default/types.xml``
es: Entonces nosotros registramos el FTI en el archivo ``profiles/default/types.xml``, con el siguiente código XML:

source: After reinstalling our package we can create the new type. We use the default-view provided by dexterity since we display the sponsors in a viewlet.
es: Después volvemos a instalar nuestro paquete y entonces nosotros podemos crear un tipos de contenido ``Sponsor``. Utilizamos la vista predeterminada proporcionada por Dexterity ya que mostremos a los patrocinadores en un viewlet.

source: Instead we tweak the default-view with some css. Add the following to ``resources/ploneconf.css``
es: En cambio, nosotros nos ajustamos la vista predeterminada con algunas sentencias CSS. Agregue lo siguiente al archivo ``resources/ploneconf.css``, con el siguiente código CSS:

source: If we would want a custom view for sponsors it could look like this.
es: Si quisiéramos una vista personalizada para los tipos de contenidos ``Sponsor`` podría tenerlo con esta apariencia.

source: Note that we have to handle the field with special permissions: ``tal:condition="python: 'notes' in view.w"`` checks if the convenience-dictionary ``w`` provided by the base-class ``DefaultView`` holds the widget for the field ``note``. If the current user does not have the permission ``cmf.ManagePortal`` it will be omited from the dictionary and get an error since ``notes`` would not be a key in ``w``. By first checking if it is missing we work around that.
es: Tenga en cuenta que tenemos que manejar el campo con permisos especiales: ``tal:condition="python: 'notes' in view.w"`` comprueba si la conveniencia diccionario ``w`` proporcionada por la clase base ``DefaultView`` sostiene el widget para el campo ``note``. Si el usuario actual no tiene permiso ``cmf.ManagePortal`` será omitido del diccionario y sale un error ya que ``notes`` no sería una clave en ``w``. A primera comprobación si falta trabajamos alrededor de eso.

source: We display the sponsors at the bottom of the website in a viewlet.
es: Nosotros mostramos los tipos de contenidos ``Sponsor`` en la parte inferior de la página Web en un viewlet.

source: Register the viewlet in ``browser/configure.zcml``
es: Registrar el viewlet en el archivo ``browser/configure.zcml``, agregando el siguiente código ZCML:

source: Add the viewlet-class in ``browser/viewlets.py``
es: Agregue en la clase viewlet en el archivo ``browser/viewlets.py``, con el siguiente código Python:

source: ``_sponsors`` returns a list of dictionaries containing all necessary info about sponsors.
es: ``_sponsors`` regresa una lista de diccionarios conteniendo todo la información necesaria sobre los tipos de contenidos ``Sponsor``.

source: ``_sponsors`` is cached for an hour using `plone.memoize <http://docs.plone.org/4/en/manage/deploying/testing_tuning/performance/decorators.html#timeout-caches>`_. This way we don't need to keep all sponsor-objects in memory all the time. We could also cache until one of the sponsors is modified:
es: ``_sponsors`` se almacena en caché durante una hora usando `plone.memoize <http://docs.plone.org/4/en/manage/deploying/testing_tuning/performance/decorators.html#timeout-caches>`_. De esta manera no es necesario mantener todos los objetos tipos de contenidos ``Sponsor`` en la memoria todo el tiempo. También podríamos almacenar en caché hasta que uno de los tipos de contenidos ``Sponsor`` sea modificado:

source: We create the complete img-tag using a custom scale (200x80) using the view ``images`` from plone.namedfile. This actually scales the logos and saves them as new blobs.
es: Creamos la etiqueta HTML ``IMG`` completa utilizando una escala personalizada (200x80) utilizando la vista ``images`` del paquete ``plone.namedfile``. Este escalas en realidad los logotipos y las guarda como nuevos registros blobs.

source: In ``sponsors`` we return a ordered dictionary of randomized lists of dicts (containing the information on sponsors).
es: En ``sponsors`` regresamos un diccionario ordenado de una listas aleatorias de diccionarios (que contiene la información sobre los tipos de contenidos ``Sponsor``).

source: Add the template ``browser/templates/sponsors_viewlet.pt``
es: Agregar la plantilla en el archivo ``browser/templates/sponsors_viewlet.pt``, con el siguiente código ZPT:

source: Now add some css to make it look ok. Edit ``resources/ploneconf.css``
es: Ahora agregue algunas sentencias CSS para estilizar la apariencia. Edite el archivo ``resources/ploneconf.css``, agregando el siguiente código CSS:
