Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/eggs2.po
Languages: es

source: Creating reusable packages with eggs
es: Creando paquetes reusables con Eggs

source: We already created an egg much earlier.
es: Nosotros ya hemos creado un paquete Egg anteriormente.

source: To make the distinction clear, this is not a package from the namespace :samp:`ploneconf` but from :samp:`starzel`.
es: Para hacer la distinción clara, esto no es un paquete de los nombres :samp:`ploneconf` pero desde :samp:`starzel`.

source: We are going to add a voting behavior.
es: Vamos a agregar el comportamiento voting.

source: For this we need:
es: Para esto nosotros necesitamos:

source: A behavior that stores it's data in annotations
es: Un comportamiento que almacene esa data en anotaciones.

source: A viewlet to present the votes
es: Un viewlet para presentar los votos.

source: A bit of javascript
es: Un poco de Javascript.

source: A bit of css
es: Un poco de CSS.

source: Some helper views so that the Javascript code can communicate with Plone
es: Algunos helper views para que el código Javascript puede comunicarse con Plone.

source: We move to the :file:`src` directory and call a script called :file:`zopeskel` from our projects bin-directory.
es: Nos ubicamos dentro del directorio :file:`src` y ejecutamos el script llamado :file:`zopeskel` desde nuestro directorio de proyecto bin.

source: This returns a list of available templates we might use. We choose dexerity since it is pretty small but already has some of the right dependencies we need.
es: Esto devuelve una lista de plantillas disponibles que podríamos utilizar. Elegimos Dexerity ya que es bastante pequeña, pero ya cuenta con algunas de las dependencias adecuadas que necesitamos.

source: We answer some questions:
es: Nosotros respondemos algunas preguntas:

source: We have to modify the generated files slightly.
es: Tenemos que modificar ligeramente los archivos generados.

source: In :file:`setup.py`, we completely remove the variables setup_requires and paster_plugins. These are required for features that are rarely used and add a lot of code into the source directory that we don't want. To the :samp:`install_requires` list, we add an entry for :samp:`plone.api`.
es: En :file:`setup.py`, eliminamos por completo las variables ``setup_requires`` y ``paster_plugins``. Estos son necesarios para las características que se usan muy poco y añade una gran cantidad de código en el directorio de fuentes que no queremos. Para la lista :samp:`install_requires`, añadimos una entrada para :samp:`plone.api`.

source: The file :file:`profiles/default/types.xml` we just delete also. We won't define new types.
es: El archivo :file:`profiles/default/types.xml` lo eliminamos también. No vamos a definir nuevos tipos de contenidos.
