Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/eggs1.po
Languages: es

source: Creating addons to customize Plone
es: Creando complementos para personalizar Plone

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: In this part you will:
es: En esta parte vamos a tratar:

source: Create a custom python distribution ``ploneconf.site`` to hold all the code
es: Cree una distribución python personalizada llamada ``ploneconf.site`` para contener todo el código

source: Modify buildout to install that distribution
es: Modificar la configuración buildout para instalar esa distribución

source: Topics covered:
es: Tópicos cubiertos:

source: mr.bob and bobtemplates.plone
es: mr.bob y bobtemplates.plone

source: the structure of eggs
es: la estructura de los paquetes eggs

source: Creating the distribution
es: Creando la distribución

source: Our own code has to be organized as a python distribution, also called *egg*. An egg is a zip file or a directory that follows certain conventions. We are going to use `bobtemplates.plone <https://pypi.python.org/pypi/bobtemplates.plone>`_ to create a skeleton project. We only need to fill in the blanks.
es: Nuestro propio código tiene que ser organizado como un paquete egg. Un paquete egg es un archivo zip o un directorio que sigue ciertas convenciones. Vamos a utilizar `bobtemplates.plone <https://pypi.python.org/pypi/bobtemplates.plone>`_ para crear un proyecto de esqueleto. Tan sólo hay que responder a las preguntas del generador, las cuales crearán archivos necesarios para trabajar.

source: We create and enter the ``src`` directory (*src* is short for *sources*) and call a script called ``mrbob`` from our buildout's bin directory:
es: Nosotros accedemos al directorio ``src`` y ejecutamos un script llamado ``mrbob`` ubicado en nuestros directorio ``bin`` del buildout.

source: We have to answer some questions about the add-on. We will press :kbd:`Enter` (i.e. choosing the default value) for all questions except 3 (where you enter your github username if you have one) and 5 (Plone version), where we enter :kbd:`4.3.10`.
es: Tenemos que responder a algunas preguntas sobre el complemento. Vamos a presionar la tecla :kbd:`Enter` (es decir, elegir el valor por defecto) para todas las preguntas, excepto la 3era pregunta (donde ingresa su nombre de usuario github si tiene uno) y la 5ta pregunta (versión Plone), donde ingresa :kbd:`4.3.10`.

source: If this is your first egg, this is a very special moment. We are going to create the egg with a script that generates a lot of necessary files. They all are necessary, but sometimes in a subtle way. It takes a while to understand their full meaning. Only last year I learned and understood why I should have a ``MANIFEST.in`` file. You can get along without one, but trust me, you get along better with a proper manifest file.
es: Si este es su primer paquete egg, éste es un momento muy especial. Vamos a crear el paquete egg con un script que genera una gran cantidad de archivos necesarios. Todos ellos son necesarios, pero a veces de una manera sutil. Se toma un tiempo entiendo su significado pleno. Sólo el año pasado he aprendido y entendido por qué debería tener un archivo ``MANIFEST.in``. Usted puede vivir sin uno, pero confía en mí, te llevas mejor con un archivo de manifiesto adecuada.

source: Inspecting the distribution
es: Inspeccionando la distribución

source: In ``src`` there is now a new folder ``ploneconf.site`` and in there is the new distribution. Let's have a look at some of the files:
es: En la carpeta ``src`` ahora hay una nueva carpeta ``ploneconf.site`` y ahí está la nueva distribución. Echemos un vistazo a algunos de los archivos:

source: You can ignore these files for now. They are here to create a buildout only for this egg to make testing it easier. Once we start writing tests for this distribution we will have another look at them.
es: Puede pasar por alto estos archivos por ahora. Ellos están aquí para crear un buildout sólo para este paquete egg para hacer las pruebas más fáciles. Una vez que empezamos a escribir las pruebas para este paquete tendremos que actualizar estos archivos a las actuales mejores prácticas y versiones.

source: The documentation, changelog, the list of contributors and the license of your egg goes in here.
es: La documentación y el archivo de registro de cambios, el archivo de la lista de contribuidores y el archivo de la licencia de su paquete egg van allí.

source: This file configures the distribution, its name, dependencies and some metadata like the author's name and email address. The dependencies listed here are automatically downloaded when running buildout.
es: Este archivo configura el paquete, su nombre, las dependencias y algunos metadatos como el nombre del y correo electrónico del autor. Las dependencias listadas aquí son descargadas automáticamente por buildout.

source: The distribution itself lives inside a special folder structure. That seems confusing but is necessary for good testability. Our distribution contains a `namespace package <https://www.python.org/dev/peps/pep-0420/>`_ called *ploneconf.site* and because of this there is a folder ``ploneconf`` with a ``__init__.py`` and in there another folder ``site`` and in there finally is our code. From the buildout's perspective our code is in ``<your buildout directory>/src/ploneconf.site/src/ploneconf/site/<real code>``
es: La distribución Python en si misma vive dentro de una estructura de carpetas especial. Eso parece confuso, pero es necesario para tener buena habilidad de prueba. Nuestra distribución contiene un `paquete de espacio de nombres <https://www.python.org/dev/peps/pep-0420/>`_ llamado *ploneconf.site* y debido a esto hay una carpeta ``ploneconf`` con un archivo ``__init__.py`` y allí hay otra carpeta ``site`` y ahí finalmente está nuestro código. Desde la perspectiva de buildout, nuestro código está en la ruta ``<su directorio buildout>/src/ploneconf.site/src/ploneconf/site/<real code>``

source: Unless discussing the buildout we will from now on silently omit these folders when describing files and assume that ``<your buildout directory>/src/ploneconf.site/src/ploneconf/site/`` is the root of our distribution!
es: A menos que discutamos el buildout, de ahora en adelante, omitiremos silenciosamente estas carpetas al describir los archivos y asumiremos que ``<su directorio buildout>/src/ploneconf.site/src/ploneconf/site/`` ¡es el directorio raíz de nuestra distribución Python!

source: The phone book of the distribution. By reading it you can find out which functionality is registered though the component architecture.
es: La guía de los paquetes. De su lectura se puede averiguar qué funcionalidad está registrado a través de la arquitectura de componentes.

source: This holds code that is automatically run when installing and uninstalling our add-on.
es: Esto contiene el código que se ejecuta automáticamente al instalar y desinstalar nuestro complemento.

source: Here a browserlayer is defined in a straightforward python class. We will need it later.
es: Aquí se define un browserlayer en una simple clase de python. Lo necesitaremos más tarde.

source: This holds the setup for running tests.
es: Esta contiene la configuración para correr las pruebas del paquete.

source: This holds the tests.
es: Esta contiene las pruebas del paquete.

source: This directory is a python package (because it has a ``__init__.py``) and will by convention hold most things that are visible in the browser.
es: Este directorio es un paquete python (porque tiene un ``__init__.py``) y por convención contiene la mayoría de las cosas que son visibles en el navegador.

source: The phonebook of the browser package. Here views, resources and overrides are registered.
es: La guía del paquete del browser. Aquí se registran vistas, recursos y sobre-escrituras de Plone.

source: This add-on is already configured to allow overriding existing default Plone templates.
es: Este complemento ya está configurado para permitir la sustitución o sobre-escritura de las plantillas por defecto de Plone existentes.

source: A directory that holds static resources (images/css/js). The files in here will be accessible through URLs like ``++resource++ploneconf.site/myawesome.css``
es: Un directorio que contiene los recursos estáticos (archivos de imágenes, CSS y JS). Los archivos aquí serán accesibles a través de las URLs como ``++resource++ploneconf.site/myawesome.css``

source: This folder contains the GenericSetup profile. During the training we will put some xml files here that hold configuration for the site.
es: La carpeta contiene el perfil GenericSetup. Durante el entrenamiento pondrán algunos archivos XML ahí que tienen la configuración para el sitio.

source: Version number and dependencies that are auto-installed when installing our add-on.
es: Número de versión y dependencias que son auto-instalado cuando esta instalando su propio complemento.

source: Including the egg in Plone
es: Incluyendo el paquete egg en Plone

source: Before we can use our new addon we have to tell Plone about it. Edit ``buildout.cfg`` and uncomment ``ploneconf.site`` in the `eggs` and `sources` sections:
es: Antes de poder utilizar nuestro nuevo complemento tenemos que indicarle de la existencia de este a Plone. Entonces edite el archivo ``buildout.cfg`` y descomente el paquete egg ``ploneconf.site`` en las secciones `eggs` y `sources`:

source: This tells Buildout to add the egg ``ploneconf.site``. Since it is also in the `sources`-section Buildout will not try to download it from pypi but will expect it in ``src/ploneconf.site``. *fs* allows you to add packages on the file system without a version control system, or with an unsupported one.
es: Esto le dice a Buildout agregue el paquete egg ``ploneconf.site``. Dado que también se encuentra en la sección `sources` en Buildout no intentará descargarlo de PYPI pero esperará en ``src/ploneconf.site``. La opción *fs* le permite añadir paquetes en el sistema de ficheros sin un sistema de control de versiones, o con uno compatible.

source: Now run buildout to reconfigure Plone with the updated configuration:
es: Ahora ejecute buildout para reconfigurar Plone con la configuración actualizada:

source: After restarting Plone with ``./bin/instance fg`` the new addon `ploneconf.site` is available for install like PloneFormGen or Plone True Gallery.
es: Después reinicie Plone con el comando ``./bin/instance fg`` el nuevo complemento `ploneconf.site` está disponible para instalar como `PloneFormGen` o `Plone True Gallery`.

source: We will not install it now since we did not add any of our own code or configuration yet. Let's do that.
es: No vamos a instalarlo ahora, ya que no añadimos aun nada de nuestro propio código fuente o configuración todavía. Vamos a hacer eso.

source: Return to Dexterity: moving content types into code
es: Volver Dexterity: para mover tipos de contenidos a código fuente

source: Remember the *Talks* content type that we created through-the-web with Dexterity? Let's move that new content type into our add-on package so that it may be installed in other sites without TTW manipulation.
es: ¿Recuerda el tipo de contenido *Talk* que hemos creado a través de la Web con Dexterity? Vamos a pasar ese nuevo tipo de contenido a dentro de nuestro paquete egg para que pueda ser instalado en otros sitios sin manipulación a través de la Web.

source: Steps:
es: Pasos:

source: Return to the Dexterity control panel
es: Volver al panel del control Tipos de contenido Dexterity

source: Export the Type Profile and save the file
es: Haga clic en la casilla junto al Tipo de contenido *Talk* y hace clic en el botón *Exportar los perfiles del tipo* y guardarlo en el archivo

source: Delete the Type from the site before installing it from the file system
es: Elimine el Tipo de contenido *Talk* desde el panel del control Tipos de contenido Dexterity en su sitio Plone ante de instalarlo desde el sistema de archivo

source: Extract the files from the exported tar-file and add them to our addon-package in ``ploneconf/site/profiles/default/``
es: Extrae los archivos desde el archivo tar exportado y agréguelo entonces en nuestro paquete en la ruta ``ploneconf/site/profiles/default/``

source: The file ``ploneconf/site/profiles/default/types.xml`` tells plone that there is a new content type defined in file ``talk.xml``.
es: El archivo ``ploneconf/site/profiles/default/types.xml`` le dice a que allí tiene un nuevo tipo de contenido definido en el archivo ``talk.xml``.

source: Upon installing, Plone reads the file ``ploneconf/site/profiles/default/types/talk.xml`` and registers a new type in ``portal_types`` (you can find this tool in the ZMI) with the information taken from that file.
es: Tras la instalación, Plone lee el archivo ``ploneconf/site/profiles/default/types/talk.xml`` y registra un nuevo tipo de contenido en la herramienta ``portal_types`` (puede encontrar esta en el ZMI) con la información tomada de ese archivo.

source: Now our package has some real contents. So, we'll need to reinstall it (if installed before).
es: Ahora nuestro paquete tiene algunos contenidos reales. Por lo tanto, tendremos que volver a instalarlo (si está instalado antes).

source: Restart Plone.
es: Reinicie Plone.

source: Re-install ploneconf.site (deactivate and activate).
es: Reinstale el paquete ploneconf.site (desactive y active).

source: Go to the ZMI and look at the definition of the new type in ``portal_types``.
es: Valla a la ZMI y vea la definición del nuevo tipo de contenido en la herramienta ``portal_types``.

source: Test the type by adding an object or editing one of the old ones.
es: Pruebe el tipo de contenido agregando un objeto o la edición de una de las entradas antiguas.

source: Look at how the talks are presented in the browser.
es: Mire cómo se presentan los tipo de contenidos talks en el navegador.
