Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/embed.po
Languages: es

source: Using starzel.votable_behavior in ploneconf.site
es: Usando starzel.votable_behavior en ploneconf.site

source: We want to use the votable behavior, so that our reviewers can vote.
es: Queremos usar el comportamiento de votación, para que nuestros usuarios revisores puedan votar.

source: To show how to use events, we are going to auto-publish talks that have reached a certain rating.
es: Para mostrar cómo usar los eventos, vamos a publicar automáticamente los tipos de contenidos talks que han alcanzado una cierta puntuación.

source: We are not going to let everybody vote everything.
es: No vamos a dejar que todos voten todo.

source: First, we must add our package as a dependency to ploneconf.site.
es: Primero, debemos agregar nuestro paquete como una dependencia al paquete ``ploneconf.site``.

source: We do this in two locations. The egg description :file:`setup.py` needs :samp:`starzel.votable_behavior` as a dependency. Else no source code will be available.
es: Hacemos esto en dos lugares. La descripción del paquete egg en el archivo :file:`setup.py` necesita :samp:`starzel.votable_behavior` como una dependencia. De lo contrario ningún código fuente estará disponible.

source: The persistent configuration needs to be installed when we install our site. This is configured in GenericSetup.
es: La configuración persistente necesita ser instalada cuando instalamos nuestro sitio. Esto se configura en GenericSetup.

source: Next up we modify :file:`profiles/default/metadata.xml`
es: A continuación modificamos el archivo :file:`profiles/default/metadata.xml`, con el siguiente código XML:

source: What a weird name. profile- is a prefix you will always need nowadays. Then comes the egg name, and the part after the colon is the name of the profile. The name of the profile is defined in zcml. So far I've stumbled over only one package where the profile directory name was different than the GenericSetup Profile name.
es: Qué nombre tan raro. ``profile-`` es un prefijo que siempre necesitarás hoy en día. Luego viene el nombre del paquete egg, y la parte después de los dos puntos es el nombre del perfil. El nombre del perfil se define en configuraciones ZCML. Hasta ahora he tropezado sólo sobre un paquete donde el nombre del directorio de perfil era diferente al nombre del perfil GenericSetup.

source: Now the package is there, but nothing is votable. That is because no content type declares to use this behavior. We can add this behavior via the control panel, export the settings and store it in our egg. Let's just add it by hand now.
es: Ahora el paquete está allí, pero nada es votable. Esto se debe a que ningún tipo de contenido declara utilizar este comportamiento. Podemos añadir este comportamiento a través del panel de control, exportar la configuración y almacenarla en nuestro paquete egg. Vamos a añadirlo a mano ahora.

source: To add the behavior to talks, we do this in :file:`profiles/default/types/talk.xml`
es: Tenemos que agregar el comportamiento al tipo de contenidos talks, haremos esto en el archivo :file:`profiles/default/types/talk.xml`.

source: After changing the ``metadata.xml`` you have to restart your site since unlike other GenericSetup XML files that file is cached.
es: Administrando las dependencias en el archivo ``metadata.xml`` es una buena práctica. No podemos confiar en recordar lo que tendríamos que hacer a mano. Por ejemplo, ¿recuerdas que tuvimos que añadir para seleccionar ``Tipos predeterminados de Plone basados en Dexterity`` al crear un nuevo sitio de Plone?

source: Managing dependencies in metadata.xml is good practice. We can't rely on remembering what we'd have to do by hand. In Plone 4 we should also have added ``<dependency>profile-plone.app.contenttypes:plone-content</dependency>`` like the `documentation for plone.app.contenttypes <http://docs.plone.org/external/plone.app.contenttypes/docs/README.html#installation-as-a-dependency-from-another-product>`_ recommends.
es: En lugar de eso, debemos agregar ``<dependency>profile-plone.app.contenttypes:plone-content</dependency>`` como la `documentación de plone.app.contenttypes <http://docs.plone.org/4/en/external/plone.app.contenttypes/docs/README.html#installation-as-a-dependency-from-another-product>`_ recomienda.

source: Everybody can now vote on talks. That's not what we wanted. We only want reviewers to vote on pending Talks. This means the permission has to change depending on the workflow state. Luckily, workflows can be configured to do just that. Since Talks already have their own workflow we also won't interfere with other content.
es: Todo el mundo puede votar ahora en los tipos de contenidos ``talks``. Eso no es lo que queríamos. En realidad, sólo queremos que los revisores voten en las charlas pendientes. Esto significa que, dependiendo del estado del flujo de trabajo, el permiso tiene que cambiar. Por suerte, los flujos de trabajo se pueden configurar para hacer precisamente eso. Los tipos de contenidos ``talks`` ya tienen su propio flujo de trabajo. Así que no interferiremos con otros paquetes.

source: First, we have to tell the workflow that it will be managing more permissions. Next, for each state we have to configure which role has the two new permissions.
es: En primer lugar, tenemos que decirle al flujo de trabajo que gestionará más permisos. A continuación, tenemos que configurar para cada estado, que el rol de usuario tiene ahora los dos nuevos permisos.

source: That is a very verbose configuration, maybe you want to do it in the web interface and export the settings. On the other hand, it is easy to make a simple mistake in both ways. I will just present the xml way here.
es: Esa es una configuración muy detallada, tal vez usted quiere hacerlo en la interfaz web y exportar la configuración. Por otro lado, es fácil cometer un simple error en ambos sentidos. Yo acabo de presentar la forma XML aquí.

source: The config for the Workflow is in :file:`profiles/default/workfows/talks_workflow.xml`
es: La configuración del flujo de trabajo está en el archivo :file:`profiles/default/workfows/talks_workflow.xml`, con el siguiente código XML:

source: We have to reinstall our product again.
es: Tenemos que volver a instalar nuestro producto de nuevo.

source: But this time, this is not enough. Permissions get updated on workflow changes. As long as a workflow change didn't happen, the talks have the same permissions as ever.
es: Pero esta vez, esto no es suficiente. Los permisos se actualizan en los cambios de flujo de trabajo. Mientras no ocurra un cambio en el flujo de trabajo, los tipos de contenidos ``talks`` tienen los mismos permisos que nunca.

source: Luckily, there is a button for that in the ZMI Workflow view :guilabel:`Update security settings`.
es: Afortunadamente, para eso hay un botón ":guilabel:`Update security settings`" en la vista Flujo de trabajo de la ZMI.

source: After clicking on this, only managers and Reviewers can see the Voting functionality.
es: Después de hacer clic en este, sólo los usuarios Administradores y los usuarios Revisores pueden ver la funcionalidad de votación.

source: Lastly, we add our silly function to auto-approve talks.
es: Por último, añadimos nuestra tonta función para autorizar los tipos de contenidos ``talks``.

source: You quickly end up writing many event handlers, so we put everything into a directory for eventhandlers.
es: Rápidamente terminas escribiendo muchos manejadores de eventos, por lo que ponemos todo en un directorio para los manejadores de eventos.

source: Create the :file:`events` directory and add an empty :file:`events/__init__.py` file.
es: Crear el directorio :file:`events` y agregar un archivo vació :file:`events/__init__.py`.

source: Next, register the events directory in :file:`configure.zcml`
es: Lo próximo, registramos el directorio :file:`events` en el archivo :file:`configure.zcml`

source: Now write the ZCML configuration for the events into :file:`events/configure.zcml`
es: Entonces, escribimos la configuración ZCML para los eventos dentro del archivo :file:`events/configure.zcml`, agregando el siguiente código ZCML:

source: This looks like a MultiAdapter. We want to get notified when an IVotable object gets modified. Our method will receive the votable object and the event itself.
es: Esto parece un ``MultiAdapter``. Queremos ser notificados cuando un objeto ``IVotable`` se modifica. Nuestro método recibirá el objeto ``votable``, y el evento en sí.

source: And finally, our event handler in :file:`events/votable.py`
es: Y finalmente, nuestro manipulador del evento en el archivo :file:`events/votable.py`, con el siguiente código:

source: We are using a lot of plone api here. Plone API makes the code a breeze. Also, there is nothing really interesting. We will only do something if the workflow state is pending and the average vote is above 0.5. As you can see, the :samp:`transition` Method does not want the target state, but the transition to move the state to the target state.
es: Estamos usando un montón de sentencias plone api aquí. La Plone API hace el código una brisa fresca. Además, no hay nada realmente interesante. Sólo haremos algo, si el estado de flujo de trabajo está pendiente y el voto promedio es superior a 0,5. Como puede ver, el método :samp:`transition` no quiere el estado de destino, sino la transición para mover el estado al estado de destino.
