Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/events.po
Languages: es

source: Turn talks into events
es: Convertir las charlas en eventos

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: We forgot something: A list of talks is great especially if you can sort it by your preferences. But if a visitor decides he wants to see a talk he needs to know when it will take place.
es: Se nos olvidó algo: Una lista de las charlas es excelente especialmente si usted puede ordenarlo por sus preferencias. Pero si un visitante decide que quiere ver una charla que necesita saber cuándo va a tener lugar.

source: We need a schedule and for this we need to store the information when a talk will happen.
es: Necesitamos un programa y para ello necesitamos almacenar la información en una charla va a suceder.

source: Luckily the type *Event* is based on reuseable behaviors from the package plone.app.event.
es: Afortunadamente el tipo *Evento* es basado en comportamiento reusable desde el paquete plone.app.event.

source: In this chapter we will
es: En este capítulo vamos a tratar:

source: enable this behavior for talks
es: Habilitar este comportamiento para las charlas.

source: write an upgrade step to work around a bug in plone.app.event
es: Escribir un paso de actualización (upgrade step) para para evitar un error en plone.app.event.

source: display the date in the talkview
es: Mostrar la fecha en la vista talkview.

source: First we enable the behavior ``IEventBasic`` for talks in ``profiles/default/types/talk.xml``
es: Primero nosotros habilitamos el comportamiento ``IEventBasic`` para las charlas en el archivo ``profiles/default/types/talk.xml``

source: But because of a `bug in plone.app.event <https://github.com/plone/plone.app.event/issues/160>`_ does not expect existing objects to get the behavior. Since existing types have no values in the fields ``start`` and ``end`` we would get a traceback on inline-validation when we edit these. To work around this we create an upgrade-step that sets some an initial date.
es: Pero debido a un error en `plone.app.event <https://github.com/plone/plone.app.event/issues/160>`_ no se espera que los objetos existentes obtengan el comportamiento. Desde los tipos de contenidos existentes no tienen valores en los campos ``start`` y ``end`` nos encontraremos con un traceback en línea de validación cuando editamos estos. Para solucionar esto creamos un paso de actualización que establece alguna una fecha inicial.

source: Register the new upgrade step in ``upgrades.zcml``
es: Registrar el nuevo paso de actualización (upgrade step) en el archivo ``upgrades.zcml``

source: Bump the profile-version to 1002 in ``profiles/default/metadata.xml``
es: Cambiar la versión del perfil a 1002 en el archivo ``profiles/default/metadata.xml``

source: Write the upgrade-step in ``upgrades.py``
es: Escribir el paso de actualizacion (upgrade sted) en el archivo ``upgrades.py``

source: After we ran the upgrade-step we can now add a time to existing events. To display this we reuse a default event-summary view as documented in http://ploneappevent.readthedocs.org/en/latest/development.html#reusing-the-event-summary-view-to-list-basic-event-information
es: Después que ejecutamos el paso de actualización ahora podemos añadir un tiempo para los existentes eventos. Para mostrar estos reutilizamos una vista de resumen para eventos por defecto como se documenta en http://ploneappevent.readthedocs.org/en/latest/development.html#reusing-the-event-summary-view-to-list-basic-event-information

source: Edit ``browser/templates/talkview.pt``
es: Edite el archivo ``browser/templates/talkview.pt``
