Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/features.po
Languages: es

source: Workflow Policy support is not yet available for folderish content types created via Dexterity. This is on the way.
es: Soporte de Política de Flujos de trabajo aún no está disponible para los tipos de contenido Carpeta creados a través de Dexterity. Esto está en el camino (es un trabajo en proceso).
