Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/features.po
Languages: es

source: The Features of Plone
es: Las características de Plone

source: In-depth user-manual: https://old.plone.org/documentation/manual/plone-4-user-manual
es: En profundidad el Manual de usuario (en idioma Español): https://old.plone.org/countries/ve/publicaciones/plone-para-usuarios-principiantes

source: See also: http://docs.plone.org/4/en/working-with-content/index.html
es: Ver también la versión original del manual (en idioma Ingles) en las siguientes direcciones URL: http://old.plone.org/documentation/manual/plone-4-user-manual y http://docs.plone.org/4/en/working-with-content/index.html

source: Starting and Stopping Plone
es: Iniciando y Deteniendo Plone

source: We control Plone with a small script called "instance"::
es: Tenemos el control de Plone con un pequeño script llamado "instance" a continuación un ejemplo de su uso::

source: This starts Plone in foreground mode so that we can see what it is doing by monitoring console messages. This is an important development method. Note that when Plone is started in foreground mode, it is also automatically in development mode. Development mode gives better feedback, but is much slower, particularly on Windows.
es: Esto comando anterior, arranca Plone en el modo foreground para que podamos ver lo que está haciendo mediante el control de los mensajes de consola. Este es un método de desarrollo importante. Tenga en cuenta que cuando Plone se inicia en el modo foreground, es también automáticamente en el modo de desarrollo. Modo de desarrollo da una mejor respuesta, pero es mucho más lento, particularmente en Windows.

source: You can stop it by pressing :kbd:`ctrl + c`.
es: Usted puede detener el proceso presionando :kbd:`ctrl + c`.

source: The :program:`instance`-script offers the following options::
es: El script :program:`instance` ofrece las siguientes opciones::

source: Depending on your computer, it might take up to a minute until Zope will tell you that its ready to serve requests. On a decent laptop it should be running in under 15 seconds.
es: Dependiendo del equipo, puede tardar hasta un minuto hasta que Zope le dirá que ya está listo para servir peticiones. En un portátil decente debe estar en ejecución en menos de 15 segundos.

source: A standard installation listens on port 8080, so lets have a look at our Zope site by visiting http://localhost:8080
es: Una instalación estándar escucha en el puerto 8080, así que vamos a echar un vistazo a nuestro sitio Zope visitando http://localhost:8080

source: As you can see, there is no Plone yet!
es: ¡Como puede ver, no hay Plone todavía!

source: We have a running Zope with a database but no content. But luckily there is a button to create a Plone site. Click on that button (login: admin:admin). This opens a form to create a Plone site. Use :samp:`Plone` as the site id.
es: Tenemos un Zope corriendo con una base de datos pero no el sitio Plone. Pero, afortunadamente, hay un botón para crear un sitio Plone. Haga clic en el botón ``Crear un nuevo sitio Plone`` (inicio de sesión: admin:admin). Esto abre un formulario para crear un sitio Plone. Utilice :samp:`Plone` como el identificador del sitio.

source: You now have the option to select some addons before you create the site. Since we will use Dexterity from the beginning we select ``Dexterity-based Plone Default Types``. This way even the initial content on our page will be built with dexterity by the addon ``plone.app.contenttypes`` which will be the default in Plone 5.
es: Ahora tiene la opción de seleccionar algunos complementos antes de crear el sitio. Dado que vamos a utilizar Dexterity desde el principio seleccionamos el complemento ``Dexterity-based Plone Default Types``. De esta manera, incluso el contenido inicial en nuestra página será construido con dexterity por el complemento ``plone.app.contenttypes`` que será el predeterminado en Plone 5.

source: You will be automatically redirected to the new site.
es: Usted será automáticamente redirigido al sitio nuevo.

source: Plone has many message-boxes. They contain important information. Read them and make sure you understand them!
es: Plone tiene muchos mensajes. Contienen información importante. ¡Léalos y asegúrese de entender su contenido!

source: Users
es: Usuarios

source: Let's create our first users within Plone. So far we used the admin-user (admin:admin) configured in the buildout. This user is often called "zope-root" and is not managed in Plone but only in by Zope. Therefore the user's missing some features like email and fullname and won't be able to use some of plone's features. But the user has all possible permissions. As with the root user of a server, it's a bad practice to make unnecessary use of zope-root. Use it to create Plone sites and their initial users, but not much else.
es: Vamos a crear nuestros primeros usuarios en Plone. Hasta ahora hemos utilizado el usuario admin (admin:admin) configurado en el buildout. Este usuario es a menudo se le llama "el administrador de Zope" y con este usuario no se gestiona en Plone mas sólo es usado para la gestión de Zope. Por lo tanto el usuario le faltan algunas características como el correo electrónico y el nombre completo y no va a ser capaz de utilizar algunas de las características de Plone. Sin embargo, el usuario tiene todos los permisos posibles. Al igual que con el usuario root de un servidor, que es una mala práctica hacer uso innecesario del raíz de Zope. Se usa para crear sitios Plone y sus usuarios iniciales, pero no mucho más.

source: You can also add zope-users also via the terminal by entering::
es: También puede agregar los usuarios Zope a través del terminal ejecutando el siguiente comando:

source: That way you can access databases you get from customers where you have no Plone-user.
es: De esa manera usted puede tener acceso a las bases de datos que recibe de los clientes donde no tienes usuario Plone.

source: To add a new user in Plone, click on the name :guilabel:`admin` in the top right corner and then on :guilabel:`Site setup`. This is Plone's control panel. You can also access it by browsing to http://localhost:8080/Plone/@@overview-controlpanel
es: Para agregar un nuevo usuario haga clic en el nombre :guilabel:`admin` ubicado en la esquina superior derecha y luego en :guilabel:`Configuración del sitio`. Este es el panel de control de Plone. También puede acceder a él por la dirección URL a http://localhost:8080/Plone/@@overview-controlpanel

source: Click on :guilabel:`Users and Groups` and add a user. If you'd have configured a mail server, Plone could send you a mail with a link to a form where you can choose a password. We set a password here because we haven't yet configure a mail server.
es: Haga clic en :guilabel:`Usuarios y Grupos`, entonces añada un usuario. Si ha configurado un servidor de correo, Plone puede enviarle un correo electrónico con un enlace a un formulario donde puede elegir una contraseña. Establezca una contraseña aquí porque no ha configurado aun un servidor de correo.

source: Make this user with your name an administrator.
es: Estableciendo a este usuario con su nombre un Administrador del sitio.

source: Then create another user called ``testuser``. Make this one a normal user. You can use this user to see how Plone looks and behaves to users that have no admin-permission.
es: A continuación, cree otro usuario llamado ``testuser``. Hágalo un usuario normal. Puede utilizar este usuario para ver cómo luce Plone y se comporta a los usuarios que no tienen permiso de administrador.

source: Now let's see the site in 3 different browsers with three different roles:
es: Ahora vamos a ver el sitio en tres (03) navegadores diferentes, con tres roles diferentes:

source: as anonymous
es: como anónimo.

source: as editor
es: como editor.

source: as admin
es: como administrador.

source: Configure a Mailserver
es: Configurar un servidor de correo

source: We have to configure a mailserver since later we will create some content-actions that send emails when new content is put on our site.
es: Tenemos que configurar un servidor de correo desde temprano vamos a crear algunas acciones de contenido que envían mensajes de correo electrónico cuando el nuevo contenido se pone en nuestro sitio.

source: Server: :samp:`mail.gocept.net`
es: Servidor: :samp:`mail.gocept.net`

source: Username: :samp:`training@neww.de`
es: Nombre de usuario: :samp:`training@neww.de`

source: Password: :samp:`training2014`
es: Contraseña: :samp:`training2014`

source: Please do not abuse this. We'll disable this account after the training.
es: Por favor, no abuses de esto. Vamos a deshabilitar esta cuenta después de la capacitación.

source: Walkthrough of the UI
es: Tutorial de la interfaz de usuario

source: Let's see what is there...
es: Vamos a ver lo que está ahí...

source: :guilabel:`personaltools`: name, logout etc.
es: :guilabel:`personaltools`: nombre, salir etc.

source: :guilabel:`logo`: with a link to the frontpage
es: :guilabel:`logo`: con un enlace a la página principal

source: :guilabel:`search`
es: :guilabel:`buscar`

source: :guilabel:`global`-navigation
es: :guilabel:`navegación global`

source: :guilabel:`portal-columns`: a container holding:
es: :guilabel:`portal-columns`: un contenedor que contienen:

source: :guilabel:`portal-column-one`: portlets (configurable boxes with tool like navigation, news etc.)
es: :guilabel:`portal-column-one`: portlets (cajas configurables como herramientas para navegación, noticias etc.)

source: :guilabel:`portal-column-content`: the content and the editor
es: :guilabel:`portal-column-content`: el contenido y el editor

source: :guilabel:`edit bar`: editing options for the content
es: :guilabel:`barra de edición`: opciones de edición del contenido

source: These are also the css-classes of the respective div's. If you want to do theming you'll need them.
es: Estos son también los clases CSS de los respectivos de DIV del HTML. Si usted quiere hacer la temas visuales usted los necesita.

source: On the edit bar, we find options affecting the current context...
es: En la barra de edición, encontramos opciones que afectan el contexto actual...

source: :guilabel:`folder contents`
es: :guilabel:`Contenidos`

source: :guilabel:`view`
es: :guilabel:`Visualizar`

source: :guilabel:`edit`
es: :guilabel:`Editar`

source: :guilabel:`rules`
es: :guilabel:`Reglas`

source: :guilabel:`sharing`
es: :guilabel:`Compartir`

source: :guilabel:`display`
es: :guilabel:`Mostrar`

source: :guilabel:`add`
es: :guilabel:`Agregar nuevo...`

source: :guilabel:`status`
es: :guilabel:`Estado`

source: Some edit bar options only show when appropriate; for example,``folder content`` and ``add`` are only shown for Folders. ``rules`` is currently invisible because we have no content rules available.
es: Algunas opciones de la barra de edición sólo muestran cuando proceda; por ejemplo, la carpeta ``Contenidos`` y ``Agregar nuevo...`` sólo se muestran para carpetas. Las opción ``Reglas`` esta actualmente invisible porque no tenemos reglas de contenido disponible.

source: Content-Types
es: Tipos de Contenidos

source: Edit a page:
es: Editar una página:

source: :guilabel:`Edit front-page`
es: :guilabel:`Edite el documento front-page`

source: :guilabel:`Title` :samp:`Plone Conference 2014, Bristol`
es: :guilabel:`Titulo` :samp:`Plone Conference 2014, Bristol`

source: :guilabel:`Description` :samp:`Tutorial`
es: :guilabel:`Descripción` :samp:`Tutorial`

source: :guilabel:`Text` :samp:`...`
es: :guilabel:`Texto` :samp:`...`

source: Create a site-structure:
es: Crear un estructura del sitio:

source: Add folder "The Event" and in that ...
es: Agregar carpeta "El Evento" y que contenga...

source: Folder "Talks"
es: Carpeta "Charlas"

source: Folder "Training"
es: Carpeta "Entrenamientos"

source: Folder "Sprint"
es: Carpeta "Sprint"

source: In /news: Add News Item "Conference Website online!" with some image
es: En la ruta /news: Agregar una Noticia "¡Sitio Web de la Conferencia esta en linea!" con una imagen

source: In /news: Add News Item "Submit your talks!"
es: En la ruta /news: Agregar una Noticia "¡Enviar sus charlas!"

source: In /events: Add Event "Deadline for talk-submission" Date: 10.10.2014
es: En la ruta /news: Agregar un Evento "Fecha limite para enviar charlas" Fecha 10.10.2014

source: Add Folder "Register"
es: Agregar carpeta llamada "Registro"

source: Delete Folder "Members" (Users)
es: Eliminar la carpeta llamada "Members" (Usuarios)

source: Add Folder "Intranet"
es: Agregar carpeta llamada "Intranet"

source: The default content-types:
es: Los tipos de contenidos por defecto:

source: Document
es: Documento

source: News Item
es: Noticia

source: Event
es: Evento

source: File
es: Archivo

source: Image
es: Imagen

source: Link
es: Enlace

source: Folder
es: Carpeta

source: Collection
es: Colección

source: Please keep in mind that we use `plone.app.contenttypes <http://docs.plone.org/4/en/external/plone.app.contenttypes/docs/README.html>`_ for the training. Therefore the types are based on Dexterity and slightly different from the types that you will find in a default-Plone 4.3.x-site.
es: Por favor, tenga en cuenta que usamos `plone.app.contenttypes <http://docs.plone.org/4/en/external/plone.app.contenttypes/docs/README.html>`_ para el entrenamiento. Por lo tanto, los tipos se basan en Dexterity y un poco diferente de los tipos que se encuentran en un sitio Plone 4.3.x por defecto.

source: Folders
es: Carpetas

source: Go to 'the-event'
es: Ir a 'el-evento'

source: explain title/id/url
es: explicar title/id/url

source: explain /folder_contents
es: explicar /folder_contents

source: change order
es: cambiar orden

source: bulk-actions
es: acciones masivas

source: dropdown "display"
es: menú desplegable "Mostrar"

source: Add a page to 'the-event': "The Event" and make it the default-page
es: Agregar una página a 'el-evento': "El Evento" y hacerlo su página por defecto

source: The future: ``wildcard.foldercontents``
es: El futuro: ``wildcard.foldercontents``

source: Collections
es: Colecciones

source: add a new collection: "all content that has pending as wf_state".
es: agregar nueva colección: "todos los contenidos que este pendiente por revisión".

source: explain the default collection for events at http://localhost:8080/Plone/events/aggregator/edit
es: explicar la colección por defecto de eventos en http://localhost:8080/Plone/events/aggregator/edit

source: explain Topics
es: explicar Tópicos

source: mention collection-portlets
es: mencionar portlets de colección

source: multi-path-queries
es: multiples rutas a consultar

source: constraints, e.g. ``/Plone/folder::1``
es: restricciones, ej. ``/Plone/folder::1``

source: Content Rules
es: Reglas de Contenido

source: Create new rule "a new talk is in town"!
es: ¡Crear una nueva regla "una nueva charla está presente"!

source: New content in folder "Talks" -> Send Mail to reviewers.
es: Nuevo contenido en Carpeta "Charlas" -> Enviar correo a revisores.

source: History
es: Histórico

source: Show and explain; mention versioning and its relation to types.
es: Mostrar y explicar; el control de versiones y su relación con los tipos.

source: Manage members and groups
es: Administrar usuarios y grupos

source: add/edit/delete Users
es: agregar / editar / eliminar Usuarios

source: groups
es: grupos

source: Add group "Editors" and add the user 'editor' to it
es: Agregar grupo "Editores" y agregar el usuario 'editor' a ese.

source: Add group: ``orga``
es: Agregar grupo: ``orga``

source: add group: ``jury`` and add user 'jurymember' to it.
es: agregar grupo: ``jury`` y agregue usuario 'jurymember' a ese.

source: Workflows
es: Flujos de trabajos

source: Take a look at the ``state`` drop-down on the edit bar on the homepage. Now, navigate to one of the folders just added. The homepage has the status ``published`` and the new content is ``private``.
es: Echa un vistazo al menú desplegable ``Estado`` en la barra de edición en la página principal. Ahora, vaya a una de las carpetas que acaba de añadir. La página principal tiene el estado ``Publicado`` y el nuevo contenido es ``Privado``.

source: Let's look at the state transitions available for each type. We can make a published item private and a private item published. We can also submit an item for review.
es: Echemos un vistazo a las transiciones de estado disponibles para cada tipo. Podemos hacer un artículo publicado en privado y un artículo privado se pueda publicar. También podemos enviar un artículo para su revisión.

source: Each of these states connects roles to permissions.
es: Cada uno de esos estados conecta los roles a permisos.

source: In ``published`` state, the content is available to anonymous visitors;
es: En el estado ``Publicado``, el contenido está disponible para los visitantes anónimos;

source: In ``private`` state, the content is only viewable by the author (owner) and users who have the ``can view`` role for the content.
es: En el estado ``Privado``, el contenido es sólo visible para el autor (propietario) y los usuarios que tienen el rol local ``Puede ver`` para el contenido.

source: A workflow state is an association between a role and one or more permissions. Moving from one state to another is a ``transition``. Transitions (like ``submit for review``) may have actions — like the execution of a content role or script — associated with them.
es: Un estado de flujo de trabajo es una asociación entre un rol y uno o más permisos. Pasar de un estado a otro es una ``transición``. Las transiciones (como ``Enviar a revisión``) pueden tener acciones - como la ejecución de una regla de contenido o un script - asociado a ellos.

source: A complete set of workflow states and transitions make up a ``workflow``. Plone allows you to select among several pre-configured workflows that are appropriate for different types of sites. Individual content types may have their own workflow. Or, and this is particularly interesting, no workflow. In that case, which initially applies to file and image uploads, the content object inherits the workflow of its container.
es: Un conjunto completo de estados de flujo de trabajo y las transiciones constituyen un ``flujo de trabajo``. Plone le permite seleccionar entre varios flujos de trabajo preconfigurados que son apropiados para los diferentes tipos de sitios. Tipos de contenido individuales pueden tener su propio flujo de trabajo. O, lo que es particularmente interesante, sin flujo de trabajo. En ese caso, que se aplica inicialmente a presentar y la subida de imágenes, el objeto de contenido hereda el flujo de trabajo de su contenedor.

source: An oddity in the all of the standard Plone workflows: a content item may be viewable even if its container is not. Making a container private does **not** automatically make its contents private.
es: Una rareza en el todo de los flujos de trabajo estándar de Plone: un elemento de contenido puede ser visible incluso si su contenedor no es. Haciendo un contenedor privado **no** hacen automáticamente su contenido privado.

source: Read more at: http://docs.plone.org/4/en/working-with-content/collaboration-and-workflow/index.html
es: Lea más en: http://docs.plone.org/4/en/working-with-content/collaboration-and-workflow/index.html

source: Working copy
es: Copia de trabajo

source: Published content, even in an intranet setting, can pose a special problem for editing. It may need to be reviewed before changes are made available. In fact, the original author may not even have permission to change the document without review. Or, you may need to make a partial edit. In either case, it may be undesirable for changes to be immediately visible.
es: El contenido publicado, incluso en un entorno de Intranet, puede plantear un problema especial para la edición. Puede ser necesario revisar antes de que los cambios se hacen disponible. De hecho, el autor original podría incluso no tener permiso para cambiar el documento sin revisión. O bien, puede que tenga que hacer una edición parcial. En cualquiera de los casos, puede ser deseable para que los cambios sean visibles inmediatamente.

source: Plone's working copy support solves this problem by adding a check-out/check-in function for content — available on the actions menu. A content item may be checked out, worked on, then checked back in. Or abandoned if the changes weren't acceptable. Not until check in is the content visible.
es: El producto *Soporte de Copia de Trabajo* resuelve este problema mediante la adición una acción para *Retirar revisión* o *Guardar nueva revisión* de cambios para el contenido - disponible en el menú de acciones. Un elemento de contenido puede *guardar nueva revisión*, trabajado en una copia del elemento y después se *guardar nueva revisión* de nuevo. O *Cancelar retirada de revisión* si los cambios no eran aceptables. Hasta no guardar una nueva revisión de los cambios, el contenido anterior sera visible.

source: While it's shipped with Plone, working copy support is not a common need. So, if you need it, you need to activate it via the add-on packages configuration page. Unless activated, check-in/check-out options are not visible.
es: Mientras este complemento viene incorporado en Plone, el soporte de copia de trabajo no es una necesidad común. Así que, si usted lo necesita, usted necesita para activarlo a través de la página de configuración de Complementos. A menos que se active este complemento, las opciones de *Retirar revisión* / *Guardar nueva revisión* no son visibles.

source: Working-copy support is not yet available for content types created via Dexterity. This is on the way.
es: Soporte de Copia de Trabajo no está disponible para los tipos de contenido creados a través de Dexterity. Esto está en el camino (es un trabajo en proceso).

source: Placeful workflows
es: Flujos de trabajo Placeful

source: You may need to have different workflows in different parts of a site. For example, we created an intranet folder. Since this is intended for use by our conference organizers — but not the public — the simple workflow we wish to use for the rest of the site will not be desirable.
es: Usted puede necesitar tener diferentes flujos de trabajo en diferentes partes de un sitio. Por ejemplo, creamos una carpeta intranet. Dado que este es para uso de nuestros organizadores de la conferencia - pero no para el público - el sencillo flujo de trabajo que deseamos utilizar para que el resto del sitio no será deseable aquí.

source: Plone's ``Workflow Policy Support`` package gives you the ability to set different workflows in different sections of a site. Typically, you use it to set a special workflow in a folder that will govern everything under that folder. Since it has effect in a "place" in a site, this mechanism is often called "Placeful Workflow".
es: El paquete ``Soporte de Copia de Trabajo`` te da la posibilidad de configurar diferentes flujos de trabajo en las diferentes secciones de un sitio. Normalmente, se utiliza para configurar un flujo de trabajo especial en una carpeta que regirá todo bajo esa carpeta. Ya que tiene efecto en un "lugar" en un sitio, este mecanismo es a menudo llamado "flujo de trabajo Placeful".

source: As with working-copy support, Placeful Workflow ships with Plone but needs to be activated via the add-on configuration page. Once it's added, a ``Policy`` option will appear on the state menu to allow setting a placeful workflow policy.
es: Tanto como el Soporte de Copia de Trabajo, como el Soporte de Política de Flujo de trabajo Placeful viene incorporados en Plone, pero tiene que ser activadas a través de la página de configuración de Complementos. Una vez se ha añadido, una opción ``Política...`` aparecerá en el menú de Estado para permitir el establecimiento de una política de flujo de trabajo Placeful.
