Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/grok.po
Languages: es

source: Grok is an alternative declaration language for declaring your components. It is compatible with the Zope Component Architecture, it used just an alternative syntax.
es: Grok es un lenguaje de declaración alternativo para declarar sus componentes. Es compatible con la arquitectura de componentes de Zope, utilizó sólo una sintaxis alternativa.

source: Instead of writing separate zcml files, you annotate your code and you create content conforming to specific file names so that they are automatically found. There has been discussions whether grok should be used in the plone core. The plone community decided against it, because it increases the technology stack without adding functionality.
es: En lugar de escribir archivos zcml separados, usted anota su código fuente y cree contenido conforme a nombres de archivo específicos para que se encuentren automáticamente. Ha habido discusiones si grok se debe utilizar en el núcleo del plone. La comunidad plone decidió en contra, porque aumenta la pila de tecnología sin agregar funcionalidad.

source: Some people are even against using it in Add Ons, because there would not be just one way to declare components, but two. Then there is onle last disadvantage, grok components cannot be overridden by z3c.jbot. I would not be surprised if this could be fixed though.
es: Algunas personas incluso están en contra de usarlo en Complementos, porque no habría una sola manera de declarar componentes, sino dos. Entonces hay una última desventaja, los componentes grok no pueden ser sobre-escritos por el paquete z3c.jbot. No me sorprendería si esto podría arreglarse.

source: After all these negative things let us tell you why we still like it: We like to write as few lines of code and configuration as possible.
es: Después de todas estas cosas negativas vamos a decirle por qué todavía nos gusta: Nos gusta escribir como pocas líneas de código y configuración como sea posible.

source: So, we will write our browser view as a grok view. From the component architecture side, nothing changes. We still need to write a multi adapter. All the details like which template to use or for which browser layer the view shall be used is declared with a single line annotation or deduced from file names.
es: Por lo tanto, vamos a escribir nuestra browser view como una vista grok. Desde el lado de la arquitectura de componentes, nada cambia. Todavía tenemos que escribir un adaptador múltiple. Todos los detalles como la plantilla a utilizar o para qué browser layer se utilizará la vista se declarará con una sola anotación de línea o se deducirá de los nombres de archivo.

source: Grok is not part of plone. We have to add it as a dependency to our egg.
es: Grok no es parte de plone. Tenemos que añadirlo como una dependencia de nuestro paquete egg.

source: Open setup.py, and add ``five.grok`` to the list off addons in ``install_requires``::
es: Open setup.py, and add ``five.grok`` to the list off addons in ``install_requires``:: Abra el archivo ``setup.py`` y agregue ``five.grok`` a la lista de complementos en la declarativa ``install_requires``::

source: You need to run buildout now.
es: Usted necesita ejecutar buildout ahora.

source: Grok nearly magicaly does find all its annotations. Since its not complete magic, you have to tell grok where to look for grok code. This requires a single line of zcml, that line ensures that your complete package is `grokked`.
es: Grok casi mágicamente encuentra todas sus anotaciones. Puesto que su magia no es completa, tienes que decirle a grok dónde buscar código grok. Esto requiere una sola línea de zcml, esa línea asegura que su paquete sea completamente `grokked`.

source: This new grok statement takes care of finding everything grok related.
es: Esta nueva declaración grok se encarga de encontrar todo lo relacionado con grok.

source: Now we can add a grok view in a new file ``views.py``:
es: Ahora nosotros agregamos una vista grok en el nuevo archivo ``views.py``:
