Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/index.po
Languages: es

source: Plone Training
es: Entrenamiento en Plone

source: A collection of trainings developed and created by the Plone Community.
es: Una colección de diferentes entrenamientos, desarrollado y creado por la comunidad Plone.

source: Trainings
es: Entrenamientos

source: Mastering Plone is a training intended for people who are new to Plone or want to learn about the best practices of Plone development.
es: Maestría en Plone es una entrenamiento pensado para las personas quienes son nuevas en Plone o quieran aprender acerca de las mejores prácticas del desarrollo en Plone.

source: In the course of the training you will learn how to build a custom website with plenty of features. HTML and python-knowledge is required.
es: En el curso de el entrenamiento usted aprenderá a como construir un sitio web personalizado con plenitud de características. HTML y conocimiento en python es requerido.

source: Create custom content types, a design for a website, layouts for home pages and content types, and custom application logic. All in the browser!
es: Crear tipo de contenidos personalizados, un diseño para un sitio web, portadas para sus paginas de inicio y tipos de contenidos, y lógica de aplicación personalizada. ¡Todo desde el navegador web!

source: Create a Diazo-based theme as a Plone add-on.
es: Cree un tema basado en Diazo como complemento de Plone.

source: How to create and make optimum use of custom Plone workflows
es: Cómo crear y optimizar el uso de flujos de trabajo personalizados de Plone

source: Learn best practices in JavaScript development, how to develop and test your own patterns, and how to integrate your custom JavaScript applications with Plone.
es: Aprender las mejores prácticas en el desarrollo Javascript, como desarrollar y probar sus propios patrones, y como integrar sus propias aplicaciones Javascript con Plone.

source: Technologies will include NPM, Grunt, Patternslib and React.
es: Tecnologías las cuales serán incluidas son NPM, Grunt, Patternslib y React.

source: How to automate deployment of Plone servers, whether it’s one server or 100.
es: Cómo automatizar el despliegue de servidores Plone, ya sea un servidor o 100.

source: How to add enterprise-grade search to your Plone site.
es: Cómo añadir una búsqueda de nivel empresarial a su sitio de Plone.

source: Building Angular 4 apps using the Plone REST API.
es: Construir aplicaciones Angular 4 usando el Plone REST API.
