Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/installation.po
Languages: es

source: Installation & Setup
es: Instalación y configuración

source: Installing Plone
es: Instalando Plone

source: Plone 4.3.x requires a working Python 2.7 and several other system tools that not every OS provides. Therefore the installation of Plone is different on every system. Here are some ways that Python can be used:
es: Plone 4.3.x requiere Python 2.7 y varias otras herramientas del sistema que no todos los sistemas operativos proporciona por defecto. Por lo tanto la instalación de Plone es diferente en cada sistema. Aquí hay algunas maneras que Python se puede utilizar:

source: use a Python that comes pre-installed in your operating system (most Linuxes and Mac OS have one)
es: utilizar un Python que viene instalado previamente en su sistema operativo (en la mayoría de GNU/Linux y Mac OS tienen uno incorporado)

source: use the `python buildout <https://github.com/collective/buildout.python>`_
es: use el `python buildout <https://github.com/collective/buildout.python>`_

source: building Linux-packages
es: instale los paquetes construido en su sabor de Linux

source: MacOS 10.8 and Ubuntu 14.04 come with a working default Python 2.7 built in. These are the lucky ones. To run a Plone version older than 4.0 you need Python 2.4. That's not always easy to install.
es: MacOS 10.8 y Ubuntu 14.04 tendrán instalado por defecto un Python 2.7. Los usuarios de estos sistemas son los afortunados. Para ejecutar una versión de Plone anterior a la 4.0 usted necesita Python 2.4. No siempre es fácil de instalar.

source: Most developers use their primary system to develop Plone. For complex setups they often use Linux virtual machines.
es: La mayoría de los desarrolladores suelen utilizar su sistema primario para desarrollar Plone. Para configuraciones complejas que a menudo usan máquinas virtuales en Linux.

source: OS X: Use the python buildout to compile python and homebrew for some missing Linux tools.
es: OS X: Usa el buildout de python para compilar todas las versiones necesarias de Python y la herramienta homebrew para instalar algunas herramientas de Linux.

source: Linux: Depending on your Linux flavor you might have to build python yourself and install some tools.
es: Linux: Dependiendo de su sabor de Linux que usted podría tener que construir Python por ti mismo e instalar algunas herramientas.

source: Windows: Alan Runyan (one of Plone's founders) uses it. A downside: Plone seems to be running much slower on Windows.
es: Windows: Alan Runyan (uno de los fundadores Plone) lo utiliza. Un inconveniente: Plone parece funcionar mucho más lento en Windows.

source: Plone offers multiple options for being installed:
es: Plone ofrece múltiples opciones para que se instale:

source: One-click installers for Mac and Windows
es: Instaladores de un clic para Mac y de Windows

source: Unified installers (all 'nix, including MacOS)
es: Unified installers (todos los Unix, incluyendo MacOS)

source: A vagrant/virtualbox install kit (all platforms)
es: Un kit de instalación vagrant/virtualbox (todas las plataformas)

source: Use your own Buildout
es: Utilice su propio Buildout

source: You can download all of these at https://old.plone.org/products/plone/releases/4.3.4
es: Puede descargar todo esto en https://old.plone.org/products/plone/releases/4.3.4

source: For the training we'll use option 3 and 4 to install and run Plone. We'll create our own Buildout and extend it as we wish. But we will do so in a vagrant machine. For your own first experiments we recommend option 2 or 3 (if you have a Windows laptop or encounter problems). Later on you should be able to use your own Buildout (we'll cover that later on).
es: Para el entrenamiento vamos a utilizar la opción 3 y 4 para instalar y ejecutar Plone. Vamos a crear nuestro propio Buildout y lo extenderemos como deseamos. Pero lo haremos en una máquina vagrant. Para sus primeros experimentos propios se recomienda la opción 2 o 3 (si usted tiene una portátil con Windows o al encontrar problemas en su proceso de instalación). Más adelante usted debería ser capaz de utilizar su propio Buildout (lo cubriremos más adelante).

source: Hosting Plone
es: Alojando Plone

source: If you want to host a real live Plone site yourself then running it from your laptop is not a viable option.
es: Si usted desea alojando un sitio real de Plone por si mismo entonces ejecutarlo desde su computadora portátil no es una opción viable.

source: You can host Plone...
es: Puede alojar Plone...

source: with one of many professional `hosting providers <http://plone.com/providers>`_
es: con uno de los muchos `proveedores de alojamiento <http://plone.com/providers>`_

source: on a virtual private server
es: en un servidor privado virtual

source: on dedicated servers
es: en los servidores dedicados

source: on `heroku <https://www.heroku.com/>`_ you can run Plone for *free* using the `Heroku buildpack for Plone <https://github.com/niteoweb/heroku-buildpack-plone>`_
es: en `heroku <https://www.heroku.com/>`_ puede ejecutar Plone para uso *gratis* usando el `Heroku buildpack para Plone <https://github.com/niteoweb/heroku-buildpack-plone>`_

source: in the cloud (e.g. using Amazon EC2 or `Codio.com <http://blog.dbain.com/2014/04/install-plone-in-under-5-minutes-on.html>`_)
es: en la nube (por ejemplo, el uso de Amazon EC2 o `Codio.com <http://blog.dbain.com/2014/04/install-plone-in-under-5-minutes-on.html>`_)

source: Plone Installation Requirements: http://docs.plone.org/4/en/manage/installing/requirements.html
es: Requerimientos de la instalación de Plone : http://docs.plone.org/4/en/manage/installing/requirements.html

source: Run Plone on a 5$ plan: http://www.stevemcmahon.com/steves-blog/plone-on-5-a-month
es: Ejecute Plone en un plan de 5$ http://www.stevemcmahon.com/steves-blog/plone-on-5-a-month

source: Where to host Plone: https://old.plone.org/documentation/faq/where-can-i-host-my-plone-site
es: Dónde alojar Plone: https://old.plone.org/documentation/faq/where-can-i-host-my-plone-site

source: Production Deployment
es: Despliegue en ambientes de producción

source: The way we're setting up a Plone site during this class may be adequate for a small site — or even a very large one that's not very busy — but you're likely to want to do much more if you're using Plone for anything demanding.
es: La manera en que estamos montando un sitio Plone durante esta clase puede ser adecuado para un sitio pequeño - o incluso uno muy grande que no está muy ocupado - pero es muy probable que desee hacer mucho más si estás usando Plone para ninguna demanda.

source: Using a production web server like Apache or Nginx for URL rewriting, SSL and combining multiple, best-of-breed solutions into a single web site.
es: El uso de un servidor web de producción como Apache o Nginx para la reescritura de URL, SSL y combinación de múltiples, las mejores soluciones de su clase todo en un solo sitio web.

source: Reverse proxy caching with a tool like Varnish to improve site performance.
es: El almacenamiento en caché de proxy inverso con una herramienta como Varnish para mejorar el rendimiento del sitio.

source: Load balancing to make best use of multiple core CPUs and even multiple servers.
es: El balanceo de carga para hacer el mejor uso de núcleo múltiple de CPU e incluso múltiples servidores.

source: Optimizing cache headers and Plone's internal caching schemes with plone.app.caching.
es: Optimización cabeceras de caché y esquemas de caché interna de Plone con el paquete plone.app.caching.

source: And, you'll need to learn strategies for efficient backup and log file rotation.
es: Y, usted necesita aprender estrategias eficientes para la copia de seguridad y rotación del archivo de los registros.

source: All these topics are introduced in `Guide to deploying and installing Plone in production <http://docs.plone.org/4/en/manage/deploying/index.html>`_.
es: Todos estos temas son introducidos en la `Guía para el despliegue e instalación de Plone en producción <http://docs.plone.org/4/en/manage/deploying/index.html>`_.
