Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Go to ``portal_skins``
es: Valla a ``portal_skins``

source: Go to ``plone_styles``
es: Valla a ``plone_styles``

source: Go to :file:`ploneCustom.css`
es: Valla a :file:`ploneCustom.css`

source: Click :guilabel:`customize`
es: Haga clic en :guilabel:`customize`

source: The CSS you add to this file is instantly active on the site.
es: El CSS que añada a este archivo está instantáneamente activo en el sitio.

source: Change the footer
es: Cambiar el pie de página

source: Go to ``portal_view_customizations``
es: Valla a la herramienta ``portal_view_customizations``

source: Search ``plone.footer``, click and customize
es: Busque ``plone.footer``, haga clic en el y presione el botón ``Customize``

source: Replace the content with the following
es: Reemplace el contenido con lo siguiente

source: CSS Registry (``portal_css``)
es: Registro de CSS (``portal_css``)

source: *deprecated* (See the chapter on theming)
es: *obsoleto* (Ver porque en el capítulo sobre temas)

source: Further tools in the ZMI
es: Más herramientas en el ZMI

source: There are many more notable items in the ZMI. We'll visit some of them later.
es: Hay muchos más elementos notables en el ZMI. Nosotros los visitaremos más tarde.

source: :guilabel:`portal_properties` (deprecated)
es: :guilabel:`portal_properties` (obsoleto)

source: You can configure and customize a lot in Plone through the web. The most important options are accessible in the `Plone control panel <http://localhost:8080/Plone/@@overview-controlpanel>`_ but some are hidden away in the `ZMI <http://localhost:8080/Plone/manage>`_. The amount and presentation of information is overwhelming but you'll get the hang of it through a lot of practice.
es: Puedes configurar y personalizar muchas cosas en Plone a través de la Web. Las opciones más importantes son accesibles en el `panel de control de Plone <http://localhost:8080/Plone/@@overview-controlpanel>`_ pero aun más están escondidas en la `ZMI <http://localhost:8080/Plone/manage>`_. La cantidad y presentación de la información es abrumadora, pero usted conseguirá la caída de ella a través de mucha práctica.

source: Custom Search
es: Búsqueda Personalizada

source: If the chapters about views seem complex, the custom search add-ons shown below might be a great alternative until you feel comfortable writing views and templates.
es: Si los capítulos acerca de vistas le parece complejo, el complemento de búsqueda personalizado ahora se muestra como una gran alternativa hasta que se sientas cómodo escribiendo vistas y plantillas.

source: Here are two add-ons that allow you to add custom searches and content listings through the web in Plone.
es: Aquí hay dos complementos que permitan añadir impresionantes búsquedas personalizadas y listados de contenidos a través de la Web en Plone.

source: eea.facetednavigation is a full-featured and a very powerful add-on to improve search within large collections of items. No programming skills are required to configure it since the configuration is done TTW (Through-The-Web).
es: eea.facetednavigation es un complemento con todas las funciones y muy potente para mejorar la búsqueda dentro de grandes colecciones de elementos. No se requieren habilidades de programación para configurarlo ya que la configuración se realiza a través de la Web.

source: It lets you gradually select and explore different facets (metadata/properties) of the site content and narrow down you search quickly and dynamically.
es: Ese le permite seleccionar gradualmente y explorar diferentes facetas (metadata/propiedades) del contenido del sitio y la fecha abajo usted buscarán rápidamente y dinámicamente.

source: Install `eea.facetednavigation <https://pypi.org/project/eea.facetednavigation/>`_
es: Instale el complemento `eea.facetednavigation <https://pypi.org/project/eea.facetednavigation/>`_

source: Enable it on a new folder "Discover talks" by clicking on :guilabel:`Actions > Enable faceted navigation`.
es: Habilite la navegación en facetas en una nueva carpeta "Descubriendo charlas" haciendo clic en el menú de edición *Acciones* > *Enable faceted navigation*.

source: Click on the :guilabel:`Faceted > Configure` to configure it through the web.
es: Haga clic en :guilabel:`Faceted > Configure` para configurar esta.

source: Select 'Talk' for *Portal type*, hide *Results per page*
es: Selecciona 'Talk' para *Portal type*, oculta *Results per page*

source: Add a checkboxes widget to the left and use the catalog index *Audience* for it.
es: Añada un widget de selección a la izquierda y usa el indice de catalogo *Audience* para eso.

source: Add a select widget for speaker
es: Añada un widget de selección para el tipo de contenido speaker

source: Add a radio widget for type_of_talk
es: Añada un widget de radio para type_of_talk

source: We use the new catalog indexes to provide the data for the widgets and search the results. For other use cases we could also use either the built-in vocabularies (https://pypi.org/project/plone.app.vocabularies) or create custom vocabularies for this.
es: Usaremos el nuevo índice de catálogo para proveer la data de los widgets y buscar los resultados. Para otros casos de uso podremos usar entre los vocabularios integrados (https://pypi.org/project/plone.app.vocabularies) o crear vocabularios personalizados para este.

source: Custom vocabularies TTW (Through-The-Web) using `Products.ATVocabularyManager <https://pypi.org/project/Products.ATVocabularyManager>`_
es: Vocabularios personalizados TTW (A través de la Web) usando el complemento `Products.ATVocabularyManager <https://pypi.org/project/Products.ATVocabularyManager>`_

source: Programming using Vocabularies: https://docs.plone.org/external/plone.app.dexterity/docs/advanced/vocabularies.html
es: Programando usando vocabularios: https://docs.plone.org/external/plone.app.dexterity/docs/advanced/vocabularies.html

source: A more light-weight solution for custom searches and faceted navigation is `collective.portlet.collectionfilter <https://pypi.org/project/collective.portlet.collectionfilter>`_. By default it allows you to search among the results of a collection and/or filter the results by keywords, author or type.
es: Una solución más liviana para búsquedas personalizadas y navegación con facetas es `collective.portlet.collectionfilter <https://pypi.org/project/collective.portlet.collectionfilter>`_. De forma predeterminada, le permite buscar entre los resultados de una colección y/o filtrar los resultados por palabras clave, autor o tipo.

source: It can also be extended quite easily to allow additional filters (like `audience`).
es: También se puede ampliar con bastante facilidad para permitir filtros adicionales (como `audience`).

source: Releasing Your Code
es: Publicando su código

source: pypi-test egg deployment
es: despliegue de prueba en pypi del paquete egg

source: We finally have some working code! Depending on your policies, you need repeatable deployments and definitive versions of software. That means you don't just run your production site with your latest source code from your source repository. You want to work with eggs.
es: ¡Finalmente tenemos algo de código funcionando! dependiendo de sus políticas, usted necesitaras despliegues repetitivos y versiones definitivas de software. Lo que significa que no corres tu sitio en producción con tu ultimo fuente de tu repositorio de fuentes. Quieres trabajar con paquetes eggs.

source: Making eggs is easy, making them properly not so much. There are a number of good practices that you should ensure. Let's see. You want to have a sensible version number. By looking at the version number alone one should get a good idea how many changes there are (semantic version number scheme). Of course you always document everything, but for upgrades it is even more important to have complete changelogs.
es: Haciendo los paquetes eggs es fácil, hacerlos apropiadamente no tanto, hay un gran numero de buenas prácticas que le gustaría asegurar. Veamos. Quieres tener un número sensible de versión. Mirando solamente al número de versión, uno debería tener una idea, de cuantos cambios hay (esquema semántico de numero de versión). Usted por supuesto siempre debes documentar todo, pero para las actualizaciones es incluso más importante tener un registro de cambios.

source: Sometimes, you cannot upgrade to a newer version, but you need a hotfix or whatever. It is crucial that you are able to checkout the exact version you use for your egg.
es: Algunas veces no puedes actualizar a una nueva versión, pero necesitas un parche o algo. Es crucial que seas capaz de chequear la versión exacta que usas de su paquete egg.

source: These are a lot of steps, and there are a lot of actions that can go wrong. Luckily, there is a way to automate it. zest.releaser provides scripts to release an egg, to check what has changed since the release and to check if the documentation has errors.
es: Hay muchos pasos que hacer, y muchas acciones que pueden salir mal. Afortunadamente, hay una forma de automatizarlo. zest.releaser provee scripts para publicar un paquete egg, para verificar qué ha cambiado desde el lanzamiento y para verificar si la documentación tiene errores.

source: There once was a book on python. Among other things, it had a chapter on releasing an egg with sample code. The sample code was about a printer of nested lists. This resulted in a lot of packages to print out nested lists on pypi.
es: Hubo una vez un libro en python. Ese tenia un capítulo de como instalar un paquete egg con un código ejemplo. El código ejemplo fue acerca de una lista anidada de impresoras. Hay muchos paquetes para imprimir listas anidadas en el Indice de paquetes Python (PyPI).

source: We will avoid this. Everybody, go to `test.pypi.org <https://test.pypi.org>`_ and create an account now.
es: Vamos a evitar esto. Todos, vayan a `testpypi.python.org <https://testpypi.python.org/pypi>`_ y creen una cuenta ahora.

source: Next, copy the pypirc_sample file to ~/.pypirc, modify it to contain your real username and password.
es: Siguiente, copia el archivo pypirc_sample a ~/.pypirc, modifíquelo para contener tu usuario y contraseña real.

source: Now that we are prepared, let's install zest.releaser.
es: Ahora que estamos preparados, instale el paquete zest.releaser.

source: Buildout II: Getting Ready for Deployment
es: Buildout - Parte II: Cómo prepararse para el despliegue

source: The Starzel buildout
es: El buildout de Starzel

source: Have a look at the buildout some of the trainers use for their projects: https://github.com/starzel/buildout
es: Eche un vistazo a el buildout que algunos de los entrenadores usan para sus proyectos: https://github.com/starzel/buildout

source: It has some notable features:
es: Tiene algunas características notables:

source: It extends to config- and version-files on github shared by all projects that use the same version of Plone:
es: Se extiende a los archivos de configuración y versión en github compartidos por todos los proyectos que usan la misma versión de Plone:

source: It allows to update a project simply by changing the version it extends.
es: Permite actualizar un proyecto simplemente cambiando la versión que extiende.

source: It allows to update all projects of one version by changing remote files (very useful for HotFixes).
es: Permite actualizar todos los proyectos de una versión cambiando los archivos remotos (muy útil para HotFixes).

source: It is minimal work to setup a new project.
es: Es un trabajo mínimo para configurar un nuevo proyecto.

source: It has presets for development, testing, staging and production.
es: Tiene ajustes preestablecidos para entornos de desarrollo, pruebas, puesta en escena y producción.

source: It has all the nice development-helpers we use.
es: Tiene todos los buenos ayudantes de desarrollo que usamos.

source: Another noteable buildout to look for inspiration:
es: Otro buildout notable para buscar inspiración:

source: A deployment setup
es: Una instalación de despliegue

source: Deploying Plone and production-setups are outside the scope for this training. Please see https://docs.plone.org/manage/deploying/index.html
es: Los despliegues de Plone y las configuraciones de ambiente de producción están fuera del alcance de este entrenamiento. Por favor mira https://docs.plone.org/manage/deploying/index.html

source: Other tools we use
es: Otras herramientas a usar

source: There are plenty of tools that make developing and managing sites much easier. Here are only some of the ones you might want to check out:
es: Existen muchas herramientas que facilitan el desarrollo y la administración de sitios. Estos son solo algunos de los que quizás desee verificar:

source: Fabric (managing sites)
es: Fabric (administra sitios)

source: Sentry (error monitoring)
es: Sentry (monitoreo de errores)

source: Ansible (managing and provisioning machines)
es: Ansible (administra e aprovisiona maquinas)

source: Greylog, ELK (logging)
es: Greylog, ELK (registros)

source: Nagios, Zabbix (server monitoring)
es: Nagios, Zabbix (monitoreo de servidores)

source: jenkins, gitlab-ci, travis, drone.io (Continuous Integration)
es: jenkins, gitlab-ci, travis, drone.io (Integración Continua)

source: piwik (statistics)
es: piwik (estadísticas)

source: gitlab (code repo and code review)
es: gitlab (repositorio y revisión de código fuente)

source: redmine, taiga, assembla (project-management and ticket-system)
es: redmine, taiga, assembla (administrar proyecto y sistema de ticket)

source: Dexterity I: "Through The Web"
es: Dexterity - Parte I: "A través de la Web"

source: Create a new content type called *Talk*.
es: Crea un nuevo tipo de contenido llamado *Talk*.

source: Content types
es: Tipos de contenidos

source: Archetypes and Dexterity
es: Archetypes y Dexterity

source: Fields
es: Campos

source: What is a content type?
es: ¿Qué es un tipo de contenido?

source: A content type is a kind of object that can store information and is editable by users. We have different content types to reflect the different kinds of information about which we need to collect and display information. Pages, folders, events, news items, files (binary) and images are all content types.
es: Un tipo de contenido es una variedad de objetos que pueden almacenar información y es editable por los usuarios. Tenemos diferentes tipos de contenido para reflejar los diferentes tipos de información sobre la que tenemos que recopilar y mostrar la información. Las páginas, las carpetas, los eventos, las noticias, los archivos (binarios) y las imágenes son todos los tipos de contenido.

source: It is common in developing a web site that you'll need customized versions of common content types, or perhaps even entirely new types.
es: Es común en el desarrollo de un sitio Web usted necesitará versiones personalizadas de los tipos de contenido comunes, o tal vez incluso totalmente nuevos tipos.

source: Remember the requirements for our project? We wanted to be able to solicit and edit conference talks. We *could* use the **Page** content type for that purpose. But we need to make sure we collect certain bits of information about a talk and we couldn't be sure to get that information if we just asked potential presenters to create a page. Also, we'll want to be able to display talks featuring that special information, and we'll want to be able to show collections of talks. A custom content type will be ideal.
es: ¿Recuerda los requisitos para nuestro proyecto? Queríamos ser capaces de solicitar y editar charlas de la conferencia. Nosotros *podríamos* utilizar el tipo de contenido *Página* para ese propósito. Sin embargo, hay bits de información que necesitamos para asegurarnos de que obtenemos sobre una charla y no sería seguro de obtener esa información si sólo pedimos ponentes potenciales para crear una página. Además, vamos a querer ser capaz de mostrar las charlas que ofrecen esa información especial, y nosotros queremos ser capaces de mostrar las colecciones de charlas. Un tipo de contenido personalizado será ideal.

source: The makings of a Plone content type
es: Los elementos de un tipo de contenido Plone

source: Every Plone content type has the following parts:
es: Cada tipo de contenido Plone tiene las siguientes partes:

source: Schema
es: Esquema

source: A definition of fields that comprise a content type; properties of an object.
es: Una definición de campos que comprenden un tipo de contenido; propiedades de un objeto.

source: The "Factory Type Information" configures the content type in Plone, assigns it a name, additional features and available views to it.
es: La "Factory Type Information" configura el tipo de contenido en Plone, asigna un nombre, un icono, características adicionales y posibles vistas.

source: Views
es: Vistas

source: A view is a representation of the object and the content of its fields that may be rendered in response to a request. You may have *one or more* views for an object. Some may be *visual* — intended for display as web pages — others may be intended to satisfy AJAX requests and render content in formats like JSON or XML.
es: Una vista es una representación del objeto y el contenido de sus campos que pueden prestarse en respuesta a una solicitud. Usted puede tener *una o más* vistas de un objeto. Algunos pueden ser *visuales* - destinados a la pantalla en forma de páginas Web - otros pueden estar destinados a satisfacer las peticiones AJAX y estar en formatos como JSON o XML.

source: Dexterity and Archetypes - A Comparison
es: Dexterity y Archetypes - Una comparación

source: There used to be two content frameworks in Plone:
es: Hay en uso dos frameworks de contenido en Plone:

source: *Dexterity*: new and default.
es: *Dexterity*: nuevo y por defecto.

source: *Archetypes*: the old default in Plone 4 and deprecated. Still used in some add-ons.
es: *Archetypes:* los tipos de contenidos viejos en Plone 4 y obsoletos. Aun utilizado en muchos complementos.

source: Plone 4.x: Archetypes is the default, with Dexterity available.
es: Plone 4.x: Archetypes es el predeterminado, con Dexterity disponible.

source: Plone 5.x: Dexterity is the default, with Archetypes available. In Plone 6 Archetypes will not be available any more.
es: Plone 5.x: Dexterity es el predeterminado, con Archetypes disponible. En Plone 6 Archetypes no estará disponible nunca más.

source: For both, add and edit forms are created automatically from a schema.
es: Por tanto, añadir y editar formularios se crean automáticamente a partir de un esquema.

source: What are the differences?
es: ¿Cuales son las diferencias?

source: Dexterity: New, faster, modular, no dark magic for getters and setters.
es: Dexterity: Nuevo, más rápido, modular, no hay magia oscura para los métodos getters y setters.

source: Archetypes had magic setter/getter - use :py:meth:`talk.getAudience()` for the field :py:attr:`audience`.
es: Archetypes tiene métodos mágicos setter/getter - usa :py:meth:`talk.getAudience()` para el campo :py:attr:`audience`.

source: Dexterity: fields are attributes: :py:attr:`talk.audience` instead of :py:meth:`talk.getAudience()`.
es: Dexterity: los campos son atributos: :py:attr:`talk.audience` en vez de :py:meth:`talk.getAudience()`.

source: "Through The Web" or TTW, i.e. in the browser, without programming:
es: "Through The Web" o TTW, es decir, A través de la Web en el navegador, sin programación:

source: Dexterity has a good TTW story.
es: Dexterity tiene una buena historia a través de la Web.

source: Archetypes has no TTW story.
es: Archetypes no tiene historia a través de la Web.

source: UML-modeling: `ArchGenXML <https://docs.plone.org/old-reference-manuals/archgenxml/index.html>`_ for Archetypes, `agx <https://web.archive.org/web/20170411060701/http://agx.me/>`_ for Dexterity
es: Modelado UML: `ArchGenXML <https://docs.plone.org/old-reference-manuals/archgenxml/index.html>`_ para Archetypes, `agx <https://web.archive.org/web/20170411060701/http://agx.me/>`_ para Dexterity

source: Approaches for Developers:
es: Enfoques para Desarrolladores:

source: Schema in Dexterity: TTW, XML, Python. Interface = schema, often no class needed.
es: Esquema en Dexterity: A través de la Web, XML, Python. Interface = esquema, a menudo no hay clase necesaria.

source: Schema in Archetypes: Schema only in Python.
es: Esquema en Archetypes: Esquemas solamente en Python.

source: Dexterity: Easy permissions per field, easy custom forms.
es: Dexterity: Permisos fácil por cada campo. fácil personalización de formularios.

source: Archetypes: Permissions per field are hard, custom forms even harder.
es: Archetypes: Los permisos por campo son duros, los formularios personalizados aún más difícil.

source: If you have to program for old Plone 4-based sites you still need to know Archetypes!
es: Si tiene que programar para sitios antiguos basados en Plone 4, ¡usted necesita saber Archetypes!

source: If starting fresh always use Dexterity.
es: Si empezar desde cero en nuevo sitios, use Dexterity.

source: Extending:
es: Extendiendo:

source: Dexterity has Behaviors: easily extendable. Just activate a behavior TTW and your content type is e.g. translatable (:py:mod:`plone.app.multilingual`).
es: Dexterity tiene Comportamientos: fácilmente ampliable. Basta con activar un comportamiento a través de la Web y su tipo de contenido es, por ejemplo traducible (:py:mod:`plone.app.multilingual`).

source: Archetypes has :py:mod:`archetypes.schemaextender`. Powerful but not as flexible.
es: Archetypes tiene el complemento :py:mod:`archetypes.schemaextender`. Potente pero no tan flexible.

source: We have only used Dexterity for the last few years. We teach Dexterity and not Archetypes because it's more accessible to beginners, has a great TTW story and is the future.
es: Sólo hemos utilizado Dexterity en los últimos años. Enseñamos Dexterity y no Archetypes porque es más accesible a los principiantes, tiene una gran historia a través de la Web y es el futuro.

source: Views:
es: Vistas:

source: Both Dexterity and Archetypes have a default view for content types.
es: Tanto Dexterity y Archetypes tienen una vista por defecto de tipos de contenido.

source: Browser Views provide custom views.
es: Browser Views proveen vistas personalizadas.

source: You can generate views for content types in the browser without programming (using the :py:mod:`plone.app.mosaic` Add-on).
es: Puede generar vistas para tipos de contenido en el navegador sin programación (usando el complemento :py:mod:`plone.app.mosaic`).

source: Display Forms.
es: Mostrar Formularios.

source: Modifying existing types
es: Modificando tipos existentes

source: Go to the control panel http://localhost:8080/Plone/@@dexterity-types
es: Valla a panel de control http://localhost:8080/Plone/@@dexterity-types

source: Inspect some of the existing default types.
es: Inspecciona algunos de los tipos de contenido existentes.

source: Select the type :guilabel:`News Item` and add a new field ``Hot News`` of type :guilabel:`Yes/No`
es: Seleccione el tipo de contenidos ``Noticias`` y añadir un nuevo campo ``Hot News`` de tipo :guilabel:`Sí/No`

source: In another tab, add a *News Item* and you'll see the new field.
es: En otra pestaña añadir un tipo de contenido Noticia y entonces se ve el nuevo campo.

source: Go back to the schema-editor and click on `Edit XML Field Model <http://localhost:8080/Plone/dexterity-types/News%20Item/@@modeleditor>`_.
es: Valla al editor de esquema y haga clic en `Editar el modelo de campo XML <http://localhost:8080/Plone/dexterity-types/News%20Item/@@modeleditor>`_.
