Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: In Plone 4 that used to be ``CONTEXTS``
es: En Plone 4 que solía ser ``CONTEXTS``

source: Pure TAL blocks
es: Bloques TAL Pure

source: We can use TAL attributes without HTML Tags.
es: Podemos utilizar atributos TAL sin marcas HTML.

source: This is useful when we don't need to add any tags to the markup.
es: Esto es útil cuando no es necesario añadir las etiquetas para el marcado.

source: Syntax:
es: Sintaxis:

source: handling complex data in templates
es: manejo de datos complejos en plantillas

source: Let's move on to a little more complex data. And to another TAL attribute:
es: Pasemos a datos un poco más complejos. Y a otro atributo TAL:

source: replace the content of an element and removes the element only leaving the content.
es: reemplazar el contenido de un elemento y elimina el elemento dejando sólo el contenido.

source: this results in:
es: esto resulta en:

source: ``tal:replace`` drops its own base tag in favor of the result of the TALES expression. Thus the original ``<img... >`` is replaced.
es: ``tal:replace`` cae su propia base de etiquetas a favor del resultado de la expresión TALES. Por lo tanto el original ``<img... >`` se sustituye.

source: But the result is escaped by default.
es: Pero el resultado se escapó por defecto.

source: To prevent escaping we use ``structure``
es: Para prevenir que se escapen utilizamos ``structure``

source: Now let's emulate a typical Plone structure by creating a dictionary.
es: Ahora vamos a emular una estructura típica Plone mediante la creación de un diccionario.

source: We emulate a list of talks and display information about them in a table. We'll get back to the list of talks later when we use the real talk objects that we created with dexterity.
es: Nosotros emulamos una lista de charlas y mostrar información en una tabla. Nos pondremos en contacto a la lista de las charlas más tarde, cuando se utilizan los verdaderos objetos charlas que hemos creado con dexterity.

source: To complete the list here are the TAL attributes we have not yet used:
es: Para completar la lista que aquí están los atributos TAL que no hemos utilizado todavía:

source: Omit the element tag, leaving only the inner content.
es: Omita la etiqueta del elemento, dejando sólo el contenido interno.

source: When an element has multiple TAL attributes, they are executed in this order:
es: Cuando un elemento tiene múltiples atributos TAL, se ejecutan en este orden:

source: content or replace
es: content o replace

source: Plone 5 uses a new rendering engine called `Chameleon <https://chameleon.readthedocs.io/en/latest/>`_.
es: Plone 5 usa un nuevo motor de renderizado llamado `Chameleon <https://chameleon.readthedocs.io/en/latest/>`_.

source: Using the integration layer `five.pt <https://pypi.org/project/five.pt>`_ it is fully compatible with the normal TAL syntax but offers some additional features:
es: Usando la capa de integración `five.pt <https://pypi.org/project/five.pt>`_ es totalmente compatible con la sintaxis TAL normal, pero ofrece algunas características adicionales:

source: You can use ``${...}`` as short-hand for text insertion in pure html effectively making ``tal:content`` and ``tal:attributes`` obsolete.
es: Puede usar ``${...}`` como taquigrafía para inserción de texto en html puro, haciendo que ``tal:content`` y ``tal:attributes`` sean obsoletos.

source: Here are some examples:
es: Aquí tienes algunos ejemplos:

source: Plone 4 and Plone 5:
es: Plone 4 y Plone 5:

source: Plone 5 (and Plone 4 with five.pt) :
es: Plone 5 (y Plone 4 con five.pt) :

source: You can also add pure python into the templates:
es: Usted puede también añadir puro código python dentro de las plantillas:

source: Modify the following template and one by one solve the following problems: :
es: Modifique la siguiente plantilla y resuelva uno a uno los siguientes problemas: :

source: Display the subjects as comma-separated.
es: Muestre los asuntos como separados por comas.

source: Turn the title in a link to the URL of the talk if there is one.
es: Convertir el título en un enlace a la dirección URL de la charla, si hay uno.

source: If there is no URL, turn it into a link to a google search for that talk's title:
es: Si no hay una dirección URL, conviértala en un enlace a una búsqueda en google para el título de esa charla:

source: 4. Add alternating the CSS classes 'odd' and 'even' to the <tr>. (:samp:`repeat.{<name of item in loop>}.odd` is True if the ordinal index of the current iteration is an odd number).
es: 4. Añada alternativamente las clases CSS impar 'odd' y par 'even' al elemento <tr>. (:samp:`repeat.{<nombre del elemento en bucle>}.odd` es True si el índice ordinal de la iteración actual es un número impar 'odd').

source: Use some CSS to test your solution:
es: Use algo de CSS para probar su solución:

source: Only use python expressions.
es: Solamente use expresiones python.

source: Use the new syntax of Plone 5
es: Use la nueva sintaxis de Plone 5

source: Sort the talks alphabetically by title
es: Ordene alfabéticamente los elementos talks por título

source: Do not use this trick in your projects! This level of python-logic belongs in a class, not in a template.
es: ¡No uses este truco en tus proyectos! Este nivel de lógica python pertenece a una clase, no a una plantilla.

source: METAL and macros
es: METAL y macros

source: Why is our output so ugly?
es: ¿Por qué nuestra vista es tan feo?

source: How do we get our HTML to render in Plone the UI?
es: ¿Cómo conseguimos nuestro HTML para representar en la interfaz de usuario - UI de Plone?

source: We use METAL (Macro Extension to TAL) to define slots that we can fill and macros that we can reuse.
es: Utilizamos METAL (Macro Extension to TAL) para definir ranuras que podemos llenar y macros que podemos reutilizar.

source: We add to the ``<html>`` tag::
es: Añadimos a la etiqueta ``<html>``::

source: And then wrap the code we want to put in the content area of Plone in:
es: Y luego envuelva el código que queremos poner en el área de contenido de Plone en:

source: This will put our code in a section defined in the main_template called "content-core".
es: Esto pondrá a nuestro código de una sección definida en el main_template llamado "content-core".

source: The template should now look like below when we exclude the last exercise.
es: La plantilla debería verse ahora a continuación cuando excluyamos el último ejercicio.

source: Here also added the css-class `listing` to the table. It is one of many css-classes used by Plone that you can reuse in your projects:
es: Aquí también se agregó el `listado` clase css a la tabla. Es una de las muchas clases CSS usadas por Plone que puedes reutilizar en tus proyectos:

source: macros in browser views
es: macros en browser views

source: Define a macro in a new file :file:`macros.pt`
es: Define un macro en un nuevo archivo :file:`macros.pt`

source: Register it as a simple BrowserView in zcml:
es: Registrelo como una simple BrowserView en zcml:

source: Reuse the macro in the template :file:`training.pt`:
es: Reuse el macro en la plantilla :file:`training.pt`:

source: Which is the same as:
es: El cual es igual como:

source: Restart your Plone instance from the command line, and then open http://localhost:8080/Plone/@@training to see this macro being used in our @@training browser view template.
es: Reinicie su instancia Plone desde la linea de comando, y entonces abra http://localhost:8080/Plone/@@training para ver este macro para ver esta macro que se utiliza en nuestra plantilla del browser view @@training.

source: Accessing Plone from the template
es: Accediendo a Plone desde la plantilla

source: In our template you have access to:
es: En nuestra plantilla usted tiene acceso a:

source: the **context** object on which your view is called on
es: el objecto **context** en el cual su vista es llamado

source: the **view** itself (and all python methods we'll put in the view later on)
es: la **view** en si mismo (y todos los métodos python que nosotros colocaremos en la vista más adelante)

source: the **request**
es: el **request**

source: With these three we can do almost anything!
es: ¡Con estos tres podemos hacer casi cualquier cosa!

source: In templates we can also access other browser views. Some of those exist to provide easy access to methods we often need::
es: En las plantillas también podemos acceder a otras browser views. Algunos de ellos existen para proporcionar un acceso fácil a los métodos que a menudo necesitamos::

source: The BrowserView :py:class:`plone.app.layout.globals.context.ContextState` holds useful methods having to do with the current context object such as :py:meth:`is_default_page`
es: El BrowserView :py:class:`plone.app.layout.globals.context.ContextState` contiene métodos útiles que tienen que ver con el objeto de contexto actual, como :py:meth:`is_default_page`

source: The BrowserView :py:class:`plone.app.layout.globals.portal.PortalState` holds methods for the portal like :py:meth:`portal_url`
es: El BrowserView :py:class:`plone.app.layout.globals.portal.PortalState` contiene métodos para el portal como :py:meth:`portal_url`

source: The BrowserView :py:class:`plone.app.layout.globals.tools.Tools` gives access to the most important tools like ``plone_tools/catalog``
es: El BrowserView :py:class:`plone.app.layout.globals.tools.Tools` da acceso a las herramientas más importantes como ``plone_tools/catalog``

source: These are very widely used and there are many more.
es: Estos son muy utilizados y hay muchos más.

source: What we missed
es: Lo que echamos de menos

source: There are some things we did not cover so far:
es: Hay algunas cosas que no nos cubrimos hasta el momento:

source: checks if an object or an attribute exists (seldom used)
es: comprueba si existe un objeto o un atributo (rara vez utilizada)

source: to explicitly not call a callable.
es: que explícitamente no llamar a un método llamable.

source: If we refer to content objects, without using the nocall: modifier these objects are unnecessarily rendered in memory as the expression is evaluated.
es: Si nos referimos a objetos de contenido sin usar el modificador nocall: estos objetos son innecesariamente representados en la memoria como la expresión se evaluada.

source: ``i18n:translate`` and ``i18n:domain``
es: ``i18n:translate`` y ``i18n:domain``

source: the strings we put in templates can be translated automatically.
es: las cadenas que ponemos en las plantillas se pueden traducir de forma automática.

source: There is a lot more about TAL, TALES and METAL that we have not covered. You'll only learn it if you keep reading, writing and customizing templates.
es: Hay mucho más acerca de TAL, TALES y METAL que no hemos cubierto. Usted solamente aprenderá si sigues leyendo, escribiendo y personalización de plantillas.

source: Using Zope Page Templates: https://zope.readthedocs.io/en/latest/zope2book/ZPT.html
es: Usando Zope Page Templates: https://zope.readthedocs.io/en/latest/zope2book/ZPT.html

source: Zope Page Templates Reference: https://zope.readthedocs.io/en/latest/zope2book/AppendixC.html
es: Referencia de Zope Page Templates: https://zope.readthedocs.io/en/latest/zope2book/AppendixC.html

source: Customizing Existing Templates
es: Personalizando plantillas existentes

source: Customize existing templates
es: Personalizar plantillas existentes

source: packages (omelette)
es: paquetes (omelette)

source: date-formatting and the moment pattern
es: formato de fecha y el patrón moment

source: listings
es: listados

source: To dive deeper into real Plone data we now look at some existing templates and customize them.
es: Para profundizar en los datos reales de Plone, ahora miramos algunas plantillas existentes y las personalizamos.

source: The view for News Items
es: La vista de Noticias

source: We want to show the date a News Item is published. This way people can see at a glance if they are looking at current or old news.
es: Queremos mostrar la fecha en que se publica un artículo de noticias. De esta manera, las personas pueden ver de un vistazo si están viendo noticias actuales o antiguas.

source: To do this you will first customize the template that is used to render News Items.
es: Para hacer esto, primero deberá personalizar la plantilla que se utiliza para representar los artículos de Noticias.

source: We use :py:mod:`z3c.jbot` for overriding templates. The package already has the necessary configuration in :file:`browser/configure.zcml`.
es: Usamos :py:mod:`z3c.jbot` para anular las plantillas. El paquete ya tiene la configuración necesaria en el archivo :file:`browser/configure.zcml`.

source: Find the file :file:`newsitem.pt` in :file:`packages/plone/app/contenttypes/browser/templates/` (in vagrant this directory is in :file:`/home/vagrant/packages`, otherwise it is in your buildout directory).
es: Encuentre el archivo :file:`newsitem.pt` en la carpeta :file:`packages/plone/app/contenttypes/browser/templates/` (en vagrant este directorio está en :file:`/home/vagrant/packages`, de lo contrario está en su directorio buildout).

source: The file looks like this:
es: El archivo se ve así:

source: Like almost all Plone templates, it uses `metal:use-macro="context/main_template/macros/master"` to use the main_template
es: Al igual que casi todas las plantillas de Plone, utiliza `metal:use-macro="context/main_template/macros/master"` para usar la plantilla main_template

source: This template fills the same slot `content-core` as the template you created in the last chapter. This means the heading and description are displayed by the `main_template`.
es: Esta plantilla llena la misma ranura `content-core` como la plantilla que creó en el último capítulo. Esto significa que el encabezado y la descripción se muestran con el `main_template`.

source: The image and image caption that is provided by the behavior is not part of the template. Instead a Viewlet is used to display it.
es: La leyenda de imagen e imagen proporcionada por el comportamiento no es parte de la plantilla. En su lugar, se usa una Viewlet para mostrarlo.

source: Copy that file into the folder :file:`browser/overrides/` of your package. If you use vagrant you'd have to use
es: Copie ese archivo en la carpeta :file:`browser/overrides/` de su paquete. Si usa vagrant, tendría que usar

source: Rename the new file from :file:`newsitem.pt` to :file:`plone.app.contenttypes.browser.templates.newsitem.pt`. :py:mod:`z3c.jbot` allows you to override templates by putting a file inside a special directory with a *canonical name* (i.e. the path of the file separated by `.` plus the original filename).
es: Cambie el nombre del nuevo archivo de :file:`newsitem.pt` al archivo :file:`plone.app.contenttypes.browser.templates.newsitem.pt`. El módulo :py:mod:`z3c.jbot` le permite anular plantillas colocando un archivo dentro de un directorio especial con un *nombre canónico* (es decir, la ruta del archivo separada por `.` más el nombre del archivo original).

source: Restart Plone
es: Reinicie Plone

source: Now Plone will use the new file to override the original one.
es: Ahora Plone usará el nuevo archivo para anular el original.

source: Edit the new file :file:`plone.app.contenttypes.browser.templates.newsitem.pt` and insert the following before the ``<div id="parent-fieldname-text"``...:
es: Edite el nuevo archivo :file:`plone.app.contenttypes.browser.templates.newsitem.pt` e inserte lo siguiente antes de ``<div id="parent-fieldname-text"``...:

source: Since we use Plone 5 and Chameleon we could also write:
es: Como usamos Plone 5 y Chameleon también podríamos escribir:

source: Open an existing news item in the browser
es: Abra una noticia existente en el navegador

source: This will show something like: ``2015-02-21T12:01:31+01:00``. Not very user-friendly. Let's extend the code and use one of many helpers Plone offers.
es: Esto mostrará algo así como: ``2015-02-21T12:01:31+01:00``. No es muy fácil de usar. Extendamos el código y usemos uno de los muchos ayudantes que Plone ofrece.

source: This will render ``Feb 21, 2015``.
es: Esto hará ``21 de febrero de 2015``.

source: ``plone_view`` is the BrowserView :py:class:`Products.CMFPlone.browser.ploneview.Plone` and it is defined in the ``main_template`` (:file:`Products/CMFPlone/browser/templates/main_template.pt`) of Plone 5 like this ``plone_view context/@@plone;`` and thus always available.
es: ``plone_view`` es BrowserView :py:class:`Products.CMFPlone.browser.ploneview.Plone` y está definido en el ``main_template`` (en el archivo :file:`Products/CMFPlone/browser/templates/main_template.pt`) de Plone 5 como este ``plone_view context/@@plone;`` y por lo tanto siempre disponible.

source: The method :py:meth:`toLocalizedTime` runs a date object through Plone's ``translation_service`` and returns the Date in the current locales format, thus transforming ``2015-02-21T12:01:31+01:00`` to ``Feb 21, 2015``.
es: El método :py:meth:`toLocalizedTime` ejecuta un objeto de fecha a través del ``translation_service`` de Plone y devuelve la fecha en el formato de configuración regional actual, transformando así ``2015-02-21T12:01:31+01:00`` a ``21 de febrero de 2015``.

source: The same in a slightly different style:
es: Lo mismo en un estilo ligeramente diferente:

source: Here we first get the Plone view and then the method :py:meth:`toLocalizedTime` and we use ``nocall`` to prevent the method :py:meth:`toLocalizedTime` from being called, since we want to make it available for later use.
es: Aquí primero obtenemos la vista de Plone y luego el método :py:meth:`toLocalizedTime` y usamos ``nocall`` para evitar que se llame al método :py:meth:`toLocalizedTime`, ya que queremos que esté disponible para uso posterior.

source: We could also leave the formatting to the frontend. Plone 5 comes with the `moment pattern <http://plone.github.io/mockup/dev/#pattern/moment>`_ that uses the library `moment.js <http://plone.github.io/mockup/dev/#pattern/moment>`_ to format dates in the browser with JavaScript.
es: También podríamos dejar el formato en la interfaz. Plone 5 viene con el `patrón moment <http://plone.github.io/mockup/dev/#pattern/moment>`_ que usa la biblioteca `moment.js <http://plone.github.io/mockup/dev/#pattern/moment>`_ para formatear las fechas en el navegador con JavaScript.

source: Try the relative calendar format:
es: Pruebe el formato de calendario relativo:

source: Now we should see the date in a user-friendly format like ``Today at 12:01 PM``.
es: Ahora deberíamos ver la fecha en un formato fácil de usar como ``Hoy a las 12:01 PM``.

source: Experiment with other formats such as ``calendar`` and ``LT``.
es: Experimenta con otros formatos como ``calendar`` y ``LT``.

source: The Summary View
es: La vista Resumen

source: We use the view "Summary View" to list news releases. They should also have the date.
es: Usamos la vista "Vista de resumen" para listar los comunicados de prensa. También deberían tener la fecha.

source: The template associated with that view is :file:`listing_summary.pt`.
es: La plantilla asociada con esa vista es :file:`listing_summary.pt`.

source: Let's look for the template folder_summary_view.pt::
es: Echemos un vistazo a la plantilla folder_summary_view.pt::

source: Note the following:
es: Tenga en cuenta lo siguiente:

source: Unlike :file:`newsitem.pt` the file does not display data from a context but obviously pre-defined variables like `item`, `item_link`, `item_type` or `item_description`.
es: A diferencia del archivo :file:`newsitem.pt`, el archivo no muestra datos de un contexto, pero obviamente variables predefinidas como `item`, `item_link`, `item_type` o `item_description`.

source: It reuses multiple macros of a view `context/@@listing_view`.
es: Reutiliza múltiples macros de una vista `context/@@listing_view`.

source: The variables are most likely defined in the macro `entries` of that view.
es: Es muy probable que las variables se definan en las `entries` de macro de esa vista.

source: Copy it to :file:`browser/overrides/` and rename it to :file:`plone.app.contenttypes.browser.templates.listing_summary.pt`.
es: Cópialo al directorio :file:`browser/overrides/` y cambiarle el nombre a :file:`plone.app.contenttypes.browser.templates.listing_summary.pt`.

source: Add the following after line 28:
es: Añada lo siguiente después de la linea 28:

source: After you restart the instance and look at the new folder again you'll see the dates. :py:mod:`z3c.jbot` needs a restart to pick up the new file. When you only change a existing override you don't have to restart.
es: Después de reiniciar la instancia y mirar nuevamente la nueva carpeta, verá las fechas. :py:mod:`z3c.jbot` necesita un reinicio para recoger el nuevo archivo. Cuando solo cambia una sobreescritura existente, no tiene que reiniciar.

source: The addition renders the date of the respective objects that the template iterates over (hence ``item`` instead of ``context`` since ``context`` would be either a collection aggregating the news items or a folder containing a news item).
es: La adición representa la fecha de los respectivos objetos sobre los que itera la plantilla (de ahí ``item`` en lugar de ``context`` ya que ``context`` sería una colección que añada las noticias o una carpeta que contiene una noticia).

source: The date is only displayed if the variable ``item_type`` is ``News Item``.
es: La fecha solo se muestra si la variable ``item_type`` es ``News Item``.

source: Let's take a closer look at that template. How does it know that ``item_type`` is the name of the content type?
es: Echemos un vistazo más de cerca a esa plantilla. ¿Cómo sabe que ``item_type`` es el nombre del tipo de contenido?

source: The first step to uncovering that secret is line 14 of :file:`listing_summary.pt`:
es: El primer paso para descubrir ese secreto es la línea 14 del archivo :file:`listing_summary.pt`:

source: ``use-macro`` tells Plone to reuse the macro ``entries`` from the view ``listing_view``. That view is defined in :file:`packages/plone/app/contenttypes/browser/configure.zcml`.
es: ``use-macro`` le dice a Plone que reutilice la macro ``entries`` desde la vista ``listing_view``. Esa vista se define en el archivo :file:`packages/plone/app/contenttypes/browser/configure.zcml`.

source: It uses the template :file:`plone/app/contenttypes/browser/templates/listing.pt`. That makes overriding that much easier.
es: Utiliza la plantilla :file:`plone/app/contenttypes/browser/templates/listing.pt`. Eso hace que sobreescribir eso sea mucho más fácil.

source: That template :file:`listing.pt` defines the slot ``entries`` like this:
es: Es archivo de plantilla :file:`listing.pt` define la ranura ``entries`` como esta:

source: Here the ``item_type`` is defined as ``item_type item/PortalType``. Let's dig a little deeper and find out what ``item`` and ``PortalType`` are.
es: Aquí el ``item_type`` es definida como ``item_type item/PortalType``. Profundicemos un poco más y descubramos qué son ``item`` y ``PortalType``.

source: ``tal:repeat="item batch"`` tells the template to iterate over an iterable ``batch`` which is defined as ``batch view/batch``.
es: ``tal:repeat="item batch"`` le dice a la plantilla que itere sobre un iterable ``batch`` que se define como ``batch view/batch``.
