Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: As with working-copy support, Placeful Workflow ships with Plone but needs to be activated via the add-on configuration page. Once it's added, a :guilabel:`Policy` option will appear on the state menu to allow setting a placeful workflow policy.
es: Al igual que con la compatibilidad de copia de trabajo, Flujo de trabajo Placeful se incorpora con Plone pero debe activarse a través de la página de configuración de complementos. Una vez que se añada, una opción :guilabel:`Política` aparecerá en el menú de estado para permitir establecer una política de flujo de trabajo placeful.

source: Creating a Dynamic Front Page
es: Creando una Página de Inicio Dinámica

source: In this chapter we will:
es: En este capítulo vamos a:

source: Create a standalone view used for the front page
es: Crear una vista independiente utilizada para la página principal

source: Show dynamic content
es: Mostrar contenido dinámico

source: Use ajax to load content
es: Usar tecnicas de ajax para cargar contenido

source: Embed tweets about ploneconf
es: Embeber tweets acerca de la ploneconf

source: Standalone views
es: Vistas standalone

source: Querying the catalog by date
es: Consultar al catálogo por fecha

source: DRY
es: Don't Repeat Yourself (DRY)

source: patterns
es: patrones

source: The Front Page
es: La Página de Inicio

source: Register the view in ``browser/configure.zcml``:
es: Registrar el view en el archivo ``browser/configure.zcml``:

source: Add the view to a file ``browser/frontpage.py``. We want a list of all talks that happen today.
es: Añadir la vista al archivo ``browser/frontpage.py``. Nosotros queremos una lista de todas las talks que sucederán hoy.

source: We do not constrain the search to a certain folder to also find the party and the sprints.
es: No restringimos la búsqueda a una determinada carpeta para encontrar también la fiesta y los sprints.

source: With ``if brain.start.date() == today:`` we test if the talk is today.
es: Con ``if brain.start.date() == today:`` nosotros probamos si la talk es hoy.

source: It would be more effective to query the catalog for events that happen in the daterange between today and tomorrow:
es: Eso podría ser más eficiente al consultar el catalog por eventos que sucederán en el rango de fecha entre hoy y mañana:

source: The ``sort_on='start'`` sorts the results returned by the catalog by start-date.
es: El ``sort_on='start'`` ordena los resultados devueltos por el catálogo por fecha de inicio.

source: By removing the ``portal_type='talk'`` from the query you could include other events in the schedule (like the party or sightseeing-tours). But you'd have to take care to not create AttributeErrors by accessing fields that are specific to talk. To work around that use ``speaker = getattr(brain, 'speaker', None)`` and testing with ``if speaker is not None:``
es: Al eliminar ``portal_type='talk'`` de la consulta, puede incluir otros eventos en el programa (como la fiesta o visitas guiadas). Pero debe tener cuidado de no crear AttributeErrors accediendo a campos que son específicos para talk. Para evitarlo, use ``speaker = getattr(brain, 'speaker', None)`` y pruebe con ``if speaker is not None:``

source: The rest is identical to what the talklistview does.
es: El resto es identico a que lo que la vista talklistview hace.

source: The template
es: La plantilla

source: Create the template ``browser/templates/frontpageview.pt`` (for now without talks). Display the rich text field to allow the frontpage to be edited.
es: Crear la plantilla ``browser/templates/frontpageview.pt`` (por ahora sin talks). Muestre el campo de texto enriquecido para permitir que se edite la página principal.

source: Now you could add the whole code that we used for the talklistview again. But instead we go D.R.Y. and reuse the talklistview by turning it into a macro.
es: Ahora podría añadir todo el código que usamos para la vista talklistview nuevamente. Pero en su lugar vamos D.R.Y. y reutilizar la vista talklistview convirtiéndola en una macro.

source: Edit ``browser/templates/talkslistview.pt`` and wrap the list in a macro definition:
es: Edite la plantilla ``browser/templates/talkslistview.pt`` y envolver la lista en una definición macro:

source: Now use that macro in ``browser/templates/frontpageview.pt``
es: Ahora use ese macro en la plantilla ``browser/templates/frontpageview.pt``

source: Calling that macro in python looks like this ``metal:use-macro="python: context.restrictedTraverse('talklistview')['talklist']"``
es: Llamando ese macro en python luciría como este``metal:use-macro="python: context.restrictedTraverse('talklistview')['talklist']"``

source: In :file:`talklistview.pt` the call :samp:`view/talks"` calls the method :py:meth:`talks` from the browser view :py:class:`TalkListView` to get the talks. Reused as a macro on the frontpage it now uses the method :py:meth:`talks` by the ``frontpageView`` to get a different list! It is not always smart to do that since you might want to display other data. E.g. for a list of todays talks you don't want show the date but only the time using ``data-pat-moment="format:LT"`` Also this frontpage will probably not win a beauty-contest. But that's not the task of this training.
es: En el archivo :file:`talklistview.pt` la llamada :samp:`view/talks"` llama al método :py:meth:`talks` desde la browser view :py:class:`TalkListView` para obtener los elementos talks. Reutilizado como una macro en la página de inicio ahora usa el método :py:meth:`talks` por la ``frontpageView`` asi ¡obtener una lista diferente! no siempre es inteligente hacerlo ya que es posible que desee mostrar otros datos. Por ejemplo, una lista de las talks de hoy no quiere mostrar la fecha, pero solo la hora usando el formato ``data-pat-moment="format:LT"`` También esta página probablemente no gane un concurso de belleza. Pero esa no es la tarea de este entrenamiento.

source: Change the link to open the talk-info in a `modal <https://plone.github.io/mockup/dev/#pattern/modal>`_.
es: Cambiar el enlace al abrir la información de una talk en una `ventana modal <https://plone.github.io/mockup/dev/#pattern/modal>`_.

source: You might also want to embed a twitter feed into the page. Luckily twitter makes it easy to do that. When you browse to the `twitter docs <https://dev.twitter.com/web/embedded-timelines/search>`_ and learn how to create the appropriate snippet of code and paste it in the template wrapped in a ``<div class="col-lg-6">...</div>`` to have the talklist next to the feeds:
es: Es posible que también desee insertar un feed de Twitter en la página. Afortunadamente, Twitter hace que sea fácil hacer eso. Cuando usted navega la `documentación de twitter <https://dev.twitter.com/web/embedded-timelines/search>`_ y allí aprenderá a crear el fragmento de código apropiado y péguelo en la plantilla envuelta en ``<div class="col-lg-6">...</div>`` para tener la lista de conversación junto a los feeds:

source: Activating the view
es: Activando la vista

source: The view is meant to be used with documents (or any other type that has a rich text field 'text'). The easiest way to use it is setting it as the default view for the Document that is currently the default page for the portal. By default that document has the id ``front-page``.
es: La vista está destinada a ser utilizada con documentos (o cualquier otro tipo que tenga un campo de texto enriquecido 'texto'). La forma más fácil de usarlo es configurarlo como la vista por defecto para el documento que actualmente es la página por defecto para el portal. Por defecto, ese documento tiene el id ``front-page``.

source: You can either access it directly at http://localhost:8080/Plone/front-page or by disabling the default page for the portal and it should show up in the navigation. Try out the new view like this: http://localhost:8080/Plone/front-page/frontpageview.
es: Puede acceder directamente a http://localhost:8080/Plone/front-page o deshabilitar la página por defecto para el portal y debe aparecer en la navegación. Pruebe la nueva vista de esta manera: http://localhost:8080/Plone/front-page/frontpageview.

source: To set that view by hand as the default view for ``front-page`` in the ZMI: http://localhost:8080/Plone/front-page/manage_propertiesForm. Add a new property ``layout`` and set it to ``frontpageview``.
es: Para establecer esa vista a mano como la vista por defecto para ``front-page`` en la ZMI: http://localhost:8080/Plone/front-page/manage_propertiesForm. Añada una nueva propiedad ``layout`` y configúrela como ``frontpageview``.

source: Done. This way you can still use the button *Edit* to edit the frontpage.
es: Hecho. Esta forma usted puede aun usar el botón *Editar* para editar la página de inicio.

source: Querying by date: https://docs.plone.org/develop/plone/searching_and_indexing/query.html#querying-by-date
es: Consultando por fecha: https://docs.plone.org/develop/plone/searching_and_indexing/query.html#querying-by-date

source: The Future of Plone
es: El futuro de Plone

source: The Plone process, the various teams and the Plone Community
es: El proceso de Plone, los diversos equipos y la Comunidad Plone

source: Plone 7 and beyond...
es: Plone 7 y más allá...

source: Plone Roadmap: https://plone.org/roadmap
es: Mapa de ruta de Plone: https://plone.org/roadmap

source: Grok is an alternative declaration language for declaring your components. It is compatible with the Zope Component Architecture, it used just an alternative syntax. It is recommended to not use it! We still document it here in case you have to deal with a legacy-codebase that uses it.
es: Grok es un lenguaje alternativo de declaración para declarar sus componentes. Eso es compatible con la Arquitectura de Componentes Zope, eso es usado justo una sintaxis alternativa. Es recomendado a no usarlo! Todavía lo documentamos aquí en caso de que tenga que tratar con una base de código heredada que lo usa.

source: Instead of writing separate zcml files, you annotate your code and you create content conforming to specific file names so that they are automatically found. There has been discussions whether grok should be used in the plone core. The plone community decided against it, because it increases the technology stack without adding functionality.
es: En lugar de escribir archivos zcml separados, usted anota su código fuente y cree contenido conforme a nombres de archivo específicos para que se encuentren automáticamente. Ha habido discusiones si grok se debe utilizar en el núcleo del plone. La comunidad plone decidió en contra, porque aumenta la pila de tecnología sin añadir funcionalidad.

source: Some people are even against using it in Add Ons, because there would not be just one way to declare components, but two. Then there is only last disadvantage, grok components cannot be overridden by z3c.jbot. I would not be surprised if this could be fixed though.
es: Algunas personas incluso están en contra de usarlo en Complementos, porque no habría una sola forma de declarar componentes, sino dos. Entonces solo existe la última desventaja, los componentes de grok no pueden ser anulados por z3c.jbot. No me sorprendería si esto pudiera arreglarse.

source: After all these negative things let us tell you why we still like it: We like to write as few lines of code and configuration as possible.
es: Después de todas estas cosas negativas vamos a decirle por qué todavía nos gusta: Nos gusta escribir como pocas líneas de código y configuración como sea posible.

source: So, we will write our browser view as a grok view. From the component architecture side, nothing changes. We still need to write a multi adapter. All the details like which template to use or for which browser layer the view shall be used is declared with a single line annotation or deduced from file names.
es: Por lo tanto, vamos a escribir nuestra browser view como una vista grok. Desde el lado de la arquitectura de componentes, nada cambia. Todavía tenemos que escribir un adaptador múltiple. Todos los detalles como la plantilla a utilizar o para qué browser layer se utilizará la vista se declarará con una sola anotación de línea o se deducirá de los nombres de archivo.

source: Grok is not part of plone. We have to add it as a dependency to our egg.
es: Grok no es parte de plone. Tenemos que añadirlo como una dependencia de nuestro paquete egg.

source: Open :file:`setup.py`, and add :py:mod:`five.grok` to the list of add-ons in ``install_requires``::
es: Abra el archivo :file:`setup.py`, y añada :py:mod:`five.grok` a la lista de complemento en ``install_requires``::

source: You need to run buildout now.
es: Usted necesita ejecutar buildout ahora.

source: Grok nearly magically does find all its annotations. Since its not complete magic, you have to tell grok where to look for grok code. This requires a single line of ZCML. This line ensures that your complete package is `grokked`.
es: Grok casi mágicamente encuentra todas sus annotations. Como no es magia completa, debes decirle a grok dónde buscar el código grok. Esto requiere una sola línea de ZCML. Esta línea asegura que su paquete completo está `grokked`.

source: This new grok statement takes care of finding everything grok-related.
es: Esta nueva declaración de grok se ocupa de encontrar todo lo relacionado con grok.

source: Now we can add a grok view in a new file :file:`views.py`:
es: Ahora nosotros podemos añadir una vista grok en un nuevo archivo :file:`views.py`:

source: By convention the template must be in a subdirectory called :file:`views_templates` and it must be named :file:`talkview.pt`
es: Por convención, la plantilla debe estar en un sub-directorio llamado :file:`views_templates` y debe tener el nombre :file:`talkview.pt`

source: If we used ``grok`` for viewlets we would not need to register them in the :file:`configure.zcml` but do that in python. We would add a file :file:`viewlets.py` containing the viewlet-class.
es: Si utilizáramos ``grok`` para viewlets, no necesitaríamos registrarlos en el archivo :file:`configure.zcml`, pero haremos eso en python. Añadiriamos un archivo :file:`viewlets.py` que contiene la clase viewlet.

source: This would do the same as the code above using grok's paradigm of convention over configuration. In browser views the reference is called view; note that in grok viewlets it is called viewlets (in that case ``viewlet/lanyrd_link``).
es: Esto haría lo mismo que el código anterior utilizando el paradigma de convención de grok sobre la configuración. En las browser views, la referencia se llama view; tenga en cuenta que en viewlets grok se llama viewlets (en ese caso ``viewlet/lanyrd_link``).

source: IDEs and Editors
es: IDEs y Editores

source: Learn about Editors
es: Aprenda acerca los Editores

source: Many editors
es: Muchos editores

source: Plone consists of more than 20.000 files! You need a tool to manage that. No development environment is complete without a good editor.
es: ¡Plone consiste de más de 20.000 archivos! Usted necesita una herramienta para administrarlas. Ningún entorno de desarrollo esta completo sin un buen editor.

source: People pick editors themselves. Use whatever you are comfortable and productive with. Here are some of the most used editors in the Plone community:
es: La gente elige sus propios editores. Utilice cualquiera con el que se sienta cómodo y productivo. Estos son los editores más utilizados en la comunidad Plone:

source: `PyDev <http://www.pydev.org/>`_ for `Eclipse <http://www.eclipse.org/>`_
es: `PyDev <http://www.pydev.org/>`_ para `Eclipse <http://www.eclipse.org/>`_

source: Some features that most editors have in one form or another are essential when developing with Plone.
es: Algunas características que la mayoría de los editores tienen de una forma u otra son esenciales desarrollando en Plone.

source: **Find in project** (SublimeText 3: ``cmd + shift + f``)
es: **Buscar en Proyecto** (SublimeText 3: ``cmd + shift + f``)

source: **Find files in Project** (SublimeText 3: ``cmd + t``)
es: **Buscar archivos en Proyecto** (SublimeText 3: ``cmd + t``)

source: **Find methods and classes in Project** (SublimeText 3: ``cmd + shift + r``)
es: **Buscar clases y métodos en Proyecto** (SublimeText 3: ``cmd + shift + r``)

source: **Goto Definition** (SublimeText3 with codeintel: ``alt + click``)
es: **Valla a Definición** (SublimeText3 con codeintel: ``alt + click``)

source: **Powerful search & replace**
es: **Poderoso mecanismo de búsqueda y remplazo**

source: The capability of performing a *full text search* through the complete Plone code is invaluable. Thanks to omelette, an SSD and plenty of RAM you can search through the complete Plone code base in 3 seconds.
es: La capacidad de realizar una *búsqueda de texto completo* a través del código completo de Plone es invaluable. Gracias al receta omelette, un disco de estado solido (SSD) y mucha RAM, puede buscar a través de la base de código completo de Plone en 3 segundos.

source: Some Editors/IDE's have to be extend to be fully featured. Here are some packages we recommend when using Sublime Text 3:
es: Algunos Editores/IDE tienen que ser extendidos para ser completamente presentados. Aquí hay algunos paquetes que recomendamos al usar Sublime Text 3:

source: SublimeCodeIntel (Goto Definition)
es: SublimeCodeIntel (Valla a Definición)

source: SublimeLinter with SublimeLinter-flake8 ...
es: SublimeLinter con SublimeLinter-flake8 ...

source: INI (syntax for ini-Files)
es: INI (sintaxis para archivos ini)

source: Mastering Plone Development
es: Maestría en el Desarrollo Plone

source: This is the documentation for the "Mastering Plone" training.
es: Esta es la documentación del entrenamiento "Maestría en Plone 5".

source: Mastering Plone is intended as a week-long training for people who are new to Plone or want to learn about the current best practices of Plone development. It can be split in two trainings:
es: Maestría en el Desarrollo Plone esta pensando como un entrenamiento de una semana larga para personas quienes son nuevas en Plone o quieren aprender acerca de las mejores prácticas actuales del desarrollo Plone. Esto puede ser dividido en dos entrenamientos:

source: A beginner training (2 to 3 days) that covers chapters 1-18.
es: Un entrenamiento para principiante (2 a 3 días), que cubre los capítulos 1 al 18.

source: An advanced training (3 to 5 days) that covers the rest.
es: Un entrenamiento avanzado (3 a 5 días), que cubre el resto de capítulos.

source: At conferences a shortened 2-day version of the advanced training with a slightly modified order is held.
es: En las conferencias se lleva a cabo una versión abreviada de 2 días del entrenamiento avanzado con una orden ligeramente modificada.

source: Mastering Plone
es: Maestría en Plone

source: Please note that this document is *not complete* without the spoken word of a trainer.
es: Por favor, note que este documento no *esta completo* sin las palabras del instructor.

source: Even though we attempt to include the most important parts of what we teach in the narrative but reading it here can in no way be considered equal to attending a training.
es: Aunque intentamos incluir las partes más importantes de lo que enseñamos en la narrativa, leerla aquí no puede considerarse en modo alguno igual a asistir a un entrenamiento.

source: Installation & Setup
es: Instalación y configuración

source: Installing Plone
es: Instalando Plone

source: The following table shows the Python versions required by Plone from version 3.x to 5.1.x:
es: La siguiente tabla muestra las versiones Python requeridas por Plone desde la versión 3.x a la 5.1.x:

source: 2.6 or 2.7
es: 2.6 o 2.7

source: (Hopefully you won't have to deal with any Plone sites older than version 4.3.x)
es: (Esperamos que no tenga que lidiar con ningún sitio Plone anterior a la versión 4.3.x)

source: Plone 5.x requires a working Python 2.7 and other system tools that not every OS provides. The installation of Plone is different on every system. Here are some ways that Python can be used:
es: Plone 5.x requiere un Python 2.7 y herramientas de sistema que no son proveídas en cada sistema operativo. La instalación de Plone es diferente en cada sistema. Aquí algunas formas que Python puede ser usado:

source: Plone 4.3.x and Plone 5.x require a working Python 2.7 and other tools.
es: Plone 4.3.x y Plone 5.x requiere un Python 2.7 y otras herramientas.

source: Installation is different on every system.
es: Instalación es diferente en cada sistema.

source: use a Python that comes pre-installed in your operating system (most Linux Distributions and macOS have one)
es: use el Python que viene previamente instalado en su sistema operativo (la mayoría de las distribuciones de Linux y macOS tiene uno)

source: use the `python buildout <https://github.com/collective/buildout.python>`_
es: use el `buildout python <https://github.com/collective/buildout.python>`_

source: building Linux packages
es: instale los paquetes construido en su sabor de Linux

source: macOS 10.8 - 10.11 and Ubuntu 14.04 come with a working default Python 2.7 built in. These are the lucky ones.
es: macOS X 10.8 - 10.11 y Ubuntu 14.04 viene con un Python 2.7 construido por defecto en funcionamiento. Estos son los afortunados.

source: Most developers use their primary system to develop Plone. For complex setups they often use Linux virtual machines.
es: La mayoría de los desarrolladores suelen utilizar su sistema primario para desarrollar Plone. Para configuraciones complejas que a menudo usan máquinas virtuales en Linux.

source: macOS: Use the system python and `Homebrew <https://brew.sh>`_ for some missing Linux tools.
es: macOS: Use el python del sistema y la herramienta `Homebrew <https://brew.sh>`_ para instalar algunas herramientas Linux que faltan.

source: Linux: Depending on your Linux flavor you might have to build python yourself and install some tools.
es: Linux: Dependiendo de su sabor de Linux que usted podría tener que construir Python por ti mismo e instalar algunas herramientas.

source: Windows: Alan Runyan (one of Plone's founders) uses it. A downside: Plone seems to be running slower on Windows.
es: Windows: Alan Runyan (uno de los fundadores Plone) lo utiliza. Un inconveniente: Plone parece funcionar mucho más lento en Windows.

source: Plone offers multiple options for being installed:
es: Plone ofrece múltiples opciones para que se instale:

source: Unified installers (all 'nix, including macOS)
es: Unified installers (Todos los sistemas operativos 'nix, incluyendo macOS)

source: A Vagrant/VirtualBox install kit (all platforms)
es: Un kit de instalación Vagrant/VirtualBox (todas las plataformas)

source: A VirtualBox Appliance
es: Un VirtualBox Appliance

source: Use your own Buildout
es: Utilice su propio Buildout

source: Visit the `download page <https://plone.org/download>`_ to see all the options.
es: Visite la `página de descarga <https://plone.org/download>`_ para ver todas las opciones.

source: For the training we will use option 2 and 4 to install and run Plone. We will create our own Buildout and extend it as we wish. We will do so in a Vagrant machine.
es: Para el entrenamiento usaremos la opción 2 y 4 para instalar y ejecutar Plone. Crearemos nuestro propio Buildout y es extendido a como lo deseemos. Haremos eso en una maquina Vagrant.

source: For your own first experiments we recommend option 1 or 2 (if you have a Windows laptop or encounter problems). Later on you should be able to use your own Buildout (we will cover that later on).
es: Para sus primeros experimentos, recomendamos la opción 1 o 2 (si tiene una computadora portátil con Windows o tiene problemas). Más adelante, debería poder usar su propio Buildout (lo trataremos más adelante).
