Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: As you can see, we created two permissions, one for voting, one for viewing the votes.
es: Como puede ver, creamos dos permisos, uno para votar, y otro para ver los votos.

source: If a user is not allowed to see the votes, she does not need access to the vote viewlet.
es: Si un usuario no puede ver los votos, no necesita acceder al viewlet de votos.

source: While we are at it, if a user can't vote, she needs no access to the helper view to actually submit a vote.
es: Mientras estamos en ello, si un usuario no puede votar, no necesita acceso a la vista helper para actualmente para enviar un voto.

source: We can add this restriction to :file:`browser/configure.zcml`
es: Podemos añadir esta restricción al archivo :file:`browser/configure.zcml`

source: We are configuring components, so we use the component name of the permission, which is the :samp:`id` part of the declaration we added earlier.
es: Estamos configurando componentes, por lo que usamos el nombre de componente del permiso, que es el :samp:`id` parte de la declaración que añadimos anteriormente.

source: So, what happens if we do not protect the browser view to vote?
es: Entonces, ¿qué sucede si no protegemos la browser view para votar?

source: The person could still vote, by handcrafting the URL. Browser Views run code without any restriction, it is your job to take care of security.
es: La persona podría votar, mediante la elaboración manual de la URL. Las Browser Views ejecutar código sin ninguna restricción, es su trabajo para cuidar de la seguridad.

source: But... if a person has no access to the object at all, maybe because the site is configured that Anonymous users cannot access private objects, the unauthorized users will not be able to submit a vote.
es: Pero... si una persona no tiene acceso al objeto en absoluto, tal vez porque el sitio está configurado para que los usuarios anónimos no puedan acceder a objetos privados, los usuarios no autorizados no podrán enviar un voto.

source: That is because Zope checks security permissions when trying to find the right object. If it can't find the object due to security constraints not met, no view ill ever be called, because that would have been the next step.
es: Eso es porque Zope verifica los permisos de seguridad cuando intenta encontrar el objeto correcto. Si no puede encontrar el objeto debido a restricciones de seguridad no cumplidas, no se llamará a ninguna vista, porque ese hubiera sido el siguiente paso.

source: We now protect our views and viewlets. We still show the option to vote though.
es: Ahora protegemos nuestras vistas y viewlets. Todavía mostramos la opción de votar.

source: We must add a condition in our page template, and we must provide the condition information in our viewlet class.
es: Debemos añadir una condición en nuestra plantilla de página, y debemos proporcionar la información de la condición en nuestra clase viewlet.

source: Lets move on to :file:`browser/viewlets.py`
es: Mueva al archivo :file:`browser/viewlets.py`

source: And the template in :file:`browser/templates/voting_viewlet.pt`
es: Y la plantilla en el archivo :file:`browser/templates/voting_viewlet.pt`

source: Sometimes subtle bugs come up because of changes. In this case I noticed that I should only prompt people to vote if they are allowed to vote!
es: A veces surgen errores sutiles debido a los cambios. ¡En este caso noté que solo debería pedirle a la gente que vote si se les permite votar!

source: Provide defaults
es: Proporcionar valores por defecto

source: Are we done yet? Who may vote now?
es: ¿Ya terminamos? ¿Quién puede votar ahora?

source: We have to tell that someone.
es: Tenemos que decirle a alguien.

source: Who has which permissions is managed in Zope. This is persistent, and persistent configuration is handled by GenericSetup.
es: Quién tiene cuales permisos se gestiona en Zope. Esto es persistente y la configuración persistente es manejada por GenericSetup.

source: The persistent configuration is managed in another file: :file:`profiles/default/rolemap.xml`
es: La configuración persistente es administrada en otro archivo: :file:`profiles/default/rolemap.xml`

source: Testing in Plone
es: Pruebas en Plone

source: In this chapter we:
es: En este capítulo vamos a:

source: Write tests
es: Escribir pruebas

source: Testing best practices
es: Buenas practicas de pruebas

source: Internals of Plone
es: Entrañas de Plone

source: Types of tests
es: Tipos de pruebas

source: Unit tests
es: Pruebas unitareas

source: Integration tests
es: Pruebas de integración

source: Functional tests
es: Pruebas funcionales

source: Acceptance tests
es: Pruebas de aceptación

source: Javascript tests
es: Pruebas de Javascript

source: Plone is using some common terminology for types of tests you might have heard elsewhere. But in Plone, these terms are usually used to differentiate the technical difference between the types of test.
es: Plone está utilizando una terminología común para los tipos de pruebas que podría haber escuchado en otros lugares. Pero en Plone, estos términos se usan generalmente para diferenciar la diferencia técnica entre los tipos de prueba.

source: These match the normal meaning the most. Unit tests test a unit in isolation. That means there is no database, no component architecture and no browser. This means the code is very fast and it can mean that you can't test all that much if your code mostly interacts with other components.
es: Estos coinciden con el significado normal más. Las pruebas unitarias prueban una unidad aisladamente. Eso significa que no hay base de datos, arquitectura de componentes ni navegador. Esto significa que el código es muy rápido y puede significar que no puede probar tanto si su código interactúa mayormente con otros componentes.

source: A unit test for a browser view would create an instance of the view directly. That means it is your responsibility to provide a proper context and a proper request. You can't really test user-dependent behavior because you just mock a Request object imitating a user or not. This code might be broken with the next version of Plone without the test failing.
es: Una prueba de unidad para una browser view crearía una instancia de la vista directamente. Eso significa que es su responsabilidad proporcionar un contexto adecuado y una solicitud adecuada. Realmente no se puede probar el comportamiento dependiente del usuario porque solo se burla de un objeto Request que imita a un usuario o no. Este código podría romperse con la próxima versión de Plone sin que la prueba falle.

source: On the other hand, testing a complex rule with many different outcomes is still best tested in a unit test, because they are very fast.
es: Por otro lado, probar una regla compleja con muchos resultados diferentes todavía se prueba mejor en una prueba unitaria, porque son muy rápidos.

source: Integration tests in Plone mean you have a real database and your component architecture. You can identify an integration test by the layer it is using which is based on a layer with integration in its name. We will explain shortly what a layer is.
es: Las pruebas de integración en Plone significan que tiene una base de datos real y su arquitectura de componente. Puede identificar una prueba de integración por la capa que está utilizando, que se basa en una capa con integración en su nombre. Explicaremos brevemente qué es una capa.

source: Integration tests also means your test is still quite fast, because the transaction mechanisms are used for test isolation. What does that mean? After each test, the transaction gets canceled and you have the database in the same state as before. It still takes a while to set up the test layer, but running each test is quite fast. But this also means you cannot commit a transaction. Most code does not commit transactions and this is not an issue.
es: Las pruebas de integración también significan que su prueba todavía es bastante rápida, porque los mecanismos de transacción se utilizan para el aislamiento de la prueba. ¿Qué significa eso? Después de cada prueba, la transacción se cancela y usted tiene la base de datos en el mismo estado que antes. Todavía lleva un tiempo configurar la capa de prueba, pero ejecutar cada prueba es bastante rápido. Pero esto también significa que no puedes comprometer una transacción. La mayoría del código no hace commit a las transacciones y esto no es un problema.

source: Functional tests in Plone have a real database and a component architecture, like Integration tests. In addition, you can simulate a browser in python code. When this browser tries to access a page, the complete transaction machinery is in use. For this to work, the test layer wraps the database into a demostorage. A Demostorage is for demonstration. A demostorage wraps a regular storage. When something gets written into the database, the demostorage stores it into memory or temporary fields. On reading it either returns what has been saved in memory or what is in the underlaying storage. After each test, the demostorage is wiped. This should make it nearly as fast as integration tests, but there is an additional overhead, when requests get through the transaction machinery. Also, the browser is pure python code. It knows nothing about javascript. You cannot test your javascript code with functional tests
es: Las pruebas funcionales en Plone tienen una base de datos real y una arquitectura de componentes, como las pruebas de integración. Además, puedes simular un navegador en código python. Cuando este navegador intenta acceder a una página, la maquinaria de transacción completa está en uso. Para que esto funcione, la capa de prueba envuelve la base de datos en una demostración. Un Demostorage es para demostración. Una demostración almacena un almacenamiento regular. Cuando algo se escribe en la base de datos, el demostorage lo almacena en la memoria o campos temporales. Al leer, devuelve lo que se ha guardado en la memoria o lo que está en el almacenamiento subyacente. Después de cada prueba, el demostorage se borra. Esto debería hacerlo casi tan rápido como las pruebas de integración, pero hay una sobrecarga adicional, cuando las solicitudes pasan por el mecanismo de transacción. Además, el navegador es puro código python. No sabe nada sobre javascript. No puedes probar tu código de JavaScript con pruebas funcionales

source: Acceptance tests are usually tests that can assert that an application would pass the requirements the customer gave. This implies that acceptance tests test the complete functionality and that they either allow the customer to understand what is being tested or at least clearly map to business requirements. In Plone, acceptance tests are tests written with the so called robot framework. Here you write tests in something resembling a natural language and which is driven by a real web browser. This implies you can also test Javascript. This is the slowest form of testing but also the most complete. Also, acceptance tests aren't limited to the original form of acceptance tests, but also for normal integration tests.
es: Las pruebas de aceptación generalmente son pruebas que pueden afirmar que una aplicación pasará los requisitos que el cliente le dio. Esto implica que las pruebas de aceptación prueban la funcionalidad completa y que permiten que el cliente comprenda lo que se está probando o, al menos, se relacione claramente con los requisitos del negocio. En Plone, las pruebas de aceptación son pruebas escritas con el llamado robot framework. Aquí puede escribir pruebas en un lenguaje similar al natural y que está dirigido por un navegador web real. Esto implica que también puedes probar Javascript. Esta es la forma de prueba más lenta pero también la más completa. Además, las pruebas de aceptación no se limitan a la forma original de las pruebas de aceptación, sino también a las pruebas de integración normales.

source: So far, it looks like we only have acceptance tests for testing javascript. Acceptance tests are also very new. This means we had no test story for testing javascript. In Plone 5, we have the mockup framework to write javascript components and the mockup framework provides also scaffolding for testing Javascript with xxx. While these tests use a real browser of some sort, they fall into the category of unit tests, because you have no database Server available to generate proper html.
es: Hasta el momento, parece que solo tenemos pruebas de aceptación para probar javascript. Las pruebas de aceptación también son muy nuevas. Esto significa que no teníamos una historia de prueba para probar javascript. En Plone 5, tenemos el framework mockup para escribir componentes de JavaScript y el framework mockup también proporciona scaffolding para probar Javascript con xxx. Si bien estas pruebas utilizan un navegador real de algún tipo, entran en la categoría de pruebas unitarias, porque no tiene un Servidor de base de datos disponible para generar html apropiado.

source: Doctests are a popular way to write tests in documentation. Doctests parse documentation for code that has special formatting and runs the code and compares it with the output suggested in the documentation. Doctests are hard to debug, because there is no easy way to use a debugger in doctests. Doctests have a bad reputation, because when it came around, people thought they could write documentation and tests in one go. This resulted in packages like zope.component, where the documentation on pypi slowly transforms into half sentences split up by 5-10 lines of code testing an obscure feature that the half sentence does not properly explain. In Plone, this form of testing is not very common. We would like to transform our documentation to be testable with doctests.
es: Los Doctests son una forma popular de escribir pruebas en la documentación. Doctests analiza la documentación del código que tiene un formato especial y ejecuta el código y lo compara con el resultado sugerido en la documentación. Los Doctests son difíciles de depurar, porque no hay una manera fácil de usar un depurador en doctests. Los Doctest tienen una mala reputación, porque cuando aparecía, la gente pensaba que podían escribir documentos y pruebas de una vez. Esto dio como resultado paquetes como zope.component, donde la documentación sobre pypi se transforma lentamente en frases a la mitad divididas por 5-10 líneas de código que prueban una característica oscura que la mitad de la oración no explica adecuadamente. En Plone, esta forma de prueba no es muy común. Nos gustaría transformar nuestra documentación para que sea comprobable con doctests.

source: Writing tests
es: Escribiendo pruebas

source: Testing is hard
es: Las pruebas son rudas

source: Slow tests kill testing
es: Pruebas lentas matan las pruebas

source: It is ok to rewrite code for better testability
es: Está bien reescribir el código para una mejor comprobabilidad

source: Steal from others
es: Robar de los demás

source: All rules and best practices have exceptions
es: Todas las reglas y mejores prácticas tienen excepciones

source: Writing tests is an art. If your testsuite needs half an hour to run, it loses a lot of value. If you limit yourself to unit tests and fake everything, you miss many bugs, either because Plone works differently than what you thought, or the next Plone versions run differently from today's. On the other hand, integration tests are not only slower, but often create test failures far away from the actual error in the code. Not only do the tests run more slowly, it also takes longer to debug why they fail. Here are some good rules to take into account.
es: Escribir pruebas es un arte. Si su equipo de pruebas necesita media hora para ejecutarse, pierde mucho valor. Si te limitas a pruebas unitarias y falsas todo, te pierdes muchos errores, ya sea porque Plone funciona de manera diferente a lo que pensabas, o las próximas versiones de Plone son diferentes a las de hoy. Por otro lado, las pruebas de integración no solo son más lentas, sino que a menudo crean fallas de prueba muy alejadas del error real en el código. Las pruebas no solo se ejecutan más lentamente, sino que también lleva más tiempo depurar por qué fallan. Aquí hay algunas buenas reglas para tener en cuenta.

source: If you need to write many test cases for a browser view, you might want to factor this out into a component of its own, in such a way that this component can easily be tested with unit tests. If, for example, you have a list view that shall do a specific way of sorting, depending on gender, language and browser of a user, write a component that takes a list of names to sort, gender, language and browser as strings. This code can easily be tested for all combinations in unit tests, while extracting gender, language and browser from a request object takes only a few functional tests.
es: Si necesita escribir muchos casos de prueba para una browser view, es posible que desee factorizar esto en un componente propio, de forma que este componente pueda probarse fácilmente con pruebas unitarias. Si, por ejemplo, tiene una vista de lista que debe hacer una forma específica de clasificación, según el género, el idioma y el navegador de un usuario, escriba un componente que tome una lista de nombres para ordenar, género, idioma y navegador como cadenas. Este código puede probarse fácilmente para todas las combinaciones en pruebas unitarias, mientras que la extracción de género, idioma y navegador de un objeto de solicitud solo requiere unas pocas pruebas funcionales.

source: Try not to mock code. The mocked code you generate mocks Plone in the version you are using today. The next version might work differently.
es: Intenta no burlar el código. El código falsificado que generas se burla de Plone en la versión que estás usando hoy. La próxima versión podría funcionar de manera diferente.

source: Do not be afraid to rewrite your code for better testability. It pays off.
es: No tenga miedo de volver a escribir su código para una mejor comprobabilidad. Vale la pena.

source: If you have highly complex code, think about structuring code and data structures in such a way that they have no side effects. For one customer I wrote a complex ruleset of about 400 lines of code. A lot of small methods that have no side effects. It took a bit to write that code and corresponding tests, but as of today this code did not have a single failure.
es: Si tiene un código altamente complejo, piense en estructurar códigos y estructuras de datos de tal manera que no tengan efectos secundarios. Para un cliente, escribí un complejo conjunto de reglas de aproximadamente 400 líneas de código. Una gran cantidad de métodos pequeños que no tienen efectos secundarios. Tomó un poco escribir ese código y las pruebas correspondientes, pero a partir de hoy, este código no tuvo un solo error.

source: Steal from others. Unfortunately, it sometimes takes an intrinsic knowledge to know how to test some functionality. Some component functionality that is automatically handled by the browser must be done by hand. And the component documentation has been referenced in this chapter as a terrible example already. So, copy your code from somewhere else.
es: Robar de los demás. Desafortunadamente, a veces se necesita un conocimiento intrínseco para saber cómo probar algunas funcionalidades. Algunas funciones de los componentes que maneja automáticamente el navegador se deben realizar a mano. Y la documentación del componente se ha mencionado en este capítulo como un terrible ejemplo. Por lo tanto, copie su código desde otro lugar.

source: Normally, you write a test that tests one thing only. Don't be afraid to break that rule when necessary. If, for example, you built some complex logic that involves multiple steps, don't shy away from writing a longer test showing the normal, good case. Add lots of comments explaining in each step what is happening, why and how. This helps other developers and the future you.
es: Normalmente, escribes una prueba que prueba solo una cosa. No tengas miedo de romper esa regla cuando sea necesario. Si, por ejemplo, construiste una lógica compleja que implique varios pasos, no evites escribir una prueba más larga que muestre el buen caso normal. Añada muchos comentarios explicando en cada paso qué está sucediendo, por qué y cómo. Esto ayuda a otros desarrolladores y al futuro tú.

source: Plone tests
es: Las pruebas de Plone

source: Layers
es: Capas

source: Plone is a complex system to run tests in. Because of this, we use a functionality from zope.testrunner: layers. We use the well known unittest framework which exhibits the same ideas as nearly every unittest framework out there. In addition for test setups we have the notion of layers. A layer is a test setup that can be shared. This way, you can run tests from 20 different testsuites but not each testsuite sets up their own complete Plone site. Instead, you use a Layer, and the testrunner takes care that every testsuite sharing a layer are run together.
es: Plone es un sistema complejo para ejecutar pruebas. Debido a esto, utilizamos una funcionalidad de zope.testrunner: las capas. Usamos el conocido framework unittest que exhibe las mismas ideas que casi todos los framework unittest que hay. Además de las configuraciones de prueba, tenemos la noción de capas. Una capa es una configuración de prueba que se puede compartir. De esta manera, puede ejecutar pruebas desde 20 diferentes suites de prueba, pero no cada conjunto de pruebas configura su propio sitio completo de Plone. En cambio, usa una capa, y el testrunner se ocupa de que todas las unidades de prueba que comparten una capa se ejecuten juntas.

source: Usually, you create three layers on your own, an integration layer, a functional layer and an acceptance test layer. If you were to test code that uses the Solr search engine, you'd use another layer that starts and stops solr between tests. But most of the time you just use the default layers you copied from somewhere or that mr.bob gave you.
es: Normalmente, creas tres capas por tu cuenta, una capa de integración, una capa funcional y una capa de prueba de aceptación. Si tuviera que probar el código que usa el motor de búsqueda Solr, usaría otra capa que inicia y detiene la solr entre las pruebas. Pero la mayoría de las veces solo usas las capas predeterminadas que copiaste de alguna parte o que el scaffolding mr.bob te genero.

source: By convention, layers are defined in a module :py:mod:`testing` in your module root, ie :py:mod:`my.code.testing`. Your test classes should be in a folder named :file:`tests`
es: Por convención, las capas se definen en un módulo :py:mod:`testing` en su raíz de módulo, es decir :py:mod:`my.code.testing`. Sus clases de prueba deben estar en una carpeta llamada :file:`tests`

source: Getting started
es: Empezando

source: Mr.bob already created the testing layers. We will go through them now.
es: Mr.bob ya creó las capas de prueba. Los revisaremos ahora.
