Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: That is a very verbose configuration, maybe you want to do it in the web interface and export the settings. Whichever way you choose, it is easy to make a simple mistake. I will just present the XML way here.
es: Esa es una configuración muy detallada, tal vez usted quiere hacerlo en la interfaz web y exportar la configuración. Por otro lado, es fácil cometer un simple error en ambos sentidos. Yo acabo de presentar la forma XML aquí.

source: The config for the Workflow is in :file:`profiles/default/workfows/talks_workflow.xml`
es: La configuración del flujo de trabajo está en el archivo :file:`profiles/default/workfows/talks_workflow.xml`

source: We have to reinstall our product again.
es: Tenemos que volver a instalar nuestro complemento de nuevo.

source: But this time, this is not enough. Permissions get updated on workflow changes. As long as a workflow change didn't happen, the talks have the same permissions as ever.
es: Pero esta vez, esto no es suficiente. Los permisos se actualizan en los cambios de flujo de trabajo. Mientras no ocurra un cambio en el flujo de trabajo, las charlas tienen los mismos permisos que nunca.

source: Luckily, there is a button for that in the ZMI Workflow view :guilabel:`Update security settings`.
es: Afortunadamente, hay un botón para eso en la vista Flujo de trabajo ZMI :guilabel:`Actualizar configuración de seguridad`.

source: After clicking on this, only managers and Reviewers can see the Voting functionality.
es: Después de hacer clic en esto, sólo los usuarios administradores y los usuarios revisores pueden ver la funcionalidad de votación.

source: Lastly, we add our silly function to auto-approve talks.
es: Por último, añadimos nuestra tonta función para autorizar los tipos de contenidos talks.

source: You quickly end up writing many event handlers, so we put everything into a directory for eventhandlers.
es: Rápidamente terminas escribiendo muchos manejadores de eventos, por lo que ponemos todo en un directorio para eventhandlers.

source: For the events we need an :file:`events` directory.
es: Para los eventos nosotros necesitamos un directorio :file:`events`.

source: Create the :file:`events` directory and add an empty :file:`events/__init__.py` file.
es: Crear el directorio :file:`events` y añadir un archivo vacio :file:`events/__init__.py`.

source: Next, register the events directory in :file:`configure.zcml`
es: Lo próximo, registramos el directorio events en el archivo :file:`configure.zcml`

source: Now write the ZCML configuration for the events into :file:`events/configure.zcml`
es: Ahora escribimos la configuración ZCML para los eventos dentro del archivo :file:`events/configure.zcml`

source: This looks like a MultiAdapter. We want to get notified when an IVotable object gets modified. Our method will receive the votable object and the event itself.
es: Esto parece un MultiAdapter. Queremos ser notificados cuando un objeto IVotable se modifica. Nuestro método recibirá el objeto votable, y el evento en sí.

source: And finally, our event handler in :file:`events/votable.py`
es: Y finalmente, nuestro manipulador del evento en el archivo :file:`events/votable.py`

source: We are using a lot of plone api here. Plone API makes the code a breeze. Also, there is nothing really interesting. We will only do something if the workflow state is pending and the average vote is above 0.5. As you can see, the :samp:`transition` Method does not want the target state, but the transition to move the state to the target state.
es: Estamos usando un montón de plone api aquí. Plone API hace el código una brisa fresca. Además, no hay nada realmente interesante. Sólo haremos algo, si el estado de flujo de trabajo está pendiente y el voto promedio es superior a 0.5. Como puede ver, el método :samp:`transition` no quiere el estado de destino, sino la transición para mover el estado al estado de destino.

source: There is nothing special going on.
es: No hay nada especial en marcha.

source: Turning Talks into Events
es: Convertir las Charlas en Eventos

source: We forgot something: A list of talks is great especially if you can sort it by your preferences. But if a visitor decides he wants to actually go to see a talk he needs to know when it will take place.
es: Se nos olvidó algo: Una lista de las charlas es excelente especialmente si usted puede ordenarlo por sus preferencias. Pero si un visitante decide que quiere actualmente ver una charla que necesita saber cuándo va a tener lugar.

source: We need a schedule and for this we need to store the information when a talk will happen.
es: Necesitamos un programa y para ello necesitamos almacenar la información en una charla va a suceder.

source: Luckily the default type *Event* is based on reusable behaviors from the package :py:mod:`plone.app.event` that we can reuse.
es: Afortunadamente el tipo *Evento* es basado en comportamiento reusable desde el paquete plone.app.event.

source: In this chapter you will
es: En este capítulo vamos a

source: enable this behavior for talks
es: habilitar este comportamiento para las charlas

source: display the date in the talkview and talklistview
es: mostrar la fecha en la vista talkview y talklistview

source: First enable the behavior :py:class:`IEventBasic` for talks in :file:`profiles/default/types/talk.xml`
es: Primero nosotros habilitamos el comportamiento :py:class:`IEventBasic` para las charlas en el archivo :py:mod:`profiles/default/types/talk.xml`

source: After you activate the behavior by hand or reinstalled the add-on you will now have some additional fields for ``start`` and ``end``.
es: Después activamos el comportamiento manualmente o vuelta a instalar el complemento podríamos añadir nuevas charlas con el nuevo campo de ``start`` y ``end``.

source: To display the new field we reuse a default event summary view as documented in http://ploneappevent.readthedocs.io/en/latest/development.html#reusing-the-event-summary-view-to-list-basic-event-information
es: Para mostrar el nuevo campo, reutilizamos una vista de resumen de evento por defecto como se documenta en http://ploneappevent.readthedocs.io/en/latest/development.html#reusing-the-event-summary-view-to-list-basic-event-information

source: Edit :file:`browser/templates/talkview.pt`
es: Edite el archivo :file:`browser/templates/talkview.pt`

source: Similar to the field `room` the problem now appears that speakers submitting their talks should not be able to set a time and day for their talks. Sadly it is not easy to modify permissions of fields provided by behaviors (unless you write the behavior yourself). At least in this case we can take the easy way out since the field does not contain secret information: We will simply hide the fields from contributors using css and show them for reviewers. We will do so in chapter :ref:`resources-label` when we add some css-files.
es: Al igual que en el campo `room`, ahora el problema parece ser que los oradores que envían sus elementos talks no deberían poder establecer una hora y un día para sus conversaciones. Lamentablemente, no es fácil modificar los permisos de los campos proporcionados por los comportamientos (a menos que usted mismo escriba el comportamiento). Al menos en este caso podemos tomar el camino más fácil ya que el campo no contiene información secreta: simplemente ocultaremos los campos de los contribuyentes que usan css y los mostraremos a los revisores. Lo haremos en el capítulo :ref:`resources-label` cuando agreguemos algunos archivos css.

source: Modify :file:`browser/static/ploneconf.css` and add:
es: Modificar el archivo :file:`browser/static/ploneconf.css` y añadir:

source: You can now display the start-date of a talk in the talklist. Modify the class :py:class:`TalkListView` and the template :file:`browser/templates/talklistview.pt` to show the new info:
es: Usted podría también mostrar la fecha de inicio de una charla en la talklist. Modificar la clase :py:class:`TalkListView` y la plantilla en el archivo :file:`browser/templates/talklistview.pt` para mostrar la nueva información:

source: If you changed the view :py:class:`TalkListView` to only return brains as described in :ref:`dexterity2-use_indexes-label` you can save youself a lot of work and simply use the existing index `start` (generously provided by :py:mod:`plone.app.event`) in the template as ``python:brain.start``.
es: Si cambiaste la vista :py:class:`TalkListView` para que solo devuelva los cerebros como se describe en :ref:`dexterity2-use_indexes-label` puedes ahorrarte mucho trabajo y simplemente usar el índice existente `start` (proporcionado generosamente por :py:mod:`plone.app.event`) en la plantilla como ``python:brain.start``.

source: Find out where ``event_summary`` comes from and describe how you could override it.
es: Averigüe de dónde viene ``event_summary`` y describa cómo puede anularlo.

source: Use your editor or grep to search all zcml-files in the folder :file:`packages` for the string ``name="event_summary"``
es: Use su editor o grep para buscar todos los archivos zcml en la carpeta :file:`packages` para la cadena ``name="event_summary"``

source: The relevant registration is:
es: El registro relevante es:

source: So there is a class :py:class:`plone.app.event.browser.event_summary.EventSummaryView` and a template :file:`event_summary.pt` that could be overridden with :py:mod:`z3c.jbot` by copying it as :file:`plone.app.event.browser.event_summary.pt` in :file:`browser/overrides`.
es: Entonces hay una clase :py:class:`plone.app.event.browser.event_summary.EventSummaryView` y una plantilla :file:`event_summary.pt` que podría ser anulada con :py:mod:`z3c.jbot` por copiándolo como :file:`plone.app.event.browser.event_summary.pt` en :file:`browser/overrides`.

source: Find out where the event behavior is defined and which fields it offers.
es: Descubra dónde se define el comportamiento del evento y qué campos ofrece.

source: The id with which the behavior is registered in :file:`Talk.xml` is a Python path. So :py:class:`plone.app.event.dx.behaviors.IEventBasic` can be found in :file:`packages/plone.app.event/plone/app/event/dx/behaviors.py`
es: El id con el que se registra el comportamiento en :file:`Talk.xml` es una ruta de Python. Entonces :py:class:`plone.app.event.dx.behaviors.IEventBasic` se puede encontrar en :file:`packages/plone.app.event/plone/app/event/dx/behaviors.py`

source: Note how it uses ``defaultFactory`` to set an initial value.
es: Observe cómo usa ``defaultFactory`` para establecer un valor inicial.

source: You reused a existing behavior to add new fields
es: Usted reusa un comportamiento existente para añadir nuevos campos

source: You reused existing indexes to display the time of a talk
es: Reutilizó los índices existentes para mostrar el tiempo de una talk

source: You did not have to write your own datetime-fields and indexers \o/
es: No tenía que escribir su propio campo de fecha y hora e indexadores \o/

source: Return to Dexterity: Moving contenttypes into Code
es: Regrese a la Dexterity: Mover los tipos de contenido al Código fuente

source: Move the *Talk* type into :py:mod:`ploneconf.site`
es: Mover el tipo de contenido *Talk* dentro del paquete :py:mod:`ploneconf.site`

source: Improve the schema and the FTI
es: Mejora el esquema y la FTI

source: Content type definitions with generic setup
es: Definiciones de tipo de contenido con generic setup

source: XML schema
es: Esquema XML

source: more widgets
es: más widgets

source: Remember the *Talk* content type that we created through-the-web with Dexterity? Let's move that new content type into our add-on package so that it may be installed in other sites without TTW manipulation.
es: ¿Recuerdas el tipo de contenido *Talk* que creamos a través de la web con Dexterity? Pasemos ese nuevo tipo de contenido a nuestro paquete adicional para que pueda instalarse en otros sitios sin manipulación de a través de la Web.

source: Steps:
es: Pasos:

source: Return to the Dexterity control panel
es: Volver al panel del control Tipos de contenido Dexterity

source: Export the *Talk* Type Profile and save the file
es: Exporte el perfil del tipo de contenido *Talk* y guarde el archivo

source: Delete the *Talk* from the site before installing it from the file system
es: Elimine el tipo de contenido *Talk* del sitio antes de instalarlo desde el sistema de archivos

source: Extract the files from the exported tar file and add them to our add-on package in :file:`profiles/default/`
es: Extraiga los archivos del archivo tar exportado y agréguelos a nuestro paquete adicional en :file:`profiles/default/`

source: From the buildout directory perspective that is :file:`src/ploneconf.site/src/ploneconf/site/profiles/default/`
es: Desde la perspectiva del directorio buildout que es :file:`src/ploneconf.site/src/ploneconf/site/profiles/default/`

source: The file :file:`profiles/default/types.xml` tells Plone that there is a new content type defined in file :file:`talk.xml`.
es: El archivo :file:`profiles/default/types.xml` le dice a Plone que hay un nuevo tipo de contenido definido en el archivo :file:`talk.xml`.

source: Upon installing, Plone reads the file :file:`profiles/default/types/talk.xml` and registers a new type in ``portal_types`` (you can find and inspect this tool in the ZMI!) with the information taken from that file.
es: Al momento de la instalación, Plone lee el archivo :file:`profiles/default/types/talk.xml` y registra un nuevo tipo en ``portal_types`` (¡puedes encontrar e inspeccionar esta herramienta en ZMI!) Con la información extraída de ese archivo.

source: Now our package has new configuration for Generic Setup. Generic Setup store the configuration for the site in the folder :file:`profiles/`. This configuration is applied to your site upon installing the package. So, we'll need to reinstall it (if installed before).
es: Ahora nuestro paquete tiene nueva configuración para algunos Generic Setup. El Generic Setup almacena la configuración para el sitio en la carpeta :file:`profiles/`. Esta configuración es aplicada en su sitio al instalar el paquete. Necesitará instalar de nuevo el paquete (si ya esta instalado anteriormente).

source: Restart Plone.
es: Reinicie Plone.

source: Re-install ploneconf.site (deactivate and activate).
es: Reinstale el paquete ploneconf.site (desactive y active).

source: Test the type by adding an object or editing one of the old ones.
es: Pruebe el tipo de contenido añadiendo un objeto o la edición de una de las entradas antiguas.

source: Look at how the talks are presented in the browser.
es: Mire cómo se presentan las charlas en el navegador.

source: The escaped inline xml is simply too ugly to look at. You should move it to a separate file!
es: El xml escapado en línea es simplemente demasiado feo para mirar. ¡Debes moverlo a un archivo separado!

source: Create a new folder :file:`content` in the main directory (from the buildout directory perspective that is :file:`src/ploneconf.site/src/ploneconf/site/content/`). Inside add an empty file :file:`__init__.py` and a file :file:`talk.xml` that contains the real XML (copied from http://localhost:8080/Plone/dexterity-types/talk/@@modeleditor and beautified with some online XML formatter (http://lmgtfy.com/?q=xml+formatter))
es: Cree una nueva carpeta :file:`content` en el directorio principal (desde la perspectiva del directorio de compilación que es :file:`src/ploneconf.site/src/ploneconf/site/content/`). En el interior, añada un archivo vacío :file:`__init__.py` y un archivo :file:`talk.xml` que contenga el XML real (copiado de http://localhost:8080/Plone/dexterity-types/talk/@@modeleditor y embellecido con algún formateador XML en línea (http://lmgtfy.com/?q=xml+formatter))

source: Now remove the ugly model_source and instead point to the new XML file in the FTI by using the property ``model_file``:
es: Ahora elimine el feo model_source y, en su lugar, apunte al nuevo archivo XML en el FTI utilizando la propiedad ``model_file``:

source: ``ploneconf.site.content:talk.xml`` points to a file :file:`talk.xml` to be found in the Python path ``ploneconf.site.content``. The :file:`__ìnit__.py` is needed to turn the folder :file:`content` into a Python package. It is best-practice to add schemas in this folder, and in later chapters you will add new types with pythons-schemata in the same folder.
es: ``ploneconf.site.content:talk.xml`` apunta a el archivo :file:`talk.xml` será encontrado en la ruta Python ``ploneconf.site.content``. El archivo :file:`__ìnit__.py` es necesario para convertir la carpeta :file:`content` en un paquete Python. Eso es la mejor práctica para Añadir squemas en esta carpeta, y en capítulos posteriores usted añadirá nuevos tipos de esquemas python en la misma carpeta.

source: The default types of Plone 5 also have an xml schema like this since that allows the fields of the types to be editable trough the web! Fields for types with a python schema are not editable ttw.
es: Los tipos predeterminados de Plone 5 también tienen un esquema xml como este le permite que los campos de los tipos de contenidos sean editables a través de la web. Los campos para los tipos con un esquema de python no son editables a través de la Web.

source: Changing a widget
es: Cambiando un widget

source: `Dexterity XML <https://docs.plone.org/external/plone.app.dexterity/docs/reference/dexterity-xml.html>`_ is very powerful. By editing it (not all features have a UI) you should be able to do everything you can do with a Python schema. Sadly not every feature also is exposed in the UI of the dexterity schema editor. For example you cannot yet change the widgets or permissions for fields in the UI. We need to do this in the xml- or python-schema.
es: `Dexterity XML <https://docs.plone.org/external/plone.app.dexterity/docs/reference/dexterity-xml.html>`_ es muy poderoso. Al editarlo (no todas las funciones tienen una interfaz de usuario - IU), debería poder hacer todo lo que puede hacer con un esquema de Python. Lamentablemente, no todas las funciones también están expuestas en la interfaz de usuario del editor de esquemas de dexterity. Por ejemplo, todavía no puede cambiar los widgets o permisos para los campos en la interfaz de usuario. Necesitamos hacer esto en el esquema xml o código python.

source: Our talks use a dropdown for :guilabel:`type_of_talk` and a multiselect for :guilabel:`audience`. Radio-buttons and checkboxes would be the better choice here. Modify the XML to make that change happen:
es: Nuestros objetos talks usa una lista desplegable para :guilabel:`type_of_talk` un lista de selección múltiple para :guilabel:`audience`. Los botones de radio y las casillas de verificación serían la mejor opción aquí. Modificar el XML para hacer eso que esos cambios sucedan:

source: Protect fields with permissions
es: Proteger campos con permisos

source: We also want to have a add a new field `room` to show where a talk will take place. Our case-study says the speakers will submit the talks online. How should they know in which room the talk will take place (if it got accepted at all)? So we need to hide this field from them by requiring a permission that they do not have.
es: Nosotros también queremos añadir un nuevo campo `room` para mostrar donde una charla será dictada. Nuestro caso de estudio dice que los speakers podrán enviar las talks en linea. ¿Cómo podrían ellos saber en cual salón la talk será dictada (si esa fue aceptada del todo)? entonces necesitamos ocultar este campo de ellos requiriendo un permiso que no tienen.

source: Let's assume the prospective speakers will not have the permission to review content (i.e. edit submitted content and publish it) but the organizing commitee has. You can then protect the field using the permission `Review portal content` in this case the name of the permission-utility for this permission: `cmf.ReviewPortalContent`.
es: Supongamos que los posibles speakers no tendrán el permiso para revisar el contenido (es decir, editar el contenido enviado y publicarlo), pero sí lo ha hecho el comité organizador. A continuación, puede proteger el campo con el permiso `Review portal content`, en este caso el nombre de la utilidad de permiso para este permiso: `cmf.ReviewPortalContent`.

source: We only want to prevent writing, not reading, so we'll only manage the `write-permission`:
es: Nosotros solamente queremos prevenir escritura, no lectura, entonces solamente administramos el permiso `write-permission`:

source: Go to the ZMI and look for the definition of the new ``Talk`` content type in ``portal_types``. Now deactivate :guilabel:`Implicitly addable?` and save. Go back to the site. Can you identify what this change has caused? And why is that useful?
es: Valla a la ZMI y observe la definición del nuevo tipo de contenido ``Talk`` en la herramienta ``portal_types``. Ahora desactive :guilabel:`Implicitly addable?` y guarde los cambios. Regresa al sitio. ¿Puedes identificar lo que este cambio ha causado? ¿Y por qué es eso útil?

source: Go to http://localhost:8080/Plone/portal_types/talk/manage_propertiesForm
es: Valla a http://localhost:8080/Plone/portal_types/talk/manage_propertiesForm

source: When disabling *Implicitly addable* you can no longer add Talks any more unless you change some container like the type *Folder*: Enable *Filter contenttypes?* for it and add *Talk* to the items that are allowed.
es: Al deshabilitar *Implicitly addable*, ya no puede añadir más tipos de contenidos Talks a menos que cambie algún contenedor como el tipo *Carpeta*: Habilite *¿Filtrar los tipos de contenido?* para ello y añada *Talk* a los elementos que están permitidos.

source: With this method you can prevent content that only makes sense inside some defined structure to show up in places where they do not belong.
es: Con este método puedes evitar que el contenido que solo tiene sentido dentro de una estructura definida aparezca en lugares a los que no pertenecen.

source: The equivalent setting for disabling :guilabel:`Implicitly addable` in :file:`Talk.xml` is:
es: La configuración equivalente para deshabilitar :guilabel:`Implicitly addable` en el archivo :file:`Talk.xml` es:

source: You can now create new content-types and store them in a reproduceable way
es: Ahora puede crear nuevos tipos de contenido y almacenarlos de forma reproducible

source: You installed the package to apply the Generic Setup configuration
es: Usted instalo el paquete para aplicar la configuración Generic Setup

source: You learned how to read and modify the content type schema in xml
es: Usted aprendió a como leer y modificar el esquema del tipo de contenido en xml

source: Extending Plone
es: Extendiendo Plone

source: Get an overview over the technologies used to extend Plone
es: Obten una descripción generar de las tecnologías usada para extender Plone

source: Component Architecture
es: Arquitectura Componente

source: Zope is extensible and so is Plone.
es: Zope es extensible y también lo es Plone.

source: If you want to install an add-on, you are going to install an Egg — a form of Python package. Eggs consist of Python files together with other needed files like page templates and the like and a bit of metadata, bundled to a single archive file.
es: Si usted quiere instalar un complemento, usted esta yendo a instalar un paquete Egg - una forma de paquete Python. Los paquetes Eggs consisten de archivos Python junto con otros archivos necesarios como page templates y archivos similares y un poco de archivos metadatos, agrupados en un solo archivo de almacenamiento.
