Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Next, it adds a method for testing that your add-on gets properly installed. This might seem stupid, but it isn't if you take into account that in plone land, things change with new releases. Having a GenericSetup profile installing Javascript files contains the assumption that the package wants a javascript file available in Plone. This assumption is explained in the syntax of the current Plone. By testing that the result is met, the Javascript file really is available, we spell out that assumption more clearly. The person that wants to make your package work 5 years from now, knows now that the result in his browser might be related to a missing file. Even if he does not understand the semantics from the old Plone on how to register js files, he has a good starting point on what to do to make this package compatible.
es: A continuación, añada un método para probar que su complemento se instala correctamente. Esto puede parecer estúpido, pero no lo es si se tiene en cuenta que en una tierra plone, las cosas cambian con las nuevas versiones. Tener un perfil GenericSetup instalando archivos Javascript contiene la suposición de que el paquete quiere un archivo javascript disponible en Plone. Esta suposición se explica en la sintaxis del Plone actual. Al comprobar que se cumple el resultado, el archivo Javascript está realmente disponible, explicamos esa suposición con mayor claridad. La persona que quiere hacer que su paquete funcione dentro de 5 años, ahora sabe que el resultado en su navegador podría estar relacionado con un archivo perdido. Incluso si no comprende la semántica del viejo Plone sobre cómo registrar archivos js, tiene un buen punto de partida sobre qué hacer para que este paquete sea compatible.

source: This is why it makes sense to write these tedious tests.
es: Es por eso que tiene sentido escribir estas tediosas pruebas.

source: If nothing else matches, :file:`test_setup.py` is the right location for anything GenericSetup related. In :ref:`eggs1-label` we created a content type. It is time to test this.
es: Si nada más coincide, el archivo :file:`test_setup.py` es la ubicación correcta para todo lo relacionado con GenericSetup. En :ref:`eggs1-label` creamos un tipo de contenido. Es hora de probar esto.

source: We are going to create a test module named :py:mod:`test_talk`:
es: Vamos a crear un módulo de prueba llamado :py:mod:`test_talk`:

source: In :ref:`views1-label` we created a new view. We have to test this! This time, though, we are going to test it with a browser, too.
es: En :ref:`views1-label` creamos una nueva vista. ¡Tenemos que probar esto! esta vez, sin embargo, vamos a probarlo también con un navegador.

source: First, we add a simple test for the custom template in our Functional Test layer
es: Primero, añadimos una prueba simple para la plantilla personalizada en nuestra capa de prueba funcional

source: We already wrote a talklistview and it is untested! We like to write unit tests first. But if you look at the Talklistview, you notice that you'd have to mock the portal_catalog, the context, and complex results from the catalog. I wrote earlier that it is ok to rewrite code to make it better testable. But in this example look at what you would test if you mocked everything mentioned above. You would test that your code iterates over a mocked list of mocked items, restructuring mocked attributes. There is not much sense in that. If you did some calculation, like ratings, things might look different, but not in this case.
es: ¡Ya escribimos una vista de lista de talk y no ha sido probada! Nos gusta escribir pruebas unitarias primero. Pero si observa en la vista de lista de talk, observa que debe burlarse del portal_catalog, el contexto y los resultados complejos del catálogo. Yo escribí antes que está bien reescribir el código para que sea mejor comprobable. Pero en este ejemplo, fíjate en lo que probarías si te burlaras de todo lo mencionado anteriormente. Usted probaría que su código itera sobre una lista burlada de elementos burlados, reestructurando atributos burlados. No tiene mucho sentido en eso. Si hizo algunos cálculos, como clasificaciones, las cosas pueden parecer diferentes, pero no en este caso.

source: We can write an integration test. We should test the good case, and edge cases. The simplest test we can write is a test where no talks exist.
es: Podemos escribir una prueba de integración. Deberíamos probar el buen caso y los casos extremos. La prueba más simple que podemos escribir es una prueba donde no hay talks.

source: Then we can create content. Looking through the code, we do not want the talks list to render results for documents. So add a a document. Also, the code does not want to render results for a document out of the current context. So create a folder and use this as a context. Then add a talk outside of this folder. The method iterates over audiences, make sure that you have at least one talk that has multiple audiences and check for that. Some advanced thing. Should you ever use an improved search system like collective.solr, results might get batched automatically. Check that if you have 101 talks, that you also get back 101 talks. Think about what you want to check in your results. Do you want to make a one to one comparison? How would you handle UUIDs?
es: Entonces podemos crear contenido. Si miramos el código, no queremos que la lista de charlas muestre los resultados de los documentos. Así que añada un documento. Además, el código no quiere generar resultados para un documento fuera del contexto actual. Así que crea una carpeta y use esta como contexto. Luego añada una charla fuera de esta carpeta. El método itera sobre las audiencias, asegúrese de tener al menos una charla que tenga múltiples audiencias y verifique eso. Algo avanzado. Si alguna vez usa un sistema de búsqueda mejorado como collective.solr, los resultados pueden ser agrupados automáticamente. Comprueba que si tienes 101 charlas, también recibes 101 charlas. Piensa en lo que quieres verificar en tus resultados. ¿Quieres hacer una comparación uno a uno? ¿Cómo manejarías los UUID?

source: A test creating 101 talks can be slow. It tests an edge case. There is a trick: create a new :py:class:`TestCase` Class, and set an attribute :py:attr:`level` with the value of 2. This test will then only be run when you run the tests with the argument :option:`bin/test -a` with the value 2 or :option:`bin/test --all`
es: Una prueba que crea 101 charlas puede ser lenta. Prueba un caso extremo. Hay un truco: crear una nueva clase :py:class:`TestCase`, y establecer un atributo :py:attr:`level` con el valor de 2. Esta prueba solo se ejecutará cuando ejecutes las pruebas con el argumento :option:`bin/test -a` con el valor 2 o :option:`bin/test --all`

source: Robot tests
es: Pruebas Robot

source: Finally, we write a robot test:
es: Finalmente, escribimos una prueba de robot:

source: When you run your tests, you might notice that the robot tests didn't run. This is a feature activated by the robot layer, because robot tests can be quite slow. If you run your tests with :command:`./bin/test --all` your robot tests will run. Now you will realize that you cannot work any more because a browser window pops up all the time.
es: Cuando ejecutas tus pruebas, es posible que notes que las pruebas del robot no se ejecutaron. Esta es una característica activada por la capa de robot, porque las pruebas de robot pueden ser bastante lentas. Si ejecuta sus pruebas con :command:`./bin/test --all` se ejecutarán sus pruebas de robot. Ahora se dará cuenta de que ya no puede trabajar porque aparece una ventana del navegador todo el tiempo.

source: There are 3 possible workarounds:
es: Hay 3 soluciones posibles:

source: install the headless browser, Phantomjs. Then run the tests with an environment variable :command:`ROBOT_BROWSER=phantomjs bin/test --all` This did not work for me btw.
es: instala el navegador sin cabeza, Phantomjs. Luego ejecute las pruebas con una variable de entorno :command:`ROBOT_BROWSER=phantomjs bin/test --all` Esto no funcionó para mí, por cierto.

source: Install :program:`xvfb`, a framebuffer. You wont see the browser then. After installing, start xvfb like this: :command:`Xvfb :99.0 -screen 0 1024x768x24`. Then run your tests, declaring to connect to the non-default X Server: :command:`DISPLAY=:99.0 bin/test --all`
es: Instalar el programa :program:`xvfb`, un framebuffer. No verá el navegador entonces. Después de la instalación, inicie el programa xvfb de la siguiente manera: :command:`Xvfb :99.0 -screen 0 1024x768x24`. Luego ejecute sus pruebas, declarando conectarse al Servidor X no predeterminado: :command:`DISPLAY=:99.0 bin/test --all`

source: Install Xephyr, it is also a framebuffer, but visible in a window. Start it the same way as you start Xvfb.
es: Instale el programa Xephyr, también es un framebuffer, pero visible en una ventana. Comience de la misma manera que cuando inicia Xvfb.

source: The first method, with Phantomjs, will throw failures with our tests, unfortunately.
es: El primer método, con Phantomjs, arrojará fallas con nuestras pruebas, desafortunadamente.

source: For debugging, you can run the test like this :command:`ROBOT_SELENIUM_RUN_ON_FAILURE=Debug bin/test --all`. This will stop the test at the first failure and you end up in an interactive shell where you can try various Robot Framework commands.
es: Para la depuración, puede ejecutar la prueba de esta manera :command:`ROBOT_SELENIUM_RUN_ON_FAILURE=Debug bin/test --all`. Esto detendrá la prueba en la primera falla y terminará en una consola interactiva donde puede probar varios comandos de Robot Framework.

source: Test script
es: Script de prueba

source: The testing script have some options as the following:
es: El script de prueba tiene algunas opciones como las siguientes:

source: All testcases.
es: Todos los casos de prueba.

source: Specify the value of 2 for this test.
es: Especifique el valor de 2 para esta prueba.

source: More information
es: Más información

source: For more in-depth information and reference see
es: Para más información en profundidad y referencia vea

source: `plone.app.testing documentation <https://docs.plone.org/external/plone.app.testing/docs/source/index.html>`_.
es: `documentación de plone.app.testing <https://docs.plone.org/external/plone.app.testing/docs/source/index.html>`_.

source: `plone.testing package <https://pypi.org/project/plone.testing>`_
es: `paquete plone.testing <https://pypi.org/project/plone.testing>`_

source: We don't do any real theming during the training. We will give a short overview about the options you have.
es: Nosotros no hacemos ningún tipo de temas y plantillas real durante el entrenamiento. Sólo vamos a explicar las opciones que dispone para esto.

source: If you want to learn about theming see `the documentation <https://docs.plone.org/adapt-and-extend/theming/index.html>`_ and the Training :doc:`../theming/index`
es: Si desea obtener más información sobre temas, consulte `la documentación <https://docs.plone.org/adapt-and-extend/theming/index.html>`_ y los recursos para el entrenamiento sobre :doc:`../theming/index`

source: Using Third-Party Behaviors
es: Usando comportamientos de complementos de terceros

source: Skip this since collective.behavior.banner is not yet compatible with Plone 5.
es: Omita esto porque collective.behavior.banner aún no es compatible con Plone 5.

source: Add Teaser With collective.behavior.banner
es: Añadir Teaser con collective.behavior.banner

source: There are a lot of add-ons in Plone for sliders/banners/teasers. We thought there should be a better one and created :py:mod:`collective.behavior.banner`.
es: Hay muchos complementos en Plone para sliders/banners/teasers. Pensamos que debería haber una mejor y creado :py:mod:`collective.behavior.banner`.

source: Like many add-ons it has not yet been released on PyPI (Python Package Index) but only exists as code on GitHub.
es: Al igual que muchos complementos, aún no se ha publicado en PyPI (Python Package Index), pero solo existe como código en GitHub.

source: The training buildout has a section ``[sources]`` that tells buildout to download a specific add-on not from PyPI but from some code repository (usually GitHub):
es: El buildout del entrenamiento tiene una sección ``[sources]`` que le dice a buildout que descargue un complemento específico no de PyPI sino de algún repositorio de código (generalmente GitHub):

source: Pinning the revision saves us from being surprised by changes in the code we might not want.
es: Definiendo la revisión nos salva de ser sorprendidos por los cambios en el código fuente puede ser que no quiera.

source: After adding the source, we need to add the egg to buildout:
es: Después de añadir el código fuente, tenemos que añadir el paquete egg al archivo buildout:

source: And rerun :file:`./bin/buildout`
es: Y ejecute de nuevo :file:`./bin/buildout`

source: Install the add-on
es: Instalar el complemento

source: Create a new dexterity content type ``Banner`` with **only** the behavior ``Banner`` enabled.
es: Crear un nuevo tipo de contenido dexterity ``Banner`` con **solamente** el comportamiento ``Banner`` habilitado.

source: Create a folder called ``banners``
es: Crear una carpeta llamada ``banners``

source: Add two banners into that folder using images taken from lorempixel.com
es: Añadir dos banners dentro de esa carpeta usando imágenes tomadas desde lorempixel.com

source: Add the Behavior ``Slider`` to the default content type ``Page (Document)``
es: Añadir el Comportamiento ``Slider`` al tipo de contenido por defecto ``Página (Documento)``

source: Edit the front-page and link to the new banners.
es: Edita el la página frontpage y enlace a los nuevos banners.

source: Timetable
es: Programa

source: This is just meant as info for trainers about how long it might take to teach certain chapters. Please update when you have different experiences.
es: Esto solo se entiende como información para los entrenadores sobre cuánto tiempo lleva enseñar ciertos capítulos. Por favor, actualice cuando tenga diferentes experiencias.

source: Name
es: Nombre

source: #Time#
es: #Tiempo#

source: ?? min
es: ?? minutos

source: 1 About Mastering Plone
es: 1 Sobre Maestría en Plone

source: 2 Introduction
es: 2 Introducción

source: 3 Installation & Setup
es: 3 Instalación y configuración

source: 4 Installing Plone for the Training
es: 4 Instalando Plone para el entrenamiento

source: 5 The Case Study
es: 5 El caso de estudio

source: 6 The Features of Plone
es: 6 Las características de Plone

source: 7 The Anatomy of Plone
es: 7 La Anatomía de Plone

source: 8 What’s New in Plone 5 and 5.1
es: 8 ¿Qué de nuevo hay en Plone 5 y 5.1?

source: 9 Configuring and Customizing Plone "Through The Web"
es: 9 Configurando y personalizando Plone "A través de la Web"

source: 10 Theming
es: 10 Temas

source: 11 Extending Plone
es: 11 Extendiendo Plone

source: 12 Extend Plone With Add-On Packages
es: 12 Extiende Plone con paquetes Complementos

source: 13 Dexterity I: "Through The Web"
es: 13 Dexterity - Parte I: "A través de la Web"

source: 15 Write Your Own Add-Ons to Customize Plone
es: 15 Escriba sus propios complementos para personalizar Plone

source: 16 Return to Dexterity: Moving contenttypes into Codetemplates
es: 16 Regrese a la Dexterity: Mover los tipos de contenido al código fuente

source: 17 Views I
es: 17 Views - Parte I

source: 19 Customizing Existing Templates
es: 19 Personalizar plantillas existentes

source: 20 Views II: A Default View for "Talk"
es: 20 Views - Parte II: Una vista por defecto para la "Charla"

source: 21 Views III: A Talk List
es: 21 Views - Parte III: Una lista de Charlas

source: 22 Testing in Plone
es: 22 Pruebas en Plone

source: 23 Behaviors
es: 23 Comportamientos

source: 24 Writing Viewlets
es: 24 Escribiendo Viewlets

source: 25 Programming Plone
es: 25 Programando en Plone

source: 26 IDEs and Editors
es: 26 IDEs y Editores

source: 27 Dexterity Types II: Growing Up
es: 27 Tipos Dexterity - Parte II: Creciendo

source: 28 Custom Search
es: 28 Búsqueda personalizada

source: 29 Turning Talks into Events
es: 29 Convertir las Charlas en Eventos

source: 30 User Generated Content
es: 30 Contenido generado por el usuario

source: 31 Resources
es: 31 Recursos

source: 32 Using Third-Party Behaviors
es: 32 Usando comportamientos de complementos de terceros

source: 33 Dexterity Types III: Python
es: 33 Tipos Dexterity - Parte III: Python

source: 34 Relations
es: 34 Relaciones

source: 35 Manage Settings with Registry, Controlpanels and VocabulariesDeploying your site
es: 35 Administrar configuraciones con el Registro, Panel de Control y Vocabularios despelgados en su sitio

source: 36 Creating a Dynamic Front Page
es: 36 Creando una Página de Inicio Dinámica

source: 37 Creating Reusable Packages
es: 37 Creando paquetes reusables

source: 38 More Complex Behaviors
es: 38 Más comportamientos complejos

source: 39 A Viewlet for the Votable Behavior
es: 39 Un viewlet para el comportamiento Votable

source: 40 Making Our Package Reusable
es: 40 Haciendo nuestro paquete reusable

source: 41 Using starzel.votable_behavior in ploneconf.site
es: 41 Usando starzel.votable_behavior en ploneconf.site

source: 42 Releasing Your Code
es: 42 Publicando su código

source: 43 Buildout II: Getting Ready for Deployment
es: 43 Buildout - Parte II: Cómo prepararse para el despliegue

source: 44 Plone REST API
es: 44 API Plone REST

source: 45 The Future of Plone
es: 45 El futuro de Plone

source: 46 Optional
es: 46 Opcional

source: Version 1.2
es: Versión 1.2

source: 10 min
es: 10 minutos

source: #1 Introduction
es: #1 Introducción

source: #2 Installation & Setup
es: #2 Instalación y configuración

source: 15 min
es: 15 minutos

source: #3 Installing Plone for the Training
es: #3 Instalando Plone para el entrenamiento

source: #4 The Case-Study
es: #4 El caso de estudio

source: #5 The Anatomy of Plone
es: #5 La Anatomía de Plone

source: 90 min
es: 90 minutos

source: #6 The Features of Plone
es: #6 Las características de Plone

source: 60 min
es: 60 minutos

source: #7 Configuring and Customizing Plone through the web
es: #7 Configurando y personalizando Plone a través de la Web

source: 20 min
es: 20 minutos

source: #8 Extending Plone
es: #8 Extendiendo Plone

source: #9 Extend Plone with Add-ons
es: #9 Extiende Plone con Complementos

source: #10 Theming
es: #10 Temas

source: #12 Creating your own eggs to customize Plone
es: #12 Creando complementos para personalizar Plone

source: 30 min
es: 30 minutos

source: #13 Dexterity I: Through the web
es: #13 Dexterity - Parte I: A través de la Web

source: #14 Views I
es: #14 Views - Parte I

source: #16 Customizing existing templates
es: #16 Personalizar plantillas existentes

source: #17 Views II: A default view for "talk"
es: #17 Views - Parte II: Una vista por defecto para la "charla"

source: #18 Views III: A Talk list
es: #18 Views - Parte III: Una lista de Charlas

source: #19 Behaviors
es: #19 Comportamientos

source: #20 Writing Viewlets
es: #20 Escribiendo Viewlets

source: #21 Programming Plone
es: #21 Programando en Plone

source: #22 IDE’s and Editors
es: #22 IDEs y editores

source: #23 Dexterity Types II: Growing up
es: #23 Tipos Dexterity - Parte II: Creciendo

source: #24 Custom search
es: #24 Búsqueda personalizada

source: 45 min
es: 45 minutos

source: #25 Turn talks into events
es: #25 Convertir las charlas en eventos

source: #26 User generated content
es: #26 Contenido generado por el usuario

source: #27 Resources
es: #27 Recursos

source: #28 Using third-party behaviors
es: #28 Usando comportamientos de complementos de terceros

source: #29 Dexterity Types III: Python
es: #29 Tipos Dexterity - Parte III: Python

source: #30 Creating reusable packages with eggs
es: #30 Creando paquetes reusables con paquetes eggs

source: #31 More complex behaviors
es: #31 Más comportamientos complejos

source: #32 A viewlet for the voteable behavior
es: #32 Un viewlet para el comportamiento voteable

source: #33 Making our package reusable
es: #33 Haciendo nuestro paquete reusable

source: #34 Using starzel.votable_behavior in ploneconf.site
es: #34 Usando starzel.votable_behavior en ploneconf.site

source: #35 Buildout II: Deploying your site
es: #35 Buildout II: Desplegando su sitio

source: #36 The Future of Plone
es: #36 El futuro de Plone

source: #37 Optional
es: #37 Opcional

source: #4 The Anatomy of Plone
es: #4 La Anatomía de Plone

source: #5 The Features of Plone
es: #5 Las características de Plone

source: 50 min
es: 50 minutos

source: #6 Configuring and Customizing Plone through the web
es: #6 Configurando y personalizando Plone a través de la Web

source: #7 Extending Plone
es: #7 Extendiendo Plone

source: #8 Extend Plone with Add-ons
es: #8 Extiende Plone con Complementos

source: #8 - How to find add-ons
es: #8 - ¿Como buscar complementos?

source: #8 - Installing Add-ons
es: #8 Instalando complementos

source: #8 - Internationalization
es: #8 Internacionalización

source: #8 - export customizations
es: #8 - exportar personalizaciones

source: #8 - inspect the package
es: #8 - inspeccione el paquete

source: #9 Theming
es: #9 Temas

source: 05 min
es: 05 minutos

source: #11 IDE’s and Editors
es: #11 IDEs y editores

source: #13 Creating content-types with Dexterity
es: #13 Creando tipos de contenido con Dexterity

source: #19 Custom search
es: #19 Búsqueda personalizada

source: #20 Extending Dexterity-Types with Behaviors
es: #20 Extendiendo Tipos Dexterity con Comportamientos

source: #21 Resources
es: #21 Recursos

source: #22 Social behavior
es: #22 Comportamiento social

source: #23 Writing Viewlets
es: #23 Escribiendo Viewlets

source: #24 Deploying your code
es: #24 Desplegando tu código

source: #25 Buildout II: Deploying your site
es: #25 Buildout II: Desplegando su sitio

source: #26 The Future of Plone
es: #26 El futuro de Plone

source: #27 Optional
es: #27 Opcional

source: User Generated Content
es: Contenido generado por el usuario

source: How do prospective speakers submit talks? We let them register on the site and grant right to create talks. For this we go back to changing the site through-the-web.
es: ¿Cómo hacer que los ponentes potenciales envíen sus charlas? Dejamos que se registren en el sitio y otorgan derecho a crear tipos de contenidos Talk. Para ello volvemos a cambiar el sitio a través de la Web.

source: allow self-registration
es: permitir auto registro de usuario

source: constrain types on the talk folder
es: restringir tipos en la carpeta de talk

source: grant local roles
es: otorgar roles locales

source: create a custom workflow for talks
es: crear un flujo de trabajo para las charlas

source: Self-registration
es: Auto-registro

source: Go to the Security control panel at http://localhost:8080/Plone/@@security-controlpanel and Enable self-registration
es: Vaya al panel de control de Seguridad en http://localhost:8080/Plone/@@security-controlpanel y Habilitar el auto-registro de usuario

source: Leave "Enable User Folders" off unless you want a community site.
es: Deje activada la opción "Habilitar carpetas de usuario" a menos que desee un sitio de la comunidad.

source: Constrain types
es: Restringir tipos de contenidos

source: On the talk folder select `Restrictions… <http://localhost:8080/Plone/the-event/talks/folder_constraintypes_form>`_ from the *Add new* menu. Only allow to add talks.
es: En la carpeta de talk, seleccione `Restricciones... <http://localhost:8080/Plone/the-event/talks/folder_constraintypes_form>`_ desde el menú *Añadir nuevo*. Solamente permite añadir talks.

source: Grant local roles
es: Otorgar roles locales
