Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: There is a huge variety of Plone-compatible packages available. See `Plone.org add-on listing <https://plone.org/download/add-ons/>`_. The source repository for many public Plone add-ons is `the GitHub Collective <https://github.com/collective>`_. You may also create your own packages or maintain custom repositories.
es: Hay una gran variedad de paquetes compatibles con Plone disponibles. Consulte la `lista de complementos Plone.org <https://plone.org/download/add-ons/>`_. El repositorio de código fuente para muchos complementos públicos de Plone es la organización `GitHub llamada "Collective" <https://github.com/collective>`_. También puede crear sus propios paquetes o mantener repositorios personalizados.

source: Eggs are younger than Zope. Zope needed something like eggs before there were eggs, and the Zope developers wrote their own system. Old, outdated Plone systems contain a lot of code that is not bundled in an egg. Older code did not have metadata to register things, instead you needed a special setup method. We don't need this method but you might see it in other code. It is usually used to register Archetypes code. Archetypes is the old content type system. Instead, we use the new content type system Dexterity.
es: Los paquetes Eggs son más jóvenes que Zope. Anteriormente Zope necesitaba algo así como paquetes eggs antes de que existieran los paquetes eggs, y los desarrolladores de Zope escribieron su propio sistema de paquetes. Los viejos y anticuados sistemas Plone contienen una gran cantidad de código que no está incluido en un paquete egg. El código anterior no tenía metadatos para registrar cosas, en su lugar necesitabas un método de configuración especial. No necesitamos este método pero puede verlo en otro código. Por lo general, se utiliza para registrar el código Archetypes. El viejo sistema de tipo de contenido es Archetypes. En cambio, usamos el nuevo sistema de tipo de contenido Dexterity.

source: Extension technologies
es: Tecnologías de extensión

source: How do you extend Plone?
es: ¿Cómo extender Plone?

source: This depends on what type of extension you want to create.
es: Esto depende de que tipo de extensión usted quiere crear.

source: You can create extensions with new types of objects to add to your Plone site. Usually these are contenttypes.
es: Usted puede crear extensiones con nuevos tipos de objetos para añadir a su sitio Plone. Usualmente esos son tipos de contenidos.

source: You can create an extension that changes or extends functionality. For example to change the way Plone displays search results, or to make pictures searchable by adding a converter from jpg to text.
es: Puede crear una extensión que cambia o se extiende la funcionalidad. Por ejemplo, para cambiar la forma en que Plone muestra los resultados de búsqueda, o para tomar imágenes de búsqueda mediante la adición de un convertidor de JPG a texto.

source: State of the art
es: Estado del arte

source: cryptic
es: ocultado

source: Powerful and flexible
es: Poderoso y flexible

source: The best way to extend Plone is via *Components*.
es: La mejor manera para extender Plone es a través de *Componentes*.

source: A bit of history is in order.
es: Un poco de historia está a la orden.

source: When Zope started, object-oriented design was **the** silver bullet.
es: Cuando Zope comenzó, el diseño orientado a objetos era **la** bala de plata.

source: Object-oriented design is good at modeling inheritance, but breaks down when an object has multiple aspects that are part of multiple taxonomies.
es: Diseño orientado a objetos es bueno en el modelado herencia, pero se rompe cuando un objeto tiene varios aspectos que forman parte de múltiples taxonomías.

source: Some object-oriented programming languages like Python handle this through multiple inheritance. But it's not a good way to do it. Zope objects have more than 10 base classes. Too many namespaces makes code that's hard to maintain. Where did that method/attribute come from?
es: Algunos lenguajes de programación orientados a objetos como Python manejan esto a través de la herencia múltiple. Pero no es una buena manera de hacerlo. Los objetos Zope tienen más de 10 clases de base. Demasiados espacios de nombres hace al código difícil de mantener. ¿De dónde vino ese método/atributo?

source: After a while, XML and Components became the next silver bullet (Does anybody remember J2EE?).
es: Después de un tiempo, XML y los componentes se convirtieron en la próxima bala de plata (¿Alguien recuerda el Java 2 Enterprise Edition - J2EE?).

source: Based on their experiences with Zope in the past, Zope developers thought that a component system configured via XML might be the way to go to keep the code more maintainable.
es: En base a sus experiencias con Zope en el pasado, los desarrolladores de Zope pensaron que un sistema de componentes configurado a través de XML podría ser el camino a seguir para mantener el código más fácil de mantener.

source: Before Zope Components functionality was often extended by a practice called Monkey Patching: Changing code in other modules by importing and then modifying it at runtime.
es: Antes, la funcionalidad de Zope Components a menudo se ampliaba mediante una práctica llamada Monkey Patching: cambio de código en otros módulos importándolo y luego modificándolo en tiempo de ejecución.

source: Monkey Patching, like subclassing via multiple inheritance, does not scale. Multiple plugins might overwrite each other, you would explain to people that they have to reorder the imports, and then, suddenly, you will be forced to import feature A before B, B before C and C before A, or else your application won't work.
es: Monkey Patching, como la creación de subclases a través de herencia múltiple, no escala. Es posible que varios complementos se sobreescriban, le explique a las personas que deben reordenar las importaciones y, de repente, se verá obligado a importar la característica A antes que B, B antes de C y C antes que A, o de lo contrario, tu aplicación no funcionará.

source: As the new concepts were radically different from the old Zope concepts, the Zope developers renamed the new project to Zope 3. But it did not gain traction, the community somehow renamed it to Bluebream and this died off.
es: A medida que los nuevos conceptos eran radicalmente diferentes de los viejos conceptos de Zope, los desarrolladores Zope cambió el nombre del nuevo proyecto de Zope 3. Pero no ganaron fuerza, la comunidad de alguna manera le cambió el nombre a Bluebream y esto lo extinguió.

source: But the component architecture itself is quite successful and the Zope developers extracted it into the Zope Toolkit. The Zope toolkit is part of Zope, and Plone developers use it extensively.
es: Pero la arquitectura del componente en sí es bastante exitosa y los desarrolladores de Zope la extrajeron e incluyeron en el Zope Toolkit. El Zope toolkit es parte de Zope, y los desarrolladores de Plone lo usan ampliamente.

source: This is what you want to use.
es: Esto es lo que usted quiere usar.

source: Configuring Zope Components with ZCML
es: Configurando Componentes Zope con ZCML

source: ZCML, the Zope Configuration Mark-up Language is an XML based language used to configure Zope Components. With ZCML you declare utilities, adapters and browser views.
es: Del Ingles, Zope Configuration Mark-up Language - ZCML, es el lenguaje de marcado de configuración de Zope es un lenguaje basado en XML que se usa para configurar los componentes Zope. Con ZCML declaras utilidades, adaptadores y browser views.

source: Components are distinguished from one another by the interfaces (formal definitions of functionality) that they require or provide.
es: Los componentes se distinguen unos de otros por las interfaces (definiciones formales de funcionalidad) que ellas requieren o proporcionan.

source: During startup, Zope reads all these ZCML statements, validates that there are not two declarations trying to register the same components and only then registers everything. All components are registered by interfaces required and provided. Components with the same interfaces may optionally also be named.
es: Durante el inicio, Zope lee todas estas declaraciones ZCML, valida que no hay dos declaraciones que tratan de registrar los mismos componentes y sólo entonces registra todo. Todos los componentes están registrados por las interfaces necesarias y proporcionadas. Los componentes con las mismas interfaces también pueden opcionalmente ser nombrados.

source: This is a good thing. ZCML is, by the way, only *one* way to declare your configuration.
es: Esta es una buena cosa. ZCML es por cierto sólo *una* manera de declarar su configuración.

source: Grok provides another way, where some Python magic allows you to use decorators to register Python classes and functions as components. You can use ZCML and Grok together if you wish.
es: Grok proporciona otra manera, donde un poco de magia Python permite usar decoradores para registrar clases Python y funciones como componentes. Usted puede usar tanto ZCML y Grok juntos si usted lo desea.

source: Some like Grok because it allows you to do nearly everything in your Python source files. No additional XML wiring required. If you're XML-allergic, Grok is your ticket to Python nirvana.
es: A algunos les gusta Grok porque le permite hacer casi todo en sus archivos de código fuente Python. No requiere cableado adicional XML. Si usted es alérgico a XML , Grok es su boleto al nirvana Python.

source: Not everybody loves Grok. Some parts of the Plone community think that there should only be one configuration language, others are against adding the relative big dependency of Grok to Plone. One real problem is the fact that you cannot customize components declared with grok with jbot (which we'll discuss later). Grok is not allowed in the Plone core for these reasons.
es: Tenga en cuenta que no todo el mundo le encanta Grok. Algunas partes de la comunidad Plone piensan que sólo puede haber un lenguaje de configuración, otros están en contra de añadir la gran dependencia relativa de Grok para Plone. Un problema real es el hecho de que no se puede personalizar componentes declarados con Grok con técnicas ``jbot`` (del que hablaremos más adelante). Grok no está permitido en el núcleo de Plone por estas razones.

source: The choice to Grok or not to Grok is yours to make. In any case, if you start to write an extension that is reusable, convert your grok declarations to ZCML to get maximum acceptance.
es: La elección de Grok o no Grok es suya. En cualquier caso, si usted comienza a escribir una extensión que es reutilizable, convertir sus declaraciones Grok a ZCML para conseguir la máxima aceptación.

source: Personally, I just find it cumbersome but even for me as a developer it offers a nice advantage: thanks to ZCML, I hardly ever have a hard time to find what and where extensions or customizations are defined. For me, ZCML files are like a phone book.
es: Personalmente, me resulta engorroso, pero incluso para mí, como desarrollador, ofrece una buena ventaja: gracias a ZCML, casi nunca me resulta difícil encontrar qué y dónde están definidas las extensiones o personalizaciones. Para mí, los archivos ZCML son como una guía telefónica.

source: Old style
es: Viejo estilo

source: Limited use cases
es: Limitado casos de uso

source: Full of surprises
es: Lleno de sorpresas

source: The next thing is *GenericSetup*. As the name clearly implies, *GenericSetup* is part of CMF.
es: La próxima cosa es el *GenericSetup*. Como el nombre claramente implica, *GenericSetup* es parte del CMF.

source: GenericSetup is tough to master, I am afraid.
es: GenericSetup es difícil de dominar, yo le tengo miedo.

source: *GenericSetup* lets you define persistent configuration in XML files. *GenericSetup* parses the XML files and updates the persistent configuration according to the configuration. This is a step you have to run on your own!
es: *GenericSetup* le permite definir la configuración persistente en archivos XML. *GenericSetup* analiza los archivos XML y actualiza la configuración persistente según la configuración. ¡Este es un paso que tiene que correr por su cuenta!

source: You will see many objects in Zope or the ZMI that you can customize through the web. If they are well behaving, they can export their configuration via *GenericSetup* and import it again.
es: Verá muchos objetos en Zope o ZMI que puede personalizar a través de la web. Si se comportan bien, pueden exportar su configuración a través de *GenericSetup* y volver a importarla.

source: Typically you use *GenericSetup* to change workflows or add new content type definitions.
es: Normalmente, utiliza *GenericSetup* para cambiar los flujos de trabajo o Añadir evas definiciones de tipo de contenido.

source: GenericSetup profiles may also be built into Python packages. Every package that is listed on the add-on package list inside a Plone installation has a GS profile that details how it fits into Plone. Packages that are part of Plone itself may have GS profiles, but are excluded from the active/inactive listing.
es: Los perfiles de GenericSetup también pueden integrarse en paquetes de Python. Cada paquete incluido en la lista de paquetes de complementos dentro de una instalación Plone tiene un perfil GS que detalla cómo encaja en Plone. Los paquetes que forman parte de Plone pueden tener perfiles GS, pero se excluyen de la lista activa/inactiva.

source: Deprecated: Skin Folders
es: Obsoleto: Carpetas Skin

source: Very old style
es: Muy viejo estilo

source: Very quick
es: Muy rápido

source: Very unmaintainable
es: Muy inmantenible

source: Do you remember Acquisition? The Skin Folders extends the concepts of Acquisition. Your Plone site has a folder named ``portal_skins``. This folder has a number of sub folders. The ``portal_skins`` folder has a property that defines in which order Plone searches for attributes or objects in each sub folder.
es: ¿Recuerdas Acquisition? Las Skin Folders amplía los conceptos de Acquisition. Su sitio Plone tiene una carpeta llamada ``portal_skins``. Esta carpeta tiene varias subcarpetas. La carpeta ``portal_skins`` tiene una propiedad que define en qué orden Plone busca atributos u objetos en cada subcarpeta.

source: The Plone logo is in a skin folder.
es: El logo de Plone está en una carpeta de skin.

source: By default, your site has a ``custom`` folder, and items are first searched for in that folder.
es: Por defecto, su sitio tiene una carpeta ``custom``, y los elementos se buscan primero en esa carpeta.

source: To customize the logo, you copy it into the ``custom`` folder, and change it there. This way you can change templates, CSS styles, images and behavior, because a container may contain Python scripts.
es: Para personalizar el logotipo, cópielo en la carpeta ``custom`` y cámbielo allí. De esta forma puede cambiar plantillas, estilos CSS, imágenes y comportamiento, ya que un contenedor puede contener scripts de Python.

source: Skin-folder style customization may be accomplished TTW via the ZMI, or with add-on packages. Many older-style packages create their own skin folder and add it to the skin layer for Plone when installed.
es: La personalización del estilo de la Skin folder puede lograrse a través de la Web vía la ZMI o con paquetes adicionales. Muchos paquetes de estilo antiguo crean su propia skin folder y la añadan a la skin layer para Plone cuando está instalada.

source: This is deprecated technology.
es: Esta es una tecnología obsoleta.

source: The Features of Plone
es: Las características de Plone

source: In-depth user-manual: https://docs.plone.org/
es: En profundidad el manual de usuario (en idioma Español): https://old.plone.org/countries/ve/publicaciones/plone-para-usuarios-principiantes

source: See also: https://docs.plone.org/working-with-content/index.html
es: Ver también la versión original del manual (en idioma Ingles) en la siguiente dirección URL: https://docs.plone.org/working-with-content/index.html

source: Starting and Stopping Plone
es: Iniciando y Deteniendo Plone

source: We control Plone with a small script called "instance"::
es: Tenemos el control de Plone con un pequeño script llamado "instance"::

source: This starts Plone in foreground mode so that we can see what it is doing by monitoring console messages. This is an important development method. Note that when Plone is started in foreground mode, it is also automatically in development mode. Development mode gives better feedback, but is much slower, particularly on Windows.
es: Este script arranca Plone en el modo foreground para que podamos ver lo que está haciendo mediante el control de los mensajes de consola. Este es un método de desarrollo importante. Tenga en cuenta que cuando Plone se inicia en el modo foreground, es también automáticamente en el modo de desarrollo. Modo de desarrollo da una mejor respuesta, pero es mucho más lento, particularmente en Windows.

source: You can stop it by pressing :kbd:`ctrl + c`.
es: Usted puede detener el proceso presionando la combinación de teclas :kbd:`ctrl + c`.

source: Apart from the `fg` command the :program:`instance` script offers several more commands. `./bin/instance help` shows the list of available commands, `bin/instance help <command>` will give a short help for each command. Some commands you will use rather often are::
es: Además del comando `fg`, el script :program:`instance` ofrece varios comando adicionales. El comando `./bin/instance help` muestra la lista de comandos disponibles, el comando `bin/instance help <comando>` dará una breve ayuda para cada comando. Algunos comandos que usarás a menudo son los siguientes::

source: Depending on your computer, it might take up to a minute until Zope will tell you that it's ready to serve requests. On a decent laptop it should be running in under 15 seconds.
es: Dependiendo de su computadora, podría tomar hasta un minuto hasta que Zope le diga que está listo para atender las solicitudes. En una computadora portátil decente debería funcionar en menos de 15 segundos.

source: A standard installation listens on port 8080, so lets have a look at our Zope site by visiting http://localhost:8080
es: Una instalación estándar escucha en el puerto 8080, así que vamos a echar un vistazo a nuestro sitio Zope visitando la dirección URL http://localhost:8080

source: As you can see, there is no Plone site yet!
es: ¡Como puedes ver, todavía no hay ningún sitio de Plone!

source: We have a running Zope with a database but no content. But luckily there is a button to create a Plone site. Click on that button (login: admin, password: admin). This opens a form to create a Plone site. Use :samp:`Plone` as the site id.
es: Tenemos un Zope corriendo con una base de datos pero sin contenido. Pero afortunadamente hay un botón para crear un sitio Plone. Haga clic en ese botón (ingresando el usuario: admin, la contraseña: admin). Esto abre un formulario para crear un sitio Plone. Use :samp:`Plone` como el id del sitio.

source: You now have the option to select some add-ons before you create the site. Since we will use Dexterity from the beginning we select :guilabel:`Dexterity-based Plone Default Types`. This way even the initial content on our page will be built with Dexterity using the add-on :py:mod:`plone.app.contenttypes` which is the default in Plone 5.
es: Ahora tiene la opción de seleccionar algunos complementos antes de crear el sitio. Como usaremos Dexterity desde el principio, seleccionamos :guilabel:`Dexterity-based Plone Default Types`. De esta forma, incluso el contenido inicial en nuestra página se construirá con Dexterity utilizando el complemento :py:mod:`plone.app.contenttypes` que es el por defecto en Plone 5.

source: You will be automatically redirected to the new site.
es: Usted será automáticamente dirigido al nuevo sitio, al finalizar su creación.

source: By default Plone listens on port 8080. Look at http://localhost:8080
es: Por defecto Plone escucha en el puerto 8080. Observalor en http://localhost:8080

source: No Plone site yet! Create a new Plone site.
es: ¡No hay sitio de Plone todavía! Crea un nuevo sitio Plone.

source: Use :samp:`Plone` (the default) as the site id.
es: Use :samp:`Plone` (el predeterminado) con el id del sitio.

source: Plone has many message boxes. They contain important information. Read them and make sure you understand them!
es: Plone tiene muchos mensajes. Contienen información importante. ¡Léalos y asegúrese de entender su contenido!

source: Open the `bin/instance` script in your favorite editor. Now let's say you want Plone to listen on port 9080 instead of the default 8080. Looking at the script, how could you do this?
es: Abra el script `bin/instance` en su editor favorito. Ahora digamos que quieres que Plone escuche en el puerto 9080 en lugar del 8080 predeterminado. Mirando el script, ¿cómo podrías hacer esto?

source: At the end of the `bin/instance` script, you'll see the following code:
es: Al final del script `bin/instance`, verá el siguiente código:

source: The second to last line points to the configuration file your Plone instance is using. An absolute path is used so it might differ depending on the installation method. Open the `zope.conf` file in your editor and look for the section:
es: La penúltima línea apunta al archivo de configuración que está utilizando su instancia de Plone. Se utiliza una ruta absoluta, por lo que puede variar según el método de instalación. Abra el archivo `zope.conf` en su editor y busque la sección:

source: Change the address to 9080 and restart your instance.
es: Cambiar la dirección al puerto 9080 y reinicie su instancia Zope.

source: Knowing that `bin/instance debug` basically offers you a Python prompt, how would you start to explore Plone?
es: Sabiendo que le comando `bin/instance debug` básicamente le ofrece a usted un interprete Python, ¿cómo comenzarías a explorar Plone?

source: Use `locals()` or `locals().keys()` to see Python objects available in Plone
es: Use `locals()` o `locals().keys()` para ver los objetos Python disponible en Plone

source: The `app` object you encountered in the previous exercise can be seen as the root of Plone. Once again using Python, can you find your newly created Plone site?
es: El objeto `app` que encontraste en el ejercicio anterior se puede ver como la raíz de Plone. Una vez más usando Python, ¿puede encontrar su sitio Plone recién creado?

source: `app.__dict__.keys()` will show `app`'s attribute names - there is one called `Plone`, this is your Plone site object. Use `app.Plone` to access and further explore it.
es: El diccionario `app.__dict__.keys()` mostrará los nombres de atributo de `app` - hay uno llamado `Plone`, este es su objeto de sitio Plone. Use `app.Plone` para acceder y explorar más a fondo.
