Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: For the training we will use option 2 and 4 to install and run Plone.
es: Para el entrenamiento usaremos la opción 2 y 4 para instalar y ejecutar Plone.

source: Hosting Plone
es: Alojando en Plone

source: If you want to host a real live Plone site yourself then running it from your laptop is not a viable option.
es: Si usted desea alojando un sitio real de Plone por si mismo entonces ejecutarlo desde su computadora portátil no es una opción viable.

source: You can host Plone...
es: Puede alojar Plone...

source: with one of many professional `hosting providers <http://plone.com/providers>`_
es: con uno de los muchos `proveedores de alojamiento <http://plone.com/providers>`_

source: on a virtual private server
es: en un servidor privado virtual

source: on dedicated servers
es: en los servidores dedicados

source: on `Heroku <https://www.heroku.com>`_ you can run Plone for *free* using the `Heroku buildpack for Plone <https://github.com/plone/heroku-buildpack-plone>`_
es: en `Heroku <https://www.heroku.com>`_ usted puede ejecutar Plone de forma *gratuita* usando el `Heroku buildpack para Plone <https://github.com/plone/heroku-buildpack-plone>`_

source: Plone Installation Requirements: https://docs.plone.org/manage/installing/requirements.html
es: Requerimientos de la instalación de Plone: https://docs.plone.org/manage/installing/requirements.html

source: Run Plone on a 5$ plan: https://www.stevemcmahon.com/steves-blog/plone-on-5-a-month
es: Ejecute Plone en un plan de 5$ https://www.stevemcmahon.com/steves-blog/plone-on-5-a-month

source: Where to host Plone: https://old.plone.org/documentation/faq/where-can-i-host-my-plone-site
es: Dónde alojar Plone: https://old.plone.org/documentation/faq/where-can-i-host-my-plone-site

source: Production Deployment
es: Despliegue en ambientes de producción

source: The way we are setting up a Plone site during this class may be adequate for a small site — or even a large one that's not very busy — but you are likely to want to do much more if you are using Plone for anything demanding.
es: La manera en que estamos montando un sitio Plone durante esta clase puede ser adecuado para un sitio pequeño - o incluso uno muy grande que no está muy ocupado - pero es muy probable que desee hacer mucho más si estás usando Plone para ninguna demanda.

source: Using a production web server like Apache or Nginx for URL rewriting, SSL and combining multiple, best-of-breed solutions into a single web site.
es: El uso de un servidor web de producción como Apache o Nginx para la reescritura de URL, SSL y combinación de múltiples, las mejores soluciones de su clase todo en un solo sitio web.

source: Reverse proxy caching with a tool like Varnish to improve site performance.
es: El almacenamiento en caché de proxy inverso con una herramienta como Varnish para mejorar el rendimiento del sitio.

source: Load balancing to make best use of multiple core CPUs and even multiple servers.
es: El balanceo de carga para hacer el mejor uso de los múltiple CPU del núcleo e incluso múltiples servidores.

source: Optimizing cache headers and Plone's internal caching schemes with plone.app.caching.
es: Optimización cabeceras de caché y esquemas de caché interna de Plone con el paquete plone.app.caching.

source: And, you will need to learn strategies for efficient backup and log file rotation.
es: Y, usted necesita aprender adicionalmente estrategias eficientes para la copia de seguridad y rotación del archivo de los registros.

source: All these topics are introduced in `Guide to deploying and installing Plone in production <https://docs.plone.org/manage/deploying/index.html>`_.
es: Todos esos tópicos son introducidos en la `Guía para desplegar e instalar Plone en ambientes de producción <https://docs.plone.org/manage/deploying/index.html>`_.

source: Introduction
es: Introducción

source: Who are you?
es: ¿Quien eres tu?

source: Tell us about yourselves:
es: Cuéntenos acerca de usted:

source: Name, company, country...
es: Nombre, compañía, país...

source: What is your Plone experience?
es: ¿Como ha sido tu experiencia en Plone?

source: What is your web development experience?
es: ¿Cual ha sido tu experiencia en desarrollo de aplicaciones?

source: What are your expectations for this tutorial?
es: ¿Cuales son tus expectativas con este tutorial?

source: What is your favorite text editor?
es: ¿Cual es tu editor favorito?

source: If this training will include the development chapters:
es: Si este entrenamiento incluirá los capítulos de desarrollo:

source: Do you know the HTML of the output of this?
es: ¿Conoces el código HTML de la salida de esto?

source: The answer is::
es: La respuesta es::

source: Do you know what the following would return?::
es: ¿Usted sabe lo que podría retornar el siguiente código python?::

source: What will we do?
es: ¿Qué haremos?

source: Some technologies and tools we use during the training:
es: Algunas tecnologías y herramientas que usaremos en el entrenamiento:

source: For the beginning training:
es: Para el entrenamiento básico o principiante:

source: Through-the-web (TTW)
es: A través de la Web (TTW)

source: A little XML
es: Un poco de XML

source: A little Python
es: Un poco de Python

source: For the advanced chapters:
es: Para los capítulos avanzados:

source: `Try Git (Nice introduction to git and github) <https://try.github.io/levels/1/challenges/1>`_
es: `Prueba Git (Una introducción agradable para git y github) <https://try.github.io/levels/1/challenges/1>`_

source: `Testing <https://docs.plone.org/external/plone.app.testing/docs/source/index.html>`_
es: `Pruebas <https://docs.plone.org/external/plone.app.testing/docs/source/index.html>`_

source: `References/Relations <https://docs.plone.org/external/plone.app.dexterity/docs/advanced/references.html>`_
es: `Referencias/Relaciones <https://docs.plone.org/external/plone.app.dexterity/docs/advanced/references.html>`_

source: What will we not do?
es: ¿Qué no haremos?

source: We will not cover the following topics:
es: Nosotros no cubriremos los siguientes tópicos:

source: `Theming <https://docs.plone.org/adapt-and-extend/theming/index.html>`_
es: `Temas <https://docs.plone.org/adapt-and-extend/theming/index.html>`_

source: `i18n and locales <https://docs.plone.org/develop/plone/i18n/index.html>`_
es: `i18n y locales <https://docs.plone.org/develop/plone/i18n/index.html>`_

source: `Deployment, Hosting and Caching <https://docs.plone.org/manage/deploying/index.html>`_
es: `Desarrollo, hosting y cacheo de contenidos <https://docs.plone.org/manage/deploying/index.html>`_

source: Other topics are only covered lightly:
es: Otros tópicos están ligeramente cubiertos:

source: `Zope Component Architecture <https://docs.plone.org/develop/addons/components/index.html>`_
es: `Arquitectura de componentes Zope <https://docs.plone.org/develop/addons/components/index.html>`_

source: `Security <https://docs.plone.org/develop/plone/security/index.html>`_
es: `Seguridad <https://docs.plone.org/develop/plone/security/index.html>`_

source: `Permissions <https://docs.plone.org/develop/plone/security/permissions.html>`_
es: `Permisos <https://docs.plone.org/develop/plone/security/permissions.html>`_

source: `Performance and Caching <https://docs.plone.org/manage/deploying/testing_tuning/performance/index.html>`_
es: `Desempeño y Cacheo de contenidos <https://docs.plone.org/manage/deploying/testing_tuning/performance/index.html>`_

source: What to expect
es: ¿Qué esperar?

source: At the end of the first two days of training, you'll know many of the tools required for Plone installation, integration and configuration.
es: Al finalizar de los dos primeros días de entrenamiento, usted sabrá muchas de las herramientas requeridas para la instalación, integración y configuración de Plone.

source: You'll be able to install add-on packages and will know something about the technologies underlying Plone and their histories.
es: Usted estará habilitado para instalar paquetes complementos y sabrá algunas cosas sobre las tecnologías bajo Plone y sus historias.

source: At the end of the second two days, you won't be a complete professional Plone-programmer, but you will know some of the more powerful features of Plone and should be able to construct a more complex website with custom themes and packages.
es: Al final de los segundos dos días, usted no será un completo programador profesional de Plone, pero conocerá algunas de las características más potentes de Plone y debe ser capaz de construir un sitio web más Plone y debería ser capaz de construir un sitio web más complejo con temas y paquetes personalizados.

source: You should also be able to find out where to look for instructions to do tasks we did not cover. You will know most of the core technologies involved in Plone programming.
es: Usted debe también ser capaz de encontrar dónde buscar instrucciones para hacer tareas que no cubrimos en este entrenamiento. Usted conocerá la mayoría de las principales tecnologías de núcleo involucradas en la programación de Plone.

source: If you want to become a professional Plone developer or a highly sophisticated Plone integrator you should definitely read `Martin Aspeli's book <https://www.packtpub.com/web-development/professional-plone-4-development>`_ and then re-read it again while actually doing a complex project.
es: Si usted quiere ser un desarrollador profesional en Plone o un alto integrador sofisticado de Plone usted debería definitivamente leer el `libro de Martin Aspeli <https://www.packtpub.com/web-development/professional-plone-4-development>`_ y volverlo a leerlo mientras actualmente hace un proyecto complejo.

source: Classroom Protocol
es: Protocolo del salón de clase

source: Stop us and ask questions when you have them!
es: ¡Puede detenernos y pregunte cuando tenga alguna duda!

source: Tell us if we speak too fast, too slow or not loud enough.
es: Díganos si hablamos muy rápido, para frenar o no ser lo suficientemente fuerte.

source: One of us is always there to help you if you are stuck. Please give us a sign if you are stuck.
es: Uno de nosotros siempre está ahí para ayudarle si usted está atascado. Por favor, danos una señal si usted está atascado.

source: We'll take some breaks, the first one will be at XX.
es: Vamos a hacer algunas pausas, la primera será a las XX.

source: Where is food, restrooms
es: ¿Dónde está la comida, los baños?

source: Someone please record the time we take for each chapter (incl. title)
es: Por favor, alguien tome el tiempo que tomemos para cada capítulo (título incluido)

source: Someone please write down errors
es: Por favor, alguien puede indicar si hay errores

source: Contact us after the training: team@starzel.de
es: Contactanos después del entrenamiento: team@starzel.de

source: **Questions to ask:**
es: **Preguntas que hacer:**

source: What did you just say?
es: ¿Que acabas de decir?

source: Please explain what we just did again?
es: Por favor, ¿puedes explicar lo que acabamos de hacer otra vez?

source: How did that work?
es: ¿Cómo funcionó eso?

source: Why didn't that work for me?
es: ¿Por qué eso no funcionó para mí?

source: Is that a typo?
es: ¿Es eso un error tipográfico?

source: **Questions __not__ to ask:**
es: **Preguntas para __no__ preguntar:**

source: **Hypotheticals**: What happens if I do X?
es: ¿**Hipotéticos**: ¿Qué sucede si hago X?

source: **Research**: Can Plone do Y?
es: ¿**Investigación**: ¿Puede Plone hacer Y?

source: **Syllabus**: Are we going to cover Z in class?
es: ¿**Plan de estudios**: ¿Vamos a cubrir Z en clase?

source: **Marketing questions**: please just don't.
es: **Preguntas de mercadeo**: por favor no lo haga.

source: **Performance questions**: Is Plone fast enough?
es: ¿**Preguntas de rendimiento**: ¿es Plone lo suficientemente rápido?

source: **Unpythonic**: Why doesn't Plone do it some other way?
es: ¿**Anti-pytonico**: ¿Por qué Plone no lo hace de otra manera?

source: **Show off**: Look what I just did!
es: **Presumir**: ¡mira lo que acabo de hacer!

source: Documentation
es: Documentación

source: Follow the training at https://training.plone.org/5
es: Seguir el entrenamiento en la dirección URL https://training.plone.org/5

source: You can use this presentation to copy & paste the code but you will memorize more if you type yourself.
es: Usted puede utilizar esta presentación para copiar y pegar el código, pero usted memorizará más si escribe usted mismo.

source: Further Reading
es: Lecturas recomendadas

source: `Zope Page Templates Reference <https://zope.readthedocs.io/en/latest/zope2book/AppendixC.html>`_
es: `Referencia de Zope Page Templates <https://zope.readthedocs.io/en/latest/zope2book/AppendixC.html>`_

source: Optional
es: Opcional

source: ZCA in depth
es: ZCA en profundidad

source: More and more complex fields
es: Más y más complejo campos

source: Custom edit forms
es: Formularios editables personalizados

source: Users, authentication, member profiles, LDAP
es: Usuarios, autenticación, perfiles de miembros, LDAP

source: Caching (plone.app.caching)
es: Caché de contenidos (plone.app.caching)

source: Migrations
es: Migraciones

source: Asynchronous processing
es: Procesamiento asíncrono

source: Talking with external APIs
es: Hablando con API externas

source: Professional Deployment
es: Despliegue profesional

source: What's New in Plone 5 and 5.1
es: ¿Qué hay de nuevo en Plone 5 y 5.1?

source: Plone 5.0 was released in September 2015 and is the currently at version 5.0.8 main version if Plone. Plone 5 was a mayor release, that changed the content type framework, the user interface and the default design.
es: Plone 5.0 fue lanzado en septiembre de 2015 y actualmente se encuentra en la versión principal de la versión 5.0.8 si Plone. El lanzamiento de Plone 5 fue un lanzamiento mayor, que cambió el marco de tipo de contenido, la interfaz de usuario y el diseño predeterminado.

source: Plone 5.1 will be released in October 2017 and holds a couple of smaller improvements.
es: Plone 5.1 se lanzará en Octubre de 2017 y tiene un par de mejoras más pequeñas.

source: If you are already familiar with Plone 5 and 5.1 you can skip this section.
es: Si ya está familiarizado con Plone 5 y 5.1, puede omitir esta sección.

source: Default Theme
es: Tema predeterminado

source: The new default theme is called `Barceloneta <https://github.com/plone/plonetheme.barceloneta/>`_
es: El nuevo tema por defecto es llamado `Barceloneta <https://github.com/plone/plonetheme.barceloneta/>`_

source: It is a Diazo theme, meaning it uses :py:mod:`plone.app.theming` to insert the output of Plone into static html/css.
es: Es un tema de Diazo, lo que significa que utiliza el paquete :py:mod:`plone.app.theming` para insertar la salida de Plone en recursos estáticos html/css.

source: It uses html5, so it uses ``<header>``, ``<nav>``, ``<aside>``, ``<section>``, ``<article>`` and ``<footer>`` for semantic html.
es: Ese tema usa el lenguaje html5, entonces utilice las etiquetas ``<header>``, ``<nav>``, ``<aside>``, ``<section>``, ``<article>`` y ``<footer>`` para el html semántico.

source: The theme is mostly built with `LESS <http://lesscss.org/>`_ (lots of it!) and uses the same grid system as `bootstrap <http://getbootstrap.com/css/#grid>`_. This means you can use css classes like ``col-xs-12 col-sm-9`` to control the width of elements for different screen-sizes. If you prefer a different grid-system (like `foundation <https://foundation.zurb.com/sites/docs/grid.html>`_) over bootstrap you can adapt the theme to use that.
es: El tema se construye principalmente con `LESS <http://lesscss.org/>`_ (¡muchos archivos LESS!) y usa el mismo sistema de cuadrícula que el framework `bootstrap <http://getbootstrap.com/css/#grid>`_. Esto significa que puede usar clases css como ``col-xs-12 col-sm-9`` para controlar el ancho de los elementos para diferentes tamaños de pantalla. Si prefiere un sistema de grillas diferente (como el framework `foundation <https://foundation.zurb.com/sites/docs/grid.html>`_) sobre bootstrap, puede adaptar el tema para usarlo.

source: The `index.html <https://github.com/plone/plonetheme.barceloneta/blob/master/plonetheme/barceloneta/theme/index.html>`_ and `rules.xml <https://github.com/plone/plonetheme.barceloneta/blob/master/plonetheme/barceloneta/theme/rules.xml>`_ are actually not that complicated. Have a look at them.
es: El archivo `index.html <https://github.com/plone/plonetheme.barceloneta/blob/master/plonetheme/barceloneta/theme/index.html>`_ y el archivo `rules.xml <https://github.com/plone/plonetheme.barceloneta/blob/master/plonetheme/barceloneta/theme/rules.xml>`_ en realidad no son tan complicados. Míralos.

source: The following example from :file:`rules.xml` makes sure that the banner saying *"Welcome! Plone 5 rocks!"* is only visible on the frontpage:
es: ¡El siguiente ejemplo de :file:`rules.xml` asegura que el banner que dice *"¡Bienvenido! ¡Plone 5 rocks!"* Solo está visible en la página principal:

source: The browser-view ``@@hero`` (you can find it by searching all ZCML-files for ``name="hero"``) is only included when the body-tag of the current page has the css-classes ``template-document_view`` and ``section-front-page``.
es: La vista de navegador ``@@hero`` (puede encontrarla buscando todos los archivos ZCML para ``name="hero"``) solo se incluye cuando la etiqueta de cuerpo de la página actual tiene las clases css ``template-document_view`` y ``section-front-page``.

source: New UI and widgets
es: Nueva interfaz de usuario - UI y widgets

source: The green edit bar is replaced by a toolbar that is located on the left or top and can be expanded. The design of the toolbar is pretty isolated from the theme and it should not break if you use a different theme.
es: La barra de edición verde se reemplaza por una barra de herramientas que se encuentra a la izquierda o arriba y se puede expandir. El diseño de la barra de herramientas está bastante aislado del tema y no debería romperse si usa un tema diferente.

source: The widgets where you input data are also completely rewritten.
es: Los widgets donde usted ingresa datos también se reescribieron por completo.

source: We now use the newest TinyMCE
es: Ahora usamos la más nueva versión de TinyMCE

source: The tags (keywords) widget and the widgets where you input usernames now use `select2 <http://select2.github.io>`_ autocomplete to give a better user experience
es: El widget de etiquetas (palabras clave) y los widgets donde ingresa los nombres de usuario ahora usan la biblioteca de auto-completar `select2 <http://select2.github.io>`_ para brindar una mejor experiencia de usuario

source: The related-items widget is a complete rewrite
es: El widget de elementos relacionados es una reescritura completa

source: Folder Contents
es: Contenidos de carpeta

source: The view to display the content of a folder is new and offers many new features:
es: La vista para mostrar el contenido de una carpeta es nueva y ofrece muchas nuevas características:

source: configurable table columns
es: columnas de la tabla configurables

source: changing properties of multiple items at once
es: cambiar las propiedades de varios elementos a la vez

source: querying (useful for folders with a lot of content)
es: la consulta (útil para carpetas con mucho contenido)

source: persistent selection of items
es: persistente selección de elementos

source: Content Types
es: Tipos de Contenido

source: All default types are based on Dexterity. This means you can use behaviors to change their features and edit them through the web. Existing old content can be migrated to these types.
es: Todos los tipos predeterminados se basan en Dexterity. Esto significa que puede usar comportamientos para cambiar sus características y editarlas a través de la web. El contenido anterior existente se puede migrar a estos tipos de contenido.

source: Resource Registry
es: Registros de Recursos

source: The resource registry allows you to configure and edit the static resources (js, css) of Plone. It replaces the old javascript and css registries. And it can be used to customize the theme by changing the variables used by LESS or overriding LESS files.
es: El registro de recursos le permite configurar y editar los recursos estáticos (js, css) de Plone. Ese reemplaza los viejos registros javascript y css. Y se puede usar para personalizar el tema cambiando las variables utilizadas por LESS o sobrescribiendo los archivos LESS.

source: Chameleon template engine
es: Motor de plantilla Chameleon

source: `Chameleon <https://chameleon.readthedocs.io/en/latest/>`_ is the new rendering engine of Plone 5. It offers many improvements:
es: `Chameleon <https://chameleon.readthedocs.io/en/latest/>`_ es el nuevo motor de renderización de Plone 5. Ese ofrece muchas mejoras:

source: Old syntax:
es: Antigua sintaxis:

source: New (additional) syntax:
es: Nueva (adicional) sintaxis:

source: Template debugging:
es: Depuración de plantillas:

source: You can now put a full-grown ``pdb`` in a template.
es: Ahora puede poner un ``pdb`` adulto en una plantilla.

source: For debugging check out the variable :py:obj:`econtext`, it holds all the current elements.
es: Para la depuración echa un vistazo a la variable :py:obj:`econtext`, contiene todos los elementos actuales.

source: You can also add real Python blocks inside templates.
es: También puede añadir bloques reales de Python dentro de las plantillas.

source: Don't overdo it!
es: ¡No te excedas!

source: Control panel
es: Panel de control

source: You can finally upload a logo in ``@@site-controlpanel``.
es: Finalmente puede subir un logotipo en ``@@site-controlpanel``.

source: All control panels were moved to z3c.form
es: Todos los paneles de control se movieron al paquete z3c.form

source: Many small improvements
es: Muchas pequeñas mejoras

source: Date formatting on the client side
es: Formato de fecha en el lado del cliente

source: Using the js library moment.js the formatting of dates was moved to the client.
es: Utilizando la biblioteca javascript moment.js, el formato de las fechas se movió al cliente.

source: returns
es: devuelve

source: Today at 3:24 PM
es: Hoy a las 3:24 PM

source: `plone.app.multilingual <https://github.com/plone/plone.app.multilingual>`_ is the new default add-on for sites in more than one language.
es: `plone.app.multilingual <https://github.com/plone/plone.app.multilingual>`_ es el nuevo complemento por defecto para sitios de más de un idioma.

source: New portlet manager
es: Nuevo administrador portlet

source: ``plone.footerportlets`` is a new place to put portlets. The footer (holding the footer, site_actions, colophon) is now built from portlets. This means you can edit the footer TTW.
es: ``plone.footerportlets`` es un nuevo lugar para poner portlets. El pie de página (que contiene el pie de página, site_actions, colophon) ahora se crea a partir de portlets. Esto significa que puede editar el pie de página a través de la Web.

source: There is also a useful new portlet type :guilabel:`Actions` used for displaying the site_actions.
es: También hay un nuevo tipo de portlet útil :guilabel:`Actions` utilizado para mostrar las site_actions.

source: Remove portal_skins
es: Remover portal_skins

source: Many of the old skin templates were replaced by real browser views.
es: Muchas de las viejas plantillas de skin fueron reemplazadas por browser views reales.

source: Plone 5.1 holds a long list of incremental improvements. But none really changes the way you develop for Plone. Here are three noteworthy changes:
es: Plone 5.1 tiene una larga lista de mejoras incrementales. Pero ninguna realmente cambia la forma en que te desarrollas para Plone. Aquí hay tres cambios notables:
