Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Add decorative banners and sliders
es: Añada pancartas decorativas y persianas deslizantes

source: Allows developers with a little knowledge of HTML and a little knowledge of Python to implement custom elements and insert them anywhere they want.
es: Permite a los desarrolladores con un poco de conocimiento de HTML y un poco de conocimiento de Python implementar elementos personalizados e insertarlos donde quieran en Plone.

source: Powerful and flexible web-based application builder for Plone
es: Un poderoso y flexible constructor de aplicaciones basado en Web para Plone

source: Integrates the Disqus commenting platform API into Plone
es: Integra la API de la plataforma de comentarios Disqus en Plone

source: Photo galleries with a huge selection of various js-libraries.
es: Galerías de fotos con una gran selección de varias bibliotecas javascript.

source: How to find add-ons
es: ¿Como buscar complementos?

source: It can be very hard to find the right addon for your requirements. Here are some tips:
es: Puede ser muy difícil encontrar el complemento adecuado para sus necesidades. A continuación aquí hay algunos consejos a tomar en cuenta:

source: Make a list of required features. You'll almost never find an add-on that exactly ﬁts your needs.
es: Haga una lista de las características requeridas. Casi nunca encontrará un complemento que se ajuste exactamente a sus necesidades.

source: Either adapt your requirements to what is available, invest the time & money to modify an existing addons to ﬁt your needs or create a new addon that does exactly what you need.
es: Adapte sus requisitos a lo que está disponible, invierta el tiempo y el dinero para modificar los complementos existentes para satisfacer sus necesidades o cree un nuevo complemento que haga exactamente lo que necesita.

source: Then search using the following links below.
es: Entonces busque usando los siguientes enlaces.

source: https://pypi.org >3400 Plone related packages - use the search form!
es: https://pypi.org ¡más de 3400 paquetes relacionados con Plone - use el formulario de búsqueda!

source: https://github.com/collective >1500 repos
es: https://github.com/collective ¡más de 1500 repositorios de paquetes relacionados con Plone!

source: https://github.com/plone >310 repos
es: https://github.com/plone ¡más de 310 repositorios de paquetes relacionados con Plone!

source: google (e.g. `Plone+Slider <http://lmgtfy.com/?q=plone+slider>`_)
es: navegando en google (ej. `Plone+Slider <http://lmgtfy.com/?q=plone+slider>`_)

source: Once you have a shortlist test these addons. Here are the main issues you need to test before you install a addon on a production site:
es: Una vez que tenga una lista corta, pruebe estos complementos. Estos son los principales problemas que debe comprobar que no sucedan antes de instalar un complemento en un sitio de producción:

source: Test all required features. Read but do not trust the documentation
es: Pruebe todas las características requeridas. Lea pero no confíe en la documentación

source: Check if the addon runs on your required version and is currently maintained
es: Compruebe si el complemento se ejecuta en su versión requerida y si actualmente es mantenido

source: Does it have i18n-support, i.e. is the user-interface translated to your language?
es: ¿Tiene soporte a internacionalización - i18n?, es decir, la interfaz de usuario se ha traducido a su idioma

source: Does it uninstall cleanly? A tough one. See http://blog.keul.it/2013/05/how-to-make-your-plone-add-on-products.html for the reason why.
es: ¿Se desinstala limpiamente? Una difícil. Vea el siguiente artículo http://blog.keul.it/2013/05/how-to-make-your-plone-add-on-products.html para ese motivo.

source: Check for unwanted dependencies
es: Verificar dependencias no deseadas

source: Once you found an addon you like you should ask the community if you made a good choice or if you missed something:
es: Una vez que encuentre un complemento que le guste, debe preguntarle a la comunidad si hizo una buena elección o si se perdió algo en los siguientes recursos:

source: Message Board: https://community.plone.org
es: Foros de mensajes: https://community.plone.org

source: Chat: https://plone.org/support/chat
es: Sala de Chat: https://plone.org/support/chat

source: There is also a talk that discusses in depth how to find the right addon: https://www.youtube.com/watch?v=Sc6NkqaSjqw
es: También hay una charla en un video de YouTube que analiza en profundidad cómo encontrar el complemento correcto: https://www.youtube.com/watch?v=Sc6NkqaSjqw

source: Installing Add-ons
es: Instalando complementos

source: Installation is a two-step process.
es: La instalación es un proceso de dos pasos.

source: Making the add-on packages available to Zope
es: Haciendo los paquetes complementos disponibles para Zope

source: First, we must make the add-on packages available to Zope. This means that Zope can import the code. Buildout is responsible for this.
es: Primero, debemos asegurarnos que los paquetes complementos estén disponible para Zope. Esto significa, que Zope puede importar el código. Buildout es responsable de esto.

source: Look at the :file:`buildout.cfg` file in :file:`/vagrant/buildout`.
es: Busque el archivo :file:`buildout.cfg` en el directorio :file:`/vagrant/buildout`.

source: If you're using our Vagrant kit, the Plone configuration is available in a folder that is shared between the host and guest operating systems. Look in your Vagrant install directory for the :file:`buildout` folder. You may edit configuration files using your favorite text editor in the host operating system, then switch into your virtual machine to run buildout on the guest operating system.
es: Si estás utilizando nuestro kit Vagrant, la configuración Plone está disponible en una carpeta que se comparte entre los sistemas operativos anfitrión y huésped. Busque en su directorio de instalación Vagrant la carpeta :file:`buildout`. Puede editar los archivos de configuración utilizando su editor de texto favorito en el sistema operativo huésped, luego cambiar en la máquina virtual para ejecutar buildout en el sistema operativo huésped.

source: In the section ``[instance]`` there is a variable called ``eggs``, which has a list of *eggs* as a value. For example::
es: En la sección ``[instance]`` existe una variable llamada ``eggs``, la cual tiene una lista de *eggs* como valor. Por ejemplo::

source: You add an egg by adding a new line containing the package name to the configuration. You must write the egg name indented: this way, buildout understands that the current line is part of the last variable and not a new variable.
es: Generalmente, uno añada los paquetes eggs ingresando una linea adicional por cada paquete egg en la configuración. Debes escribir el nombre del paquete egg de forma indentada: así el buildout entiende que la linea actual es parte de la ultima variable y no una nueva variable.

source: If you add new add-ons here you will have to run buildout and restart the site:
es: Si añades nuevos complementos tendrás que ejecutar buildout y reiniciar el sitio:

source: Now the code is available from within Plone.
es: Ahora el código fuente del complemento está disponible desde dentro de Plone.

source: Installing add-ons in your Plone Site
es: Instalando complementos en su sitio de Plone

source: Your Plone site has not yet been told to use the add-on. For this, you have to activate the add-on in your Plone Site.
es: A su sitio de Plone aun no se le ha indicado usar el complemento. Para esto debes activar los complementos en su sitio de Plone.

source: Why the extra step of activating the add-on package? You may have multiple Plone sites in a single Zope installation. It's common to want to activate some add-ons in one site, others in another.
es: ¿Por qué el paso adicional de activar el paquete complemento? Usted quizás tiene varios sitios Plone en una única instalación de Zope. Es normal que desee activar algunos complementos en un sitio, otros complementos en otro sitio.

source: In your browser, go to Site Setup (shortcut: add ``/@@overview-controlpanel`` to the Plone site URL), and open the ``Add-ons`` Panel. You will see that you can install the add-ons there.
es: En el navegador, vaya a Configuración del sitio (atajo: añada ``/@@overview-controlpanel`` en su dirección URL del sitio Plone), y abra el panel ``Complementos`` allí. Usted verá que puede instalar los complementos disponibles.

source: Install EasyForm (the human-readable name of :py:mod:`collective.easyform`) now.
es: Instalar EasyForm (el nombre humano legible del complemento :py:mod:`collective.easyform`) ahora.

source: This is what happens: The GenericSetup profile of the product gets loaded. This does things like:
es: Esto es lo que sucede: el perfil GenericSetup del complemento se ha cargado. Esto hace cosas como:

source: Configuring new actions
es: Configurando nuevas acciones

source: Registering new content types
es: Registrando nuevos tipos de contenido

source: Registering css and js files
es: Registrando archivos css y javascript

source: Creating some content/configuration objects in your Plone site.
es: Creando algunos objetos contenidos/configuración en su sitio de Plone.

source: Let's have a look at what we just installed.
es: Miremos lo que hemos instalado.

source: There are many ways to create forms in Plone:
es: Hay muchas formas de crear formularios en Plone:

source: Pure: html and python in a BrowserView
es: Puro: html y python en una BrowserView

source: Framework: :py:mod:`z3c.form`
es: Framework: usando el paquete :py:mod:`z3c.form`

source: TTW: :py:mod:`Products.PloneFormGen` and :py:mod:`collective.easyform`
es: A través de la Web: usando los complementos :py:mod:`Products.PloneFormGen` y :py:mod:`collective.easyform`

source: The concept of :py:mod:`collective.easyform` is that you add a form, to which you add form fields as schema-fields exactly like the dexterity schema-editor. Fields are added, deleted, edited and moved just as with any other type of content. Form submissions may be automatically emailed and/or saved for download.
es: El concepto básico del complemento :py:mod:`collective.easyform` es que usted añada un formulario el cual usted pueda añadir campos de formularios como campos esquemas exactamente como el editor de esquemas dexterity. Los campos son añadidos, eliminados, editados y mueven al igual que con cualquier otro tipo de contenido. Los envíos de formularios pueden ser enviados de forma automática por correo electrónico y/o guardarse para descargar.

source: Let's build a registration form:
es: Vamos a construir un formulario de registro:

source: Add an object of the new type 'EasyForm' in the site root. Call it "Registration"
es: Añada un objeto del nuevo tipo 'EasyForm' en el raíz del sitio. Llamándolo "Registro"

source: Save and view the result, a simple contact form that we may customize
es: Guarde y vea el resultado, un sencillo formulario de contacto el cual puede personalizar

source: In the `Actions` Menu click on "Define form fields"
es: En el menú `Actions`, haga clic en" Definir campos de formulario"

source: Remove field "comments"
es: Remueva el campo "comments"

source: Add fields for food preference (a choice field) and shirt size (also choice)
es: Añada campos para preferencia de comida (un campo de elección) y el tamaño de la camisa (también elección)

source: In the `Actions` Menu click on "Define form actions"
es: En el menú `Actions`, haga clic en "Definir acciones de formulario"

source: Add a new action and select "Save Data" as the type. This stores all entered data.
es: Añada una nueva acción y seleccione "Guardar datos" como el tipo. Esto almacena todos los datos ingresados.

source: Customize the mailer
es: Personalizar el script de envío de correo

source: Need CAPTCHAs? Read the `instructions how to add Recapcha-field to easyform <https://github.com/collective/collective.easyform#recaptcha-support>`_
es: ¿Necesitas CAPTCHAs? Lea las `instrucciones de cómo añadir campo Recaptcha a su formulario easyform <https://github.com/collective/collective.easyform#recaptcha-support>`_

source: Add Photo Gallery with :py:mod:`collective.plonetruegallery`
es: Añadir Galerías de fotos con el complemento :py:mod:`collective.plonetruegallery`

source: To advertise the conference we want to show some photos showing past conferences and the city where the conference is taking place.
es: Para promocionar la conferencia queremos mostrar algunas fotos mostrando conferencias pasadas y la ciudad donde la conferencia se esta realizando.

source: Instead of creating new content types for galleries, it integrates with the Plone functionality to choose different views for folderish content types.
es: En vez de crear tipos de contenido personalizados para galerías, esta funcionalidad se integra con la funcionalidad de Plone para elegir diferentes vistas de tipos de contenidos en carpeta.

source: Activate the add-on
es: Activar el complemento

source: Enable the behavior ``Plone True Gallery`` on the type ``Folder``: http://localhost:8080/Plone/dexterity-types/Folder/@@behaviors
es: Habilite el comportamiento ``Plone True Gallery`` en el tipo ``Carpeta``: en la siguiente dirección URL http://localhost:8080/Plone/dexterity-types/Folder/@@behaviors

source: Add a folder ``/the-event/location``
es: Añada una carpeta ``/el-evento/ubicacion``

source: Upload some photos from lorempixel.com
es: Suba algunas fotos desde la dirección URL http://lorempixel.com/600/400/city/

source: Enable the view ``galleryview``
es: Habilite la vista ``galleryview`` en el menú ``Mostrar``

source: Internationalization
es: Internacionalización

source: Plone can run the same site in many different languages.
es: Plone puede ejecutar el mismo sitio en múltiples lenguajes.

source: We're not doing this with the conference site since the *lingua franca* of the Plone community is English.
es: No estamos haciendo esto con el sitio de la conferencia ya que la *lengua franca* de la comunidad Plone es el Ingles.

source: We would use the built-in addon https://pypi.org/project/plone.app.multilingual for this.
es: Utilizaríamos el complemento incorporado https://pypi.org/project/plone.app.multilingual para esto.

source: Building a multi-lingual site requires activating :py:mod:`plone.app.multilingual`, but no add-on is necessary to build a site in only one language. Just select a different site language when creating a Plone site, and all text in the user-interface will be switched to that language.
es: La construcción de un sitio plurilingüe exige activar el complemento :py:mod:`plone.app.multilingual`, pero no es necesario un complemento para construir un sitio en un solo idioma que no sea Inglés. Simplemente seleccione un idioma de sitio diferente al crear un sitio Plone y todo el texto de la interfaz de usuario cambiará a ese idioma.

source: Summary
es: Resumen

source: You are now able to customize and extend many parts of our website. You can even install extensions that add new functionality.
es: Ahora somos capaces de personalizar y ampliar muchas partes de nuestro sitio web. Incluso podemos instalar extensiones que añaden nuevas funcionalidades.

source: But:
es: Pero:

source: Can we submit talks now?
es: ¿Podemos enviar charlas (al jurado evaluador) ahora?

source: Can we create lists with the most important properties of each talk?
es: ¿Podemos crear listas con las propiedades más importantes de cada charla?

source: Can we allow a jury to vote on talks?
es: ¿Podemos permitir a un miembro del jurado votar en las charlas?

source: We often have to work with structured data. Up to a degree we can do all this TTW, but at some point we run into barriers. In the next part of the training, we'll teach you how to break through these barriers.
es: Algunas veces trabajamos con data estructurada. Hasta un grado podemos hacer todo a través de la Web, pero a algún punto nos encontramos con barreras. En la siguiente parte de nuestro entrenamiento, te enseñaremos como romper esas barreras.

source: The Anatomy of Plone
es: La Anatomía de Plone

source: In this part you will:
es: En esta parte vamos a tratar:

source: Learn a bit about the history of Plone.
es: Aprende un poco sobre la historia de Plone.

source: Topics covered:
es: Tópicos cubiertos:

source: Python, Zope, CMF, Plone ... -- how does all that fit together?
es: Python, Zope, CMF, Plone ... - ¿como se integran entre si?

source: Zope is a web application framework that Plone runs on top of.
es: Zope es un Framework de aplicación Web en el cual Plone corre encima de él.

source: The majority of Zope's code is written in Python, like everything else written on top of it.
es: La mayoría del código de Zope está escrito en Python, como todo lo demás escrito encima de él.

source: It serves applications that communicate with users via http.
es: Ese sirve aplicaciones que comunica con usuarios vía protocolo http.

source: Before Zope, there usually was an Apache server that would call a script and give the request as an input. The script would then just print HTML to the standard output. Apache returned that to the user. Opening database connections, checking permission constraints, generating valid HTML, configuring caching, interpreting form data and everything else: you have to do it on your own.
es: Antes de Zope, generalmente era un servidor Apache el que debía llamar a un script y dar la petición como una entrada. El script sería entonces quien simplemente imprime código HTML en la salida estándar. Apache retornó eso al usuario. Las conexiones abiertas de base de datos, verificando las restricciones de permisos, la generación de HTML válido, la configuración de almacenamiento en caché, la interpretación de los datos del formulario y todo lo que tiene que hacer por su cuenta.

source: When the second request comes in, you have to do everything again.
es: Cuando entra la segunda solicitud, el servidor debe hacer todo de nuevo.

source: Jim Fulton thought that this was slightly tedious. So he wrote code to handle requests. He believed that site content is object-oriented and that the URL should somehow point directly into the object hierarchy, so he wrote an object-oriented database, called `ZODB <http://www.zodb.org/en/latest/>`_.
es: Jim Fulton pensaba que esto era un poco tedioso. Así que escribió el código para manejar las peticiones. Él creía que el contenido del sitio es orientado a objetos y que la URL de alguna manera debe apuntar directamente a la jerarquía de objetos, por lo que escribió una base de datos orientada a objetos, llamada `ZODB <http://www.zodb.org/en/latest/>`_.

source: The ZODB is a fully `ACID <https://en.wikipedia.org/wiki/ACID>`_ compliant database with automatic transactional integrity. It automatically maps traversal in the object hierarchy to URL paths, there is no need to "wire" objects or database nodes to URLs.
es: El ZODB es una base de datos `ACID <https://en.wikipedia.org/wiki/ACID>`_ totalmente compatible con integridad transaccional automático. Se asigna automáticamente el recorrido en la jerarquía de objetos a rutas URL, así que no hay necesidad de objetos "cableados" o nodos de bases de datos a las direcciones URL.

source: This gives Plone its easy SEO-friendly URLs.
es: Esto da Plone sus fáciles de generar direcciones URL amigables a las técnicas SEO.

source: Traversal through the object database is security checked at every point via very fine grained access-control lists.
es: Transversal a través de la base de datos de objeto tiene la seguridad comprobada en todos los puntos a través de listas de control de acceso muy detallado.

source: One missing piece is important and complicated: ``Acquisition``.
es: Una pieza que falta el cual es importante y a la ves complicada: ``Acquisition``.

source: Acquisition is a kind of magic. Imagine a programming system where you do not access the file system and where you do not need to import code. You work with objects. An object can be a folder that contains more objects, an HTML page, data, or another script.
es: La acquisition, es una especie de magia. Imagine un sistema de programación en el que no accede al sistema de archivos y donde usted no necesita importar código. Usted trabaja con objetos. Un objeto puede ser una carpeta que contiene más objetos, una página HTML, datos, u otro script.

source: To access an object, you need to know where the object is. Objects are found by paths that look like URLs, but without the domain name. Now Acquisition allows you to write an incomplete path.
es: Para acceder a un objeto, lo que necesita saber dónde está el objeto. Los objetos se encuentran por las rutas que parecen direcciones URL, pero sin el nombre de dominio. Ahora la Acquisition permite escribir una ruta incompleta.

source: An incomplete path is a relative path, it does not explicitly state that the path starts from the root, it starts relative to where the content object is -- its context.
es: Una ruta incompleta es una ruta relativa, ese no establece explícitamente cual es la ruta que inicia desde la raíz, ese se inicia en relación con donde esta el contenido del objeto -- eso es el contexto.

source: If Zope cannot resolve the path to an object relative to your code, it tries the same path in the containing folder. And then the folder containing the folder.
es: Si Zope no puede resolver la ruta de un objeto relativo a su código, ese trata la misma ruta en la carpeta que lo contiene. Y a continuación, la carpeta que contiene la carpeta.

source: This might sound weird, what do I gain with this?
es: Esto puede sonar extraño, ¿qué gano yo con esto?

source: You can have different data or code depending on your :py:obj:`context`. Imagine you want to have header images differing for each section of your page, sometimes even differing for a specific subsection of your site.
es: Usted puede tener diferentes datos o códigos en función de su :py:obj:`context`. Imagínese que usted desea tener imágenes de cabecera diferentes para cada sección de la página, a veces, incluso diferentes para una sub-sección específica de su sitio.

source: You define a path ``header_image`` and put a header image at the root of your site. If you want a folder with a different header image, you put the header image into this folder.
es: Así se define una ruta a la ``header_image`` y pone una imagen de cabecera en la raíz de su sitio. Si quieres una carpeta a una imagen de cabecera diferente, se pone la imagen de cabecera en esta carpeta.

source: Please take a minute to let this settle and think about what this allows you to do.
es: Por favor, tómese un minuto para dejar que esto se asimile mejor y piense, lo que esto le permite hacer.

source: contact forms with different e-mail addresses per section
es: formularios de contacto con diferentes direcciones de correo electrónico por sección

source: different CSS styles for different parts of your site
es: diferentes estilos CSS para diferentes partes de su sitio

source: One site, multiple customers, everything looks different for each customer.
es: Un sitio, múltiples clientes, todo se ve diferente para cada cliente.

source: As with all programming magic, acquisition exacts a price. Zope code must be written carefully in order to avoid inheriting side effects via acquisition.
es: Al igual que con toda la magia de programación, acquisition exige un precio. El código de Zope debe ser escrito cuidadosamente si es necesario para evitar heredar efectos secundarios a través de la acquisition.

source: The Zope community expresses this with the Python (Monty) maxim: Beware the `Spammish Acquisition`.
es: La comunidad Zope expresa esto con la máxima Python (Monty): Cuidado con el `Spammish de la Acquisition`.
