Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: We start with a little helper method which is not exposed via the interface. We don't want people to vote twice. There are many ways to ensure this and each one has flaws.
es: Empezamos con un poco del método helper que no está expuesta a través de la interfaz. No queremos que la gente vote dos veces. Hay muchas formas para asegurar esto y cada uno tiene defectos.

source: We chose this way to show you how to access information from the request the browser of the user sent to us. First, we get the ip of the user, then we access a small set of headers from the user's browser and generate an md5 checksum of this.
es: Elegimos esta manera de mostrar cómo acceder a la información de la request del navegador del usuario que nos envió. En primer lugar, tenemos la IP del usuario, entonces podemos acceder a un pequeño conjunto de encabezados desde el navegador de los usuarios y generar una suma de comprobación MD5 de esto.

source: The vote method wants a vote and a request. We check the preconditions, then we convert the vote to an integer, store the request to :samp:`voted` and the votes into the :samp:`votes` dictionary. We just count there how often any vote has been given.
es: El método de votación, quiere un voto y una request. Comprobamos las condiciones previas, a continuación, convertimos el voto a un número entero, almacenar la request que tiene :samp:`voted` y los votos en el diccionario :samp:`votes`. Sólo contamos allí, con qué frecuencia se ha dado ninguna votación.

source: Everything else is just python.
es: Todo lo demás es simplemente código python.

source: Refactor the voting behavior so that it uses `BTrees` instead of `PersistentDict` and `PersistentList`. Use `OOBTree` to replace `PersistentDict` and `OIBTree` to replace `PersistentList`.
es: Refactorizar el comportamiento de votación para que use `BTrees` en vez de `PersistentDict` y `PersistentList`. Usar `OOBTree` para remplazar `PersistentDict` y `OIBTree` para remplazar `PersistentList`.

source: change :file:`behavior/voting.py`
es: cambiar el archivo :file:`behavior/voting.py`

source: Exercise 2
es: Ejercicio 2

source: Write a unit test that simulates concurrent voting. The test should raise a `ConflictError` on the original voting behavior implementation. The solution from the first exercise should pass. Look at the file `ZODB/ConflictResolution.txt` in the `ZODB3` egg for how to create a suitable test fixture for conflict testing. Look at the test code in `zope.annotation` for how to create annotatable dummy content. You will also have to write a 'request' dummy that mocks the `getClientAddr` and `getHeader` methods of Zope's HTTP request object to make the `_hash` method of the voting behavior work.
es: Escriba una prueba unitaria que simule la votación simultánea. La prueba debe generar un `ConflictError` en la implementación del comportamiento de votación original. La solución del primer ejercicio debería pasar. Mire el archivo`ZODB/ConflictResolution.txt` en el paquete egg `ZODB3` para ver cómo crear un accesorio de prueba adecuado para pruebas de conflicto. Mire el código de prueba en `zope.annotation` para saber cómo crear contenido ficticio anotable. También tendrá que escribir un dummy 'request' que se burla de los métodos `getClientAddr` y `getHeader` del objeto de solicitud HTTP de Zope para que el método `_hash` del comportamiento de votación funcione.

source: There are no tests for `starzel.votablebehavior` at all at the moment. But you can refer to chapter 22 for how to setup unit testing for a package. Put the particular test for this exercise into a file named :file:`starzel.votable_behavior/starzel/votable_behavior/tests/test_voting`. Remember you need an empty :file:`__init__.py` file in the :file:`tests` directory to make testing work. You also need to add `starzel.votable_behavior` to `test-eggs` in :file:`buildout.cfg` and re-run buildout.
es: No hay pruebas para `starzel.votablebehavior` en absoluto en este momento. Pero puede consultar el capítulo 22 sobre cómo configurar las pruebas unitarias para un paquete. Ponga la prueba particular para este ejercicio en un archivo llamado :file:`starzel.votable_behavior/starzel/votable_behavior/tests/test_voting`. Recuerde que necesita un archivo vacío :file:`__init__.py` en el directorio :file:`tests` para que las pruebas funcionen. También necesita añadir `starzel.votable_behavior` a `test-eggs` en :file:`buildout.cfg` y volver a ejecutar buildout.

source: Buildout I
es: Buildout - Parte I

source: Learn about Buildout
es: Aprenda acerca de Buildout

source: Recipes
es: Recetas

source: Buildout Configuration
es: Configuración de Buildout

source: `Buildout <https://pypi.org/project/zc.buildout>`_ composes your application for you, according to your rules.
es: `Buildout <https://pypi.org/project/zc.buildout>`_ compone su aplicación por usted, de acuerdo a sus reglas.

source: To compose your application you must define the eggs you need, which version, what configuration files Buildout has to generate for you, what to download and compile, and so on. Buildout downloads the eggs you requested and resolves all dependencies. You might need five different eggs, but in the end, Buildout has to install 300 eggs, all with the correct version in order to resolve all the dependencies.
es: Para componer su aplicación es necesario definir los paquetes eggs que usted necesita, ¿qué versión?, ¿qué archivos de configuración Buildout tiene que generar para usted?, para descargar y compilar, así sucesivamente. Buildout descarga los paquetes eggs requeridos y resuelve todas las dependencias. Es posible que necesite cinco paquetes eggs diferentes, pero al final, Buildout tiene que instalar 300 paquetes eggs, todos con la versión correcta.

source: Buildout does this without touching your system Python or affecting any other package. The commands created by buildout bring all the required packages into the Python environment. Each command it creates may use different libraries or even different versions of the same library.
es: Buildout hace esto sin tocar el sistema Python o afectar a ningún otro paquete. Los comando creados por buildout traer todos los paquetes requeridos en el entorno Python. Cada comando que crea quizás diferentes bibliotecas o incluso diferentes versiones de la misma biblioteca.

source: Plone needs folders for logfiles, databases and configuration files. Buildout assembles all of this for you.
es: Plone necesita carpetas para los archivos de registro, bases de datos y archivos de configuración. Buildout ensambla todo esto para usted.

source: You will need a lot of functionality that Buildout does not provide out of the box, so you'll need several extensions. Some extensions provide new functionality, like mr.developer, the best way to manage your checked out sources.
es: Usted necesitará una gran cantidad de funcionalidades que Buildout no proporciona fuera de la caja, así usted necesitará varias extensiones. Algunas extensiones proporcionan una funcionalidad totalmente nueva, como mr.developer, la mejor manera de manejar sus repositorios de código fuente.

source: Syntax
es: Sintaxis

source: The syntax of Buildout configuration files is similar to classic ini files. You write a parameter name, an equals sign and the value. If you enter another value in the next line and indent it, Buildout understands that both values belong to the parameter name, and the parameter stores all values as a list.
es: La sintaxis de los archivos de configuración de despliegue es similar a los archivos clásicos ini. Usted escribe un nombre de parámetro, un signo igual y el valor. Si introduce otro valor en la siguiente línea y indentada, Buildout entiende que ambos valores pertenecen al nombre del parámetro y el parámetro almacena todos los valores en forma de lista.

source: A Buildout consists of multiple sections. Sections start with the section name in square brackets. Each section declares a different part of your application. As a rough analogy, your Buildout file is a cookbook with multiple recipes.
es: Un Buildout consta de múltiples secciones. Las secciones comienzan con el nombre de la sección entre corchetes. Cada sección declara una parte diferente de su aplicación. Como analogía aproximada, su archivo Buildout es un libro de cocina con múltiples recetas.

source: There is a special section, called `[buildout]`. This section can change the behavior of Buildout itself. The variable :samp:`parts` defines which of the existing sections should actually be used.
es: Hay una sección especial, llamada `[buildout]`. En esta sección se puede cambiar el comportamiento de la propia Buildout. Las variables :samp:`parts` define, cuál de las secciones existentes deben ser efectivamente utilizado.

source: Buildout itself has no idea how to install Zope. Buildout is a plugin based system, it comes with a small set of plugins to create configuration files and download eggs with their dependencies and the proper version.
es: Buildout por si mismo no tiene idea de como instalar Zope. Buildout es un sistema basado en plugin, este viene con un pequeño conjunto de plugins para crear archivos de configuración y descargar paquetes eggs con sus dependencias y su versión apropiada.

source: To install a Zope site, you need a third-party plugin. The plugins provide new recipes that you have to declare and configure in their own respective sections.
es: Para instalar un sitio Zope, necesitas un plugin de terceros. El plugin provee nuevas recetas que tu tienes que declarar y configurar en sus respectivas secciones.

source: One example is the section
es: Un ejemplo es esta sección

source: This uses the python package `plone.recipe.zope2instance <https://pypi.org/project/plone.recipe.zope2instance>`_ to create and configure the Zope 2 instance which we use to run Plone.
es: Esto usa el paquete de python `plone.recipe.zope2instance <https://pypi.org/project/plone.recipe.zope2instance>`_ para crear y configurar la instancia Zope 2 la cual usamos para ejecutar Plone.

source: All the lines after :samp:`recipe = xyz` are the configuration of the specified recipe.
es: Todas las lineas después de :samp:`recipe = xyz` son la configuración de la receta usada.

source: There are way to many buildout-recipes. See https://pypi.org/search/?q=buildout+recipe
es: Hay mucho formas para muchas recetas buildout. Ver https://pypi.org/search/?q=buildout+recipe

source: References
es: Referencias

source: Buildout allows you to use references in the configuration. A variable declaration may not only hold the variable value, but also a reference to where to look for the variable value.
es: Buildout le permite usar referencias en la configuración. Una declaración de variable no sólo puede mantener el valor de variable, pero también una referencia al lugar donde buscar el valor de la variable.

source: If you have a big setup with many Plone sites with minor changes between each configuration, you can generate a template configuration, and each site references everything from the template and overrides just what needs to be changed.
es: Si usted tiene una gran instalación con muchos sitios Plone con pequeños cambios entre cada configuración, se puede generar una plantilla de configuración, y cada sitio hace referencia a todo, desde la plantilla y sobrescribe justo en lo que necesita ser cambiado.

source: Even in smaller buildouts this is a useful feature. We are using `collective.recipe.omelette <https://pypi.org/project/collective.recipe.omelette>`_. A very practical recipe that creates a virtual directory that eases the navigation to the source code of each egg.
es: Incluso en los buildouts más pequeños esta es una característica útil. Estamos utilizando `collective.recipe.omelette <https://pypi.org/project/collective.recipe.omelette>`_. Una receta muy práctica el cual crea un directorio virtual para facilitar la navegación al código fuente de cada paquete egg.

source: The omelette recipe needs to know which eggs to reference. We want the same eggs that our instance uses, so we reference the eggs of the instance instead of repeating the whole list.
es: La receta omelette tiene que saber cuales son los paquetes eggs para hacer referencia. Queremos los mismos paquetes eggs que utiliza nuestra instancia, por lo que nos referimos a los paquetes eggs de la instancia en lugar de repetir toda la lista.

source: Another example: Say you create configuration files for a webserver like nginx, you can define the target port for the reverse proxy by looking it up from the zope2instance recipe.
es: Otro ejemplo: Digamos que usted crea archivos de configuración para un servidor web como Nginx, puede definir el puerto de destino para el proxy inverso al mirar hacia arriba a partir de la receta zope2instance.

source: Configuring complex systems always involves a lot of duplication of information. Using references in the buildout configuration allows you to minimize these duplications.
es: La configuración de sistemas complejos siempre implica una gran cantidad de duplicación de la información. El uso de referencias en la configuración buildout le permite minimizar estas duplicaciones.

source: A real life example
es: Un ejemplo de la vida real

source: Let us walk through the :file:`buildout.cfg` for the training and look at some important variables:
es: Examinemos el archivo ``buildout.cfg`` para el entrenamiento y miremos algunas de las variables más importantes:

source: When you run :command:`./bin/buildout` without any arguments, Buildout will look for this file.
es: Cuando usted ejecuta el comando :command:`./bin/buildout` sin argumentos, Buildout buscara por este archivo.

source: If you are using the vagrant installation, you will have to activate your `virtualenv` and run the command :command:`buildout` only. In the vagrant setup `zc.buildout` and `setuptools` are installed in the virtualenv and therefore available without specifying the preceding path. This is possible because in recent versions of `zc.buildout` the `bootstrap` step is no longer necessary.
es: Si está utilizando la instalación vagrant, tendrá que activar su `virtualenv` y ejecutar el comando :command:`buildout` solamente. En la configuración vagrant, `zc.buildout` y `setuptools` están instalados en el virtualenv y por lo tanto, están disponibles sin especificar la ruta anterior. Esto es posible porque en versiones recientes de `zc.buildout` el paso `bootstrap` ya no es necesario.

source: Let us look closer at some variables.
es: Echemos un vistazo más de cerca a algunas variables.

source: This line tells Buildout to read another configuration file. You can refer to configuration files on your computer or to configuration files on the Internet, reachable via http. You can use multiple configuration files to share configurations between multiple Buildouts, or to separate different aspects of your configuration into different files. Typical examples are version specifications, or configurations that differ between different environments.
es: Esta línea le dice al Buildout lea más archivos de configuración. Puede hacer referencia a los archivos de configuración locales en el equipo o los archivos de configuración en Internet, accesible a través de protocolo HTTP. Puede utilizar varios archivos de configuración para compartir entre múltiples configuraciones Buildouts, o para separar los diferentes aspectos de su configuración en archivos diferentes. Ejemplos típicos son especificaciones de la versión o la configuración que difieren entre los diferentes entornos de instalación como desarrollo, calidad, producción.

source: This is the list of eggs that we configure to be available for Zope. These eggs are put in the python path of the script :command:`bin/instance` with which we start and stop Plone.
es: Esta es la lista de los paquetes eggs que nosotros configuramos a estar disponible para Zope. Estos paquetes eggs se ponen en la ruta del python (el PYTHONPATH) del script :command:`bin/instance` con el cual se iniciara y detendrá con Plone.

source: The egg ``Plone`` is a wrapper without code. Among its dependencies is :py:mod:`Products.CMFPlone` which is the egg that is at the center of Plone.
es: El paquete egg ``Plone`` es una envoltura sin código fuente. Entre sus dependencias esta :py:mod:`Products.CMFPlone` que es el paquete egg en el cual esta propiamente de Plone.

source: The rest are add-ons we already used or will use later. The last eggs are commented out so they will not be installed by Buildout.
es: El resto son complementos que ya hemos usado o usará más tarde. Los últimos paquetes eggs están comentadas por lo que no se instalarán por Buildout.

source: The file :file:`versions.cfg` that is included by the :samp:`extends = ...` statement holds the version pins:
es: El archivo :file:`versions.cfg` que es incluido por la declaración :samp:`extends = ...` contiene las versiones que definimos:

source: This is another special section. By default buildout will look for version pins in a section called ``[versions]``. This is why we included the file :file:`versions.cfg`.
es: Esta es otra sección especial. De forma predeterminada, buildout buscará los pines de versión en una sección llamada ``[versions]``. Es por eso que incluimos el archivo :file:`versions.cfg`.

source: There are many more important things to know, and we can't go through them all in detail but I want to focus on one specific feature: :py:mod:`mr.developer`
es: Hay muchas cosas más importantes que debe saber, y no podemos pasar por ellos en todos los detalles, pero yo quiero centrarme en una característica específica: :py:mod:`mr.developer`

source: With :py:mod:`mr.developer` you can declare which packages you want to check out from which version control system and which repository URL. You can check out sources from git, svn, bzr, hg and maybe more. Also, you can say that some sources are in your local file system.
es: Con :py:mod:`mr.developer` puede declarar los paquetes que desee comprobar desde o hacia un sistema de control de versiones y de cual dirección URL del repositorio. Usted puede comprobar código fuente desde diversos CVS como git, subversion, bzr, hg y quizá más. También, se puede indicar a Buildout algún código fuente se encuentran en el sistema de archivos local sin aplicar control de versiones.

source: :py:mod:`mr.developer` comes with a command, :command:`./bin/develop`. You can use it to update your code, to check for changes and so on. You can activate and deactivate your source checkouts. If you develop your extensions in eggs with separate checkouts, which is a good practice, you can plan releases by having all source checkouts deactivated, and only activate them when you write changes that require a new release. You can activate and deactivate eggs via the :command:`develop` command or the Buildout configuration. You should always use the Buildout way. Your commit serves as documentation.
es: :py:mod:`mr.developer` viene con un comando, :command:`./bin/develop`. Puede usarlo para actualizar su código, verificar cambios y demás. Puedes activar y desactivar sus entradas checkouts de source. Si desarrolla sus extensiones en paquetes eggs con entradas checkouts separadas, lo cual es una buena práctica, puede planificar lanzamientos desactivando todas las entradas checkouts de entradas checkouts, y solo activarlas cuando escriba cambios que requieran una nueva versión. Puede activar y desactivar los paquetes eggs mediante el comando :command:`develop` o la configuración de Buildout. Siempre debes usar el modo Buildout. Tu commit sirve como documentación.

source: You might have noticed that most if not all functionality is only available via plugins. One of the things that Buildout excels at without any plugin is the dependency resolution. You can help Plone in dependency resolution by declaring exactly which version of an egg you want.
es: Usted puede haber notado que la mayoría, si no toda la funcionalidad sólo está disponible a través de plugins. Una de las cosas que sobresale en Buildout sin ningún plugin, es la resolución de dependencias. Usted puede ayudar a Plone en la resolución de dependencias, al declarar exactamente cual versión de un paquete egg usted desea.

source: This is only one use case. Another one is much more important: If you want to have a repeatable Buildout, one that works two months from now.
es: Esto es sólo un caso de uso. Otra es mucho más importante: Si usted quiere tener un Buildout repetible, el cual funcione de dos meses a partir de ahora.

source: Also, you *must* declare all your egg versions, else Buildout might install newer versions.
es: También, se *debe* declarar todas sus versiones de paquete egg, de otro modo Buildout podría instalar las nuevas versiones.

source: Be McGuyver
es: Sea un McGuyver

source: As you can see, you can build very complex systems with Buildout. It is time for some warnings. Be selective in your recipes. Supervisor is a program to manage running servers, and it's pretty good. There is a recipe for it.
es: Como puede ver, usted puede construir sistemas muy complejos con Buildout. Es hora de algunas advertencias. Sea selectivo en sus recetas. Supervisor es un programa para gestionar servidores en ejecución, es bastante bueno. No hay una receta para ello.

source: The configuration for this recipe is more complicated than the supervisor configuration itself! By using this recipe, you force others to understand the recipe's specific configuration syntax *and* the supervisor syntax. For such cases, `collective.recipe.template <https://pypi.org/project/collective.recipe.template>`_ is a better match.
es: ¡La configuración para esta receta es más complicada que la propia configuración del Supervisor en si! Mediante el uso de esta receta, se fuerza a los demás a comprender la sintaxis de configuración específica recetas y la sintaxis Supervisor. Para tales casos, `collective.recipe.template <https://pypi.org/project/collective.recipe.template>`_ presenta una mejor coincidencia.

source: Another problem is error handling. Buildout tries to install a weird dependency you do not actually want? Buildout will not tell you where it is coming from.
es: Otro problema es el manejo de errores. ¿Buildout intenta instalar una rara dependencia que en realidad no quiere? Buildout no le dirá, lo que está viniendo.

source: If there is a problem, you can always run Buildout with :option:`-v` to get more verbose output, sometimes it helps.
es: Si hay un problema, siempre se puede ejecutar Buildout con la opción :option:`-v` para obtener una salida más detallada, a veces es de ayuda.

source: If strange egg versions are requested, check the dependencies declaration of your eggs and your version pinnings. Here is an invaluable shell command that allows you to find all packages that depend on a particular egg and version:
es: Si se solicitan las versiones de paquetes eggs extraños, verifique la declaración de las dependencias de los paquetes eggs y su versión definida. Aquí hay un comando de shell invaluable que le permite encontrar todos los paquetes que dependen de un paquete egg en particular y la versión:

source: Put the name of the egg with a version conflict as the first argument. Also, change the path to the buildout cache folder according to your installation (the vagrant buildout is assumed in the example).
es: Coloque el nombre del paquete egg con un conflicto de versión como primer argumento. Además, cambie la ruta a la carpeta de caché de compilación de acuerdo con su instalación (se supone que el buildout del vagrant en el ejemplo).
