Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: The ``column ..`` entries allow us to display the values of these indexes in the tableview of collections.
es: Las entradas ``column ..`` nos permite visualizar estos valores de estos índices en la vista tableview de colecciones.

source: Reinstall the add-on
es: Volver a instalar el complemento

source: Go to http://localhost:8080/Plone/portal_catalog/manage_catalogAdvanced to update the catalog
es: Valla a la dirección URL http://localhost:8080/Plone/portal_catalog/manage_catalogAdvanced para actualizar el catálogo

source: Go to http://localhost:8080/Plone/portal_catalog/manage_catalogIndexes to inspect and manage the new indexes
es: Valla a la dirección URL http://localhost:8080/Plone/portal_catalog/manage_catalogIndexes para actualizar el catálogo

source: The new indexes are still empty. We'll have to reindex them. To do so by hand go to http://localhost:8080/Plone/portal_catalog/manage_catalogIndexes, select the new indexes and click :guilabel:`Reindex`. We could also rebuild the whole catalog by going to the :guilabel:`advanced`-tab and clicking :guilabel:`Clear and Rebuild`. For large sites that can take a long time.
es: Los nuevos índices todavía están vacíos. Tendremos que reindexarlos. Para hacerlo, vaya a http://localhost:8080/Plone/portal_catalog/manage_catalogIndexes, seleccione los nuevos índices y haga clic en :guilabel:`Reindex`. También podríamos reconstruir todo el catálogo yendo a la pestaña :guilabel:`advanced` y haciendo clic en :guilabel:`Clear and Rebuild`. Para sitios grandes que pueden llevar mucho tiempo.

source: We could also write an upgrade step to enable the catalog-indexes and reindex all talks:
es: También podríamos escribir un paso de actualización para habilitar los índices de catálogo y reindexar todas las charlas:

source: Query for custom indexes
es: Consulta para índices personalizados

source: The new indexes behave like the ones that Plone has already built in:
es: Los nuevos índices se comportan como los que Plone tiene construido en:

source: We now can use the new indexes to improve the talklistview so we don't have to *wake up* the objects any more. Instead we use the brains' new attributes.
es: Ahora podemos usar los nuevos índices para mejorar la vista talklistview así que no tenemos que *despertar* los objetos nunca más. En cambio, usamos los nuevos atributos de los cerebros.

source: The template does not need to be changed and the result in the browser did not change, either. But when listing a large number of objects the site will now be faster since all the data you use comes from the catalog and the objects do not have to be loaded into memory.
es: La plantilla no necesita ser cambiada y el resultado en el navegador tampoco cambió. Pero cuando se enumera una gran cantidad de objetos, el sitio ahora será más rápido ya que todos los datos que utiliza provienen del catálogo y los objetos no tienen que cargarse en la memoria.

source: In fact we could now simplify the view even further by only returning the brains.
es: De hecho, ahora podríamos simplificar la vista aún más solo devolviendo los cerebros.

source: Modify :py:class:`TalkListView` to return only brains and adapt the template to these changes. Remember to move ``', '.join(brain.audience or [])`` into the template.
es: Modificar :py:class:`TalkListView` para devolver solo cerebros y adaptar la plantilla a estos cambios. Recuerde mover ``', '.join(brain.audience or [])`` en la plantilla.

source: Here is the class:
es: Aquí es la clase:

source: Here is the template:
es: Aquí es la plantilla:

source: Add collection criteria
es: Añadir criterio de colección

source: To be able to search content in collections using these new indexes we would have to register them as criteria for the querystring widget that collections use. As with all features make sure you only do this if you really need it!
es: Para ser capaz de buscar contenido en colecciones utilizando los nuevos índices tendríamos que registrarlos como criterios para el widget de cadena de consulta que usan las colecciones. Como con todas las características, ¡asegúrese de hacer esto solo si realmente lo necesita!

source: Add a new file :file:`profiles/default/registry.xml`
es: Añadir un nuevo archivo :file:`profiles/default/registry.xml`

source: Add versioning through GenericSetup
es: Añadir el versionado a través de GenericSetup

source: Configure the versioning policy and a diff-view for talks through GenericSetup.
es: Configurar la política de versionado y una vista de las diferentes versiones para las charlas a través de GenericSetup.

source: Add new file :file:`profiles/default/repositorytool.xml`
es: Añadir nuevo archivo :file:`profiles/default/repositorytool.xml`

source: Add new file :file:`profiles/default/diff_tool.xml`
es: Añadir nuevo archivo :file:`profiles/default/diff_tool.xml`

source: Finally you need to activate the versioning behavior on the content type. Edit :file:`profiles/default/types/talk.xml`:
es: Finalmente tenemos que activar el comportamiento de versionado al tipo de contenidos talks. Edite en el archivo :file:`profiles/default/types/talk.xml`:

source: There is currently a bug that breaks showing diffs when multiple-choice fields were changed.
es: Actualmente hay un error que se rompe mostrando diffs cuando se cambiaron campos de opción múltiple.

source: The talks are now grown up:
es: Las charlas ahora han crecido:

source: They provide a interface to which you can bind features like views
es: Proporcionan una interfaz a la que puede vincular características como vistas

source: Some fields are indexed in the catalog making the listing faster
es: Algunos campos están indexados en el catálogo haciendo que el listado sea más rápido

source: Talks are now versioned
es: Las charlas ahora son versionadas

source: You wrote your first upgrade-step to move the talks around: Whopee!
es: Usted escribe su primer paso de actualización para cambiar las charlas: ¡Whoopee!

source: Dexterity Types III: Python
es: Tipos Dexterity - Parte III: Python

source: Without sponsors, a conference would be hard to finance! Plus it is a good opportunity for Plone companies to advertise their services. But sponsors want to be displayed in a nice way according to the size of their sponsorship.
es: Sin patrocinadores, una conferencia sería difícil de financiar! Además de que es una buena oportunidad para las empresas Plone para hacer publicidad de sus servicios. Pero los patrocinadores quieren mostrarse de una manera agradable de acuerdo con el tamaño de su patrocinio.

source: create the content type *sponsor* that has a Python schema,
es: crear el tipo de contenido *sponsor* que tiene un esquema Python,

source: create a viewlet that shows the sponsor logos sorted by sponsoring level.
es: crear un viewlet que muestra los logotipos de los patrocinantes ordenados por el nivel.

source: The topics we cover are:
es: Los tópicos cubiertos son:

source: Python schema for Dexterity
es: Soporte de esquema para Dexterity

source: schema hint and directives
es: consejos de esquema y directivas

source: field permissions
es: permisos del campo

source: image scales
es: escalas de imagen

source: caching
es: caché

source: The Python schema
es: El esquema Python

source: First we create the schema for the new type. Instead of XML, we use Python this time. In chapter :ref:`export_code-label` you already created a folder :file:`content` with an empty :file:`__init__.py` in it. We don't need to register that folder in :file:`configure.zcml` since we don't need a :file:`content/configure.zcml` (at least not yet).
es: Primero creamos el esquema para el nuevo tipo. En lugar de XML, usamos Python esta vez. En el capítulo :ref:`export_code-label` ya creaste una carpeta :file:`content` con un vacío :file:`__init__.py` en él. No necesitamos registrar esa carpeta en el archivo :file:`configure.zcml` ya que no necesitamos un archivo :file:`content/configure.zcml` (al menos, aún no).

source: Now add a new file :file:`content/sponsor.py`.
es: Ahora añada un nuevo archivo :file:`content/sponsor.py`.

source: Some things are notable here:
es: Algunas cosas son notables aquí:

source: The fields in the schema are mostly from :py:mod:`zope.schema`. A reference of available fields is at https://docs.plone.org/external/plone.app.dexterity/docs/reference/fields.html
es: Los campos en el esquema son en su mayoría basado en el paquete :py:mod:`zope.schema`. Una referencia de campos disponibles está en https://docs.plone.org/external/plone.app.dexterity/docs/reference/fields.html

source: In :samp:`directives.widget(level=RadioFieldWidget)` we change the default widget for a Choice field from a dropdown to radio-boxes. An incomplete reference of available widgets is at https://docs.plone.org/external/plone.app.dexterity/docs/reference/widgets.html
es: En :samp:`directives.widget(level=RadioFieldWidget)` cambiamos el widget por defecto para un campo de elección de un menú desplegable para casilla de selección simple. Una referencia incompleta de widgets disponibles está en https://docs.plone.org/external/plone.app.dexterity/docs/reference/widgets.html

source: :py:class:`LevelVocabulary` is used to create the options used in the field ``level``. This way we could easily translate the displayed value.
es: :py:class:`LevelVocabulary` se utiliza para crear las opciones que se utilizan en el campo ``level``. De esta manera se podría traducir fácilmente el valor mostrado.

source: :samp:`fieldset('Images', fields=['logo', 'advertisement'])` moves the two image fields to another tab.
es: :samp:`fieldset('Images', fields=['logo', 'advertisement'])` mueve las dos campos de imágenes a otra pestaña.

source: :samp:`directives.read_permission(...)` sets the read and write permission for the field ``notes`` to users who can add new members. Usually this permission is only granted to Site Administrators and Managers. We use it to store information that should not be publicly visible. Please note that :py:attr:`obj.notes` is still accessible in templates and Python. Only using the widget (like we do in the view later) checks for the permission.
es: :samp:`directives.read_permission(...)` establece la lectura y escritura, el permiso para el campo ``note`` a los usuarios que pueden añadir nuevos miembros. Por lo general, este permiso sólo se concede a Administradores de Sitio y Administradores. Lo utilizamos para almacenar información que no debe ser visible públicamente. Tenga en cuenta que :py:attr:`obj.notes` sigue siendo accesible en plantillas y Python. Sólo utilizando el widget (como lo hacemos en la vista posterior) comprueba si el permiso.

source: We use no grok here.
es: Nosotros no usaremos grok aquí.

source: `All available Fields <https://docs.plone.org/external/plone.app.dexterity/docs/reference/fields.html#field-types>`_
es: `Todos los Campos disponible <https://docs.plone.org/external/plone.app.dexterity/docs/reference/fields.html#field-types>`_

source: `Schema-driven types with Dexterity <https://docs.plone.org/external/plone.app.dexterity/docs/schema-driven-types.html#schema-driven-types>`_
es: `Esquemas de Tipos impulsados con Dexterity <https://docs.plone.org/external/plone.app.dexterity/docs/schema-driven-types.html#schema-driven-types>`_

source: `Form schema hints and directives <https://docs.plone.org/external/plone.app.dexterity/docs/reference/form-schema-hints.html>`_
es: `Formularios esquemas de consejos y directivas <https://docs.plone.org/external/plone.app.dexterity/docs/reference/form-schema-hints.html>`_

source: Directives
es: Directivas

source: Directives can be placed anywhere in the class body (annotations are made directly on the class). By convention they are kept next to the fields they apply to.
es: Las directivas se pueden colocar en cualquier parte del cuerpo de la clase (las anotaciones se hacen directamente en la clase). Por convención, se mantienen junto a los campos a los que se aplican.

source: For example, here is a schema that omits a field:
es: Por ejemplo, aquí es un esquema que omite un campo:

source: You can also handle multiple fields with one directive:
es: Usted puede también manejar múltiples campos con una directiva:

source: With the directive "mode" you can set fields to 'input', 'display' or 'hidden'.
es: Con la directiva "mode" usted puede definir campos al 'input', 'display' o 'hidden'.

source: You can apply directives to certain forms only. Here we drop a field from the add-form, it will still show up in the edit-form.
es: Puede aplicar directivas solo a ciertos formularios. Aquí soltamos un campo del formulario de añadir, aún aparecerá en el formulario de edición.

source: The same works for custom forms.
es: El mismo trabajo para formularios personalizados.

source: With the directive :py:meth:`widget` you can not only change the widget used for a field. With :py:data:`pattern_options` you can pass additional parameters to the widget. Here we configure the datetime-widget powered by the js-library `pickadate <http://amsul.ca/pickadate.js>`_ by adding options that are used by it. Plone only passes the options to the library.
es: Con la directiva :py:meth:`widget` no solo puedes cambiar el widget utilizado para un campo. Con :py:data:`pattern_options` puede pasar parámetros adicionales al widget. Aquí configuramos el widget de fecha y hora impulsado por la biblioteca javascript `pickadate <http://amsul.ca/pickadate.js>`_ añadiendo las opciones que usa. Plone solo pasa las opciones a la biblioteca.

source: Validation and default values
es: Validación y valores por defecto

source: In the following example we add a validator and a default value.
es: En el siguiente ejemplo nosotros añadimos un validador y un valor por defecto.

source: Validators and defaults can be also be made aware of the context (i.e. to check against the values of other fields).
es: Los validadores y los valores predeterminados también pueden conocer el contexto (es decir, verificar los valores de otros campos).

source: For context aware defaults you need to use a :py:class:`IContextAwareDefaultFactory`. It will be passed the container for which the add form is being displayed:
es: Para los valores por defecto de contexto, necesita usar a :py:class:`IContextAwareDefaultFactory`. Se pasará el contenedor para el que se muestra el formulario de añadir:

source: For context-aware validators you need to use :py:meth:`invariant`:
es: Para validadores sensibles al contexto debe usar :py:meth:`invariant`:

source: To learn more about directives, validators and default values read:
es: Para aprender más acerca las directivas, validades y valores predeterminados lea:

source: `Validation <https://docs.plone.org/develop/addons/schema-driven-forms/customising-form-behaviour/validation.html>`_ (these docs still use grok-examples)
es: `Validación <https://docs.plone.org/develop/addons/schema-driven-forms/customising-form-behaviour/validation.html>`_ (esas documentaciones aun usa ejemplos basados en grok)

source: `z3c.form documentation <https://pypi.org/project/z3c.form#validators>`_
es: `documentación de z3c.form <https://pypi.org/project/z3c.form#validators>`_

source: `Default values for fields on add forms <https://docs.plone.org/external/plone.app.dexterity/docs/advanced/defaults.html>`_
es: `Valores por defecto para los campos al añadir formularios <https://docs.plone.org/external/plone.app.dexterity/docs/advanced/defaults.html>`_

source: The FTI
es: El FTI

source: Second we create the FTI for the new type in :file:`profiles/default/types/sponsor.xml`
es: Segundo nosotros creamos el FTI para el nuevo tipo de contenido en el archivo :file:`profiles/default/types/sponsor.xml`

source: Then we register the FTI in :file:`profiles/default/types.xml`
es: Entonces nosotros registramos el FTI en el archivo :file:`profiles/default/types.xml`

source: After reinstalling our package we can create the new type.
es: Después de reinstalar nuestro paquete, podemos crear el nuevo tipo.

source: Sponsors are containers but they don't need to be. Turn them into items by changing their class to :py:class:`plone.dexterity.content.Item`.
es: Los patrocinadores son contenedores pero no necesitan serlo. Conviértelos en elementos cambiando su clase a :py:class:`plone.dexterity.content.Item`.

source: Simply modify the property ``klass`` in the FTI and reinstall.
es: Simplemente modifique la propiedad ``klass`` en la FTI y vuelva a instalarla.

source: The view
es: La vista

source: We use the default view provided by dexterity for testing since we will only display the sponsors in a viewlet and not in their own page.
es: Utilizamos la vista por defecto proporcionada por dexterity para las pruebas ya que solo mostraremos los patrocinadores en un viewlet y no en su propia página.

source: But we could tweak the default view with some CSS to make it less ugly. Add the following to :file:`resources/ploneconf.css`:
es: Pero podríamos modificar la vista por defecto con algo de CSS para que sea menos feo. Añada lo siguiente al archivo :file:`resources/ploneconf.css`:

source: If we really want a custom view for sponsors it could look like this.
es: Si quisiéramos una vista personalizada para los patrocinadores podría tenerlo con esta apariencia.

source: Note how we handle the field with special permissions: :samp:`tal:condition="python: 'notes' in view.w"` checks if the convenience-dictionary :py:data:`w` (provided by the base class :py:class:`DefaultView`) holds the widget for the field ``notes``. If the current user does not have the permission :py:mod:`cmf.ManagePortal` it will be omitted from the dictionary and get an error since ``notes`` would not be a key in :py:data:`w`. By first checking if it's missing we work around that.
es: Tenga en cuenta que tenemos que manejar el campo con permisos especiales: :samp:`tal:condition="python: 'notes' in view.w"` comprueba si la conveniencia diccionario :py:data:`w` proporcionada por la clase base :py:class:`DefaultView` sostiene el widget para el campo ``notes``. Si el usuario actual no tiene permiso :py:mod:`cmf.ManagePortal` será omitido del diccionario y sale un error ya que ``notes`` no sería una clave en :py:data:`w`. Por primera comprobación de si falta trabajamos alrededor de eso.

source: The viewlet
es: El viewlet

source: Instead of writing a view you will have to display the sponsors at the bottom of the website in a viewlet.
es: En lugar de escribir una vista, deberá mostrar los patrocinadores en la parte inferior del sitio web en un viewlet.

source: Register the viewlet in :file:`browser/configure.zcml`
es: Registrar el viewlet en el archivo :file:`browser/configure.zcml`

source: Add the viewlet class in :file:`browser/viewlets.py`
es: Añada en la clase viewlet en el archivo :file:`browser/viewlets.py`

source: :py:meth:`_sponsors` returns a list of dictionaries containing all necessary info about sponsors.
es: :py:meth:`_sponsors` regresa una lista de diccionarios conteniendo todo la necesaria información sobre patrocinantes.

source: We create the complete img tag using a custom scale (200x80) using the view ``images`` from :py:mod:`plone.namedfile.` This actually scales the logos and saves them as new blobs.
es: Creamos la etiqueta HTML img completa utilizando una escala personalizada (200x80) utilizando la vista ``images`` del paquete :py:mod:`plone.namedfile`. Este escalas en realidad los logotipos y las guarda como nuevos registros blobs.

source: In :py:meth:`sponsors` we return an ordered dictionary of randomized lists of dicts (containing the information on sponsors). The order is by sponsor-level since we want the platinum-sponsors on top and the bronze-sponsors at the bottom. The randomization is for fairness among equal sponsors.
es: En :py:meth:`sponsors` devolvemos un diccionario ordenado de listas aleatorias de diccionarios (que contienen la información sobre los patrocinadores). El orden es por nivel de patrocinador ya que queremos los patrocinadores platino en la parte superior y los patrocinadores de bronce en la parte inferior. La aleatorización es para equidad entre patrocinadores iguales.

source: :py:meth:`_sponsors` is cached for an hour using `plone.memoize <https://docs.plone.org/manage/deploying/performance/decorators.html#timeout-caches>`_. This way we don't need to keep all sponsor objects in memory all the time. But we'd have to wait for up to an hour until changes will be visible.
es: :py:meth:`_sponsors` se almacena en caché durante una hora usando `plone.memoize <https://docs.plone.org/manage/deploying/performance/decorators.html#timeout-caches>`_. De esta manera no es necesario mantener todos los objetos patrocinadores en la memoria todo el tiempo. Pero tendríamos que esperar hasta una hora hasta que los cambios sean visibles.

source: Instead we should cache until one of the sponsors is modified by using a callable :py:func:`_sponsors_cachekey` that returns a number that changes when a sponsor is modified.
es: En su lugar, debemos almacenar en caché hasta que uno de los patrocinadores se modifique mediante el uso de un llamable :py:func:`_sponsors_cachekey` que devuelve un número que cambia cuando se modifica un patrocinador.

source: `Guide to Caching <https://docs.plone.org/manage/deploying/caching/index.html>`_
es: `Guía de almacenamiento en caché <https://docs.plone.org/manage/deploying/caching/index.html>`_

source: `Cache decorators <https://docs.plone.org/manage/deploying/performance/decorators.html>`_
es: `Decoradores de caché <https://docs.plone.org/manage/deploying/performance/decorators.html>`_

source: `Image Scaling <https://docs.plone.org/develop/plone/images/content.html#creating-scales>`_
es: `Escalado de imagen <https://docs.plone.org/develop/plone/images/content.html#creating-scales>`_

source: The template for the viewlet
es: La plantilla para el viewlet

source: Add the template :file:`browser/templates/sponsors_viewlet.pt`
es: Añadir a plantilla en el archivo :file:`browser/templates/sponsors_viewlet.pt`

source: You can now add some CSS in :file:`browser/static/ploneconf.css` to make it look OK.
es: Ahora puede añadir algo de CSS en el archivo :file:`browser/static/ploneconf.css` para que se vea bien.

source: Result:
es: Resultado:

source: The result of the newly created content type.
es: El resultado del nuevo tipo de contenido creado.

source: Turn the content type Speaker from :ref:`Exercise 2 of the first chapter on dexterity <dexterity1-excercises-label>` into a Python-based type.
es: Gire el tipo de contenido Speaker desde: ref: `Ejercicio 2 del primer capítulo sobre dexterity <dexterity1-excercises-label>` en un tipo basado en Python.

source: When we're done, it should have the following fields:
es: Cuando hayamos terminado, debería tener los siguientes campos:

source: title
es: título

source: email
es: correo electrónico

source: Do *not* use the :py:class:`IBasic` or :py:class:`IDublinCore` behavior to add title and description. Instead add your own field ``title`` and give it the title *Name*.
es: *No* use el comportamiento :py:class:`IBasic` o :py:class:`IDublinCore` para añadir título y descripción. En su lugar, añada su propio campo ``title`` y asígnele el título *Nombre*.

source: Register the type in :file:`profiles/default/types.xml`
es: Registra el tipo en el archivo :file:`profiles/default/types.xml`

source: The FTI goes in :file:`profiles/default/types/speaker.xml`. Again we use :py:class:`Item` as the base-class:
es: El FTI va en el archivo :file:`profiles/default/types/speaker.xml`. Otra ves usaremos :py:class:`Item` como el base-class:

source: After reinstalling the package the new type is usable.
es: Después de volver a instalar el paquete el nuevo tipo de contenido esta disponible para usar.

source: Exercise 3
es: Ejercicio 3
