Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: About Mastering Plone
es: Sobre "Maestría en Plone"

source: This training was created by Philip Bauer and Patrick Gerken of `starzel.de <https://www.starzel.de>`_ to create a canonical training for future Plone developers.
es: Esta entrenamiento fue creado por Philip Bauer y Patrick Gerken de la empresa `starzel.de <https://www.starzel.de>`_ para crear un entrenamiento canónica para los futuros desarrolladores de Plone.

source: The aim is that anyone with the appropriate knowledge can give a training based on it and contribute to it. It is published as Open Source on `GitHub <https://github.com/plone/training>`_ and `training.plone.org <https://training.plone.org/>`_.
es: El objetivo es que cualquier persona con los conocimientos adecuados puede dar un entrenamiento basado en este y si lo desea pueda contribuir a mejorar este material. Se publica este entrenamiento como código abierto en `github <https://github.com/plone/training>`_ y `training.plone.org <https://training.plone.org/>`_.

source: If you want to inquire the original authors about organizing a training please contact them at team@starzel.de.
es: Si desea ponerse en contacto con los autores originales para un entrenamiento, por favor, puede hacerlo por medio del correo team@starzel.de.

source: Upcoming Trainings
es: Próximos entrenamientos

source: If you want to have a training near you please ask for trainings on https://community.plone.org
es: Si desea tener un entrenamiento cerca de usted, solicite entrenamiento en el foro de discusión de la comunidad Plone en https://community.plone.org

source: Previous Trainings
es: Entrenamientos previos

source: The Mastering Plone Training was so far held publicly at the following occasions:
es: El entrenamiento "Maestría en Plone" se celebró públicamente en las siguientes ocasiones:

source: `Ploneconf 2017 in Barcelona <https://2017.ploneconf.org/>`_
es: `Ploneconf 2017 en Barcelona <https://2017.ploneconf.org/>`_

source: `Ploneconf 2016 in Boston <https://2016.ploneconf.org/>`_
es: `Ploneconf 2016 en Boston <https://2016.ploneconf.org/>`_

source: October 2015, Bucharest
es: Octubre 2015, Bucharest

source: `March 2015, Munich <https://www.starzel.de/leistungen/training/>`_
es: `Marzo 2015, Múnich <https://www.starzel.de/leistungen/training/>`_

source: `June 2014, Caracas <https://twitter.com/hellfish2/status/476906131970068480>`_
es: `Junio de 2014, Caracas <https://twitter.com/hellfish2/status/476906131970068480>`_

source: `May 2014, Munich <https://www.starzel.de/blog/mastering-plone>`_
es: `Mayo de 2014, Múnich <https://www.starzel.de/blog/mastering-plone>`_

source: PyCon DE 2012, Leipzig
es: La PyCon de Alemania 2012, Leipzig

source: PyCon De 2011, Leipzig
es: La PyCon de Alemania 2011, Leipzig

source: Trainers
es: Entrenadores

source: The following trainers have given trainings based on Mastering Plone:
es: Los siguientes entrenadores han dado entrenamiento basado en el material "Maestría en Plone":

source: Philip Bauer is a web developer from Munich who fell in love with Plone in 2005 and since then works almost exclusively with Plone. A historian by education he drifted towards creating websites in the 90's and founded the company Starzel.de in 2000. He is a member of the Plone foundation, loves teaching and is dedicated to Open Source. Among other Plone-related projects he started creating the Mastering Plone Training so that everyone can become a Plone-Developer.
es: Philip Bauer es un desarrollador web de Munich que se enamoró de Plone en 2005 y desde entonces trabaja casi exclusivamente con Plone. Un historiador por educación que derivó hacia la creación de sitios web en los años 90 y fundó la empresa Starzel.de en 2000. Es miembro de la Fundación Plone, ama la enseñanza y se dedica al Open Source. Entre otros proyectos relacionados con Plone, comenzó a crear el manual de entrenamiento "Maestría en Plone" para que todos puedan convertirse en programadores Plone.

source: Patrick Gerken works with Python since 2002. He started working with pure Zope applications and now develops mainly with Plone, Pyramid and JavaScript as well as doing what is called DevOps. He works at Zumtobel Group.
es: Patrick Gerken trabaja con Python desde 2002. Comenzó a trabajar con aplicaciones Zope puras y ahora desarrolla principalmente con Plone, Pyramid y Javascript, además de hacer tareas de lo que se llama DevOps. Trabaja en Zumtobel Group.

source: Steve McMahon is a long-time Plone community member, contributor and trainer. He is the creator of PloneFormGen and maintainer of the Unified installer. Steve also wrote several chapters of Practical Plone and is an experienced speaker and instructor.
es: Steve McMahon es un miembro de la comunidad Plone hace mucho tiempo, colaborador y entrenador. Él es el creador del complemento PloneFormGen, el cual es un generador de formulario a través de la Web para Plone y el mantenedor del instalador unificado. Steve también escribió varios capítulos del libro 'Practical Plone' y es un orador e instructor experimentado.

source: Steffen Lindner started developing Plone in 2006. He worked on small Plone sites and also with huge intranet sites. As Open Source / Free Software developer he joined the Plone core developer team 2011 and works at Starzel.de.
es: Steffen Lindner comenzó a desarrollar Plone en 2006. Trabajó en pequeños sitios de Plone y también en enormes sitios de intranet. Como desarrollador de Open Source / Software Libre se unió al equipo de desarrolladores del núcleo de Plone en 2011 y trabaja en Starzel.de.

source: Fulvio Casali has been working almost exclusively with Plone since 2008. He struggled for years to find his way around the source code of Plone when there was no documentation and no trainings, and feels passionate about helping users and developers become proficient.
es: Fulvio Casali ha estado trabajando casi exclusivamente con Plone desde 2008. Luchó durante años para encontrar su camino en el código fuente de Plone cuando no había documentación ni entrenamientos, y se siente apasionado por ayudar a los usuarios y desarrolladores a ser competentes.

source: He loves participating in Plone community events, and organized two strategic Plone sprints on the northwest coast of the USA and helped galvanized the developer community there.
es: Le encanta participar en los eventos comunitarios de Plone, y organizó dos sprints estratégicos de Plone en la costa noroeste de los EE.UU. y ayudó a galvanizar a la comunidad de desarrolladores allí.

source: Johannes Raggam from Graz/Austria works most of the time with a technology stack based around Python, Plone, Pyramid and JavaScript. As an active Open Source / Free Software developer he believes in the power of collaborative work.
es: Johannes Raggam de Graz/Austria trabaja la mayor parte del tiempo con una pila de tecnología basada en Python, Plone, Pyramid y JavaScript. Como desarrollador activo de código abierto/software libre, cree en el poder del trabajo colaborativo.

source: He is a BlueDynamics Alliance Partner and Plone Core Contributor since 2009, a member of the Plone Framework Team since 2012 and Plone Foundation member.
es: Es socio de BlueDynamics Alliance y colaborador del núcleo de Plone desde 2009, miembro del equipo de Framework de Plone desde 2012 y miembro de la Fundación Plone.

source: Franco Pellegrini is a software developer from Cordoba, Argentina. He started developing Plone in 2005 in a small software company, and as an independent contractor since 2011. He believes in free software philosophy, and so, he has been a Plone core developer since 2010 and Framework Team member since 2012.
es: Franco Pellegrini es un desarrollador de software de Córdoba, Argentina. Comenzó a desarrollar Plone en 2005 en una pequeña empresa de software y como contratista independiente desde 2011. Cree en la filosofía del software libre, y por eso, ha sido desarrollador de Plone Core desde 2010 y miembro del equipo de Framework desde 2012.

source: Fred, from Rotterdam the Netherlands, has been exposed to Plone early on as a user. In 2007 he joined Zest Software to work on and with Plone and Python web apps full time.
es: Fred, de Rotterdam, Holanda, ha estado expuesto a Plone desde el principio como usuario. En 2007 se unió a Zest Software para trabajar en aplicaciones web Plone y Python a tiempo completo.

source: He can focus on the business side, helping users decide on which features are most valuable to develop or when to stick with standard functionality. He also gives training on using and administering the CMS. On the IT side he has plenty technical knowledge to work on code, system administration and do project management in a team of developers.
es: Se puede enfocar en el aspecto comercial, ayudando a los usuarios a decidir qué características son más valiosas para desarrollar o cuándo seguir con la funcionalidad estándar. También se brinda entrenamiento sobre el uso y la administración del CMS. En el lado de TI, tiene muchos conocimientos técnicos para trabajar en código, administración de sistemas y gestión de proyectos en un equipo de desarrolladores.

source: Leonardo J. Caballero G. of Maracaibo, Venezuela, is a Technical Director at Covantec R.L. and Conectivo C.A. Leonardo maintains the Spanish translations of more than 49 Plone Add-ons as well as Spanish-language documentation for Plone itself.
es: Leonardo J. Caballero G. de Maracaibo, Venezuela, es Director Técnico de Covantec R.L. y Conectivo C.A. Leonardo mantiene las traducciones en español de más de 49 complementos de Plone, así como documentación en español para Plone.

source: He has contributed several Plone Add-ons that are part of PloneGov. Currently serving the Plone Board as a Plone Ambassador, Leonardo has also served as an Advisory Board member and has spoken at or helped organize Plone and open-source events throughout South America.
es: Ha contribuido con varios complementos de Plone que forman parte de PloneGov. Actualmente sirve a la Junta de Plone como Embajador de Plone, Leonardo también ha servido como un miembro de la Junta Asesora y ha hablado en o ayudado a organizar eventos de Plone y código abierto en toda América del Sur.

source: Using the documentation for a training
es: Usando la documentación para un entrenamiento

source: Feel free to organize a training yourself. Please be so kind to contribute any bug fixes or enhancements you made to the documentation for your training.
es: Siéntase libre para organizar un entrenamiento por ti mismo. Por favor, sea tan amable de aportar cualquier corrección de errores o mejoras que haya realizado en la documentación de su entrenamiento.

source: The training is rendered using Sphinx and builds in two flavors:
es: El entrenamiento se genera mediante la herramienta Sphinx y se basa en dos sabores:

source: default
es: por defecto

source: The verbose version used for the online documentation and for the trainer. Build it in Sphinx with ``make html`` or use the online version.
es: La versión detallada utilizada para la documentación en línea y para el instructor. Para construirlo con Sphinx, ejecute el comando ``make html`` o use la versión en línea.

source: presentation
es: presentación

source: An abbreviated version used for the projector during a training. It should use more bullet points than verbose text. Build it in Sphinx with ``make presentation``.
es: Una versión abreviada utilizada para el proyector durante un entrenamiento. Ese debe usar más lista de viñetas que texto detallado. Para construirlo con Sphinx, ejecute el comando ``make presentation``.

source: By prefixing an indented block of text or code with ``.. only:: presentation`` you can control that this block is used for the presentation version only.
es: Anteponiendo un bloque con indentación de texto o código con ``.. only:: presentation`` usted puede controlar que este bloque es usado solamente en la versión presentación.

source: To hide a block from the presentation version use ``.. only:: not presentation``
es: Para ocultar un bloque desde la versión presentación use ``.. only:: not presentation``

source: Content without a prefix will be included in both versions.
es: Contenido sin un prefijo será incluido en ambas versiones.

source: The readthedocs theme
es: El tema readthedocs

source: We slightly tweaked the `Read the Docs Theme <https://github.com/rtfd/sphinx_rtd_theme>`_ in ``_static/custom.css`` so that it works better with projectors:
es: Nos ajustamos ligeramente al `Tema de Read the Docs <https://github.com/rtfd/sphinx_rtd_theme>`_ en el archivo ``_static/custom.css`` para que funcione mejor con proyectores:

source: We start hiding the navigation bar much earlier so that it does not interfere with the text.
es: Comenzamos ocultar la barra de navegación mucho antes de manera que no interfiera con el texto.

source: We enlarge the default width of the content-area.
es: Ampliamos el ancho por defecto del área de contenido.

source: Exercises
es: Ejercicios

source: Some additional JavaScript shows hidden solutions for exercises by clicking.
es: Algunos javascript adicionales muestran las soluciones ocultas para los ejercicios haciendo clic en ellos.

source: Prepend the solution with this markup::
es: Simplemente escriba la solución con este markup::

source: Here is a full example
es: Aquí hay un ejemplo completo

source: It will be rendered like this:
es: Eso será renderizado como algo así:

source: Exercise 1
es: Ejercicio 1

source: Your mission, should you choose to accept it...
es: Su misión, si decide aceptarla...

source: Solution
es: Solución

source: To save the world with only seconds to spare do the following:
es: Para salvar al mundo con sólo unos segundos de sobra haga lo siguiente:

source: Building the documentation locally
es: Construyendo la documentación localmente

source: Dependencies
es: Dependencias

source: Please make sure that you have `Enchant <https://www.abisource.com/projects/enchant/>`_ installed. This is needed for spell-checking.
es: Por favor, asegúrese que tiene `Enchant <https://www.abisource.com/projects/enchant/>`_ instalado. Esto es necesario para la revisión ortográfica.

source: Install Enchant on macOS:
es: Instalar Enchant en macOS:

source: Install Enchant on Ubuntu:
es: Instalar Enchant en Ubuntu:

source: To build the documentation follow these steps:
es: Para construir la documentación siga estos pasos:

source: Now install dependencies and build.
es: Ahora instale las dependencias y construya.

source: You can now open the output from ``_build/html/index.html``. To build the presentation version use ``make presentation`` instead of ``make html``.
es: Ahora puede abrir lo generado en el directorio ``_build/html/index.html``. Para construir la versión de presentación ejecute el comando ``make presentation`` en lugar del comando ``make html``.

source: You can open the presentation at ``presentation/index.html``.
es: Usted puede abrir la versión presentación en el directorio ``presentation/index.html``.

source: Build new
es: Construir nuevo

source: Now you can open documentation with your web-bowser.
es: Ahora puede abrir la documentación con su navegador web.

source: If you use macOS you can do:
es: Si usted usa macOS usted puede hacer:

source: In the case of Linux, Ubuntu for example you can do:
es: En el caso de Linux, Ubuntu por ejemplo usted puede hacer:

source: If you do not use Firefox but Chrome, please replace firefox with google-chrome e.g
es: Si no usa Firefox sino Chrome, reemplace Firefox por google-chrome, por ejemplo

source: Update existing
es: Actualizar copia existente

source: Technical set up to do before a training (as a trainer)
es: Instalación técnica que hacer antes de un entrenamiento (como entrenador)

source: Prepare a mailserver for the user registration mail (See :ref:`features-mailserver-label`)
es: Preparar un servidor de correo electrónico para el registro de usuario (Ver :ref:`features-mailserver-label`)

source: If you do only a part of the training (Advanced) prepare a database with the steps of the previous sections. Be aware that the file- and blobstorage in the Vagrant box is here: /home/vagrant/var/ (not at the buildout path /vagrant/buildout/)
es: Si usted sólo hace una parte del entrenamiento (Avanzado) prepare una base de datos con los pasos de los secciones anteriores. Tenga en cuenta que el archivo y el blobstorage en el Vagrant box están aquí: /home/vagrant/var/ (no con la ruta del directorio de buildout /vagrant/buildout/)

source: Upgrade the vagrant and buildout to a new Plone-version
es: Actualizar el vagrant y buildout a una nueva versión de Plone

source: In https://github.com/collective/training_buildout change `buildout.cfg <https://github.com/collective/training_buildout/blob/master/buildout.cfg>`_ to extend from the new `versions.cfg` on http://dist.plone.org/release
es: En https://github.com/collective/training_buildout cambiar el archivo `buildout.cfg <https://github.com/collective/training_buildout/blob/master/buildout.cfg>`_ para extender desde un nuevo archivo `versions.cfg` en http://dist.plone.org/release

source: Check if we should to update any versions in https://github.com/collective/training_buildout/blob/master/versions.cfg
es: Verifique si debemos actualizar cualquier versión en el archivo https://github.com/collective/training_buildout/blob/master/versions.cfg

source: Commit and push the changes to the training_buildout
es: Haga commit y push al repositorio training_buildout

source: Modify the vagrant-setup by modifying :file:`plone_training_config/manifests/plone.pp`. Set the new Plone-version as `$plone_version` in line 3.
es: Cambie la configuración vagrant modificando :file:`plone_training_config/manifests/plone.pp`. Establezca la nueva versión de Plone como `$plone_version` en la línea 3.

source: Test the vagrant-setup it by creating a new vagrant-box using the new config.
es: Pruebe la configuración de vagrant creando una nueva vagrant box usando la nueva configuración.

source: Create a new zip-file of all files in `plone_training_config` and move it to `_static`:
es: Cree un nuevo archivo zip de todos los archivos en `plone_training_config` y muévalo a al directorio `_static`:

source: Commit and push the changes to https://github.com/plone/training
es: Haga commit y push de los cambios al repositorio https://github.com/plone/training

source: Train the trainer
es: Entrena al entrenador

source: If you are a trainer there is a special mini training about giving technical trainings. We really want this material to be used, re-used, expanded, and improved by Plone trainers world wide.
es: Si eres entrenador, hay un pequeño entrenamiento especial sobre el entrenamiento técnico. Realmente queremos que este material sea utilizado, reutilizado, ampliado y mejorado por los entrenadores de Plone en todo el mundo.

source: These chapters don't contain any Plone specific advice. There's background, theory, check lists, and tips for anyone trying to teach technical subjects.
es: Estos capítulos no contienen ningún consejo específico de Plone. Hay antecedentes, teoría, listas de verificación y consejos para cualquiera que trate de enseñar materias técnicas.

source: Contributing
es: Contribuyendo

source: Everyone is **very welcome** to contribute. Minor bug fixes can be pushed directly in the `repository <https://github.com/plone/training>`_, bigger changes should made as `pull-requests <https://github.com/plone/training/pulls/>`_ and discussed previously in tickets.
es: Todos **están invitados** a contribuir. Los cambios de errores menores pueden ser suministrados directamente en el `repositorio <https://github.com/plone/training>`_, los cambios más grandes deben haber como un `pull requests <https://github.com/plone/training/pulls/>`_ y discutirlos previamente en la sección de tickets.

source: License
es: Licencia

source: The Mastering Plone Training is licensed under a `Creative Commons Attribution 4.0 International License <https://creativecommons.org/licenses/by/4.0/>`_.
es: El entrenamiento "Maestría en Plone" es licenciado bajo la `Creative Commons Attribution 4.0 International License <https://creativecommons.org/licenses/by/4.0/>`_.

source: Make sure you have filled out a `Contributor Agreement <https://plone.org/foundation/contributors-agreement>`_.
es: Asegúrese de que ha completado el `Acuerdo de contribuidor <https://plone.org/foundation/contributors-agreement>`_.

source: If you haven't filled out a Contributor Agreement, you can still contribute. Contact the Documentation team, for instance via the `mailinglist <https://sourceforge.net/p/plone/mailman/plone-docs/>`_ or directly send a mail to plone-docs@lists.sourceforge.net
es: Si usted no ha completado un Acuerdo de colaborador, todavía puede aportar. Póngase en contacto con el equipo de documentación, por ejemplo a través de la `lista de correo <https://sourceforge.net/p/plone/mailman/plone-docs/>`_ o directamente enviar un correo a plone-docs@lists.sourceforge.net

source: Basically, all we need is your written confirmation that you are agreeing your contribution can be under Creative Commons.
es: Básicamente, todo lo que necesitamos es la confirmación por escrito que usted está de acuerdo que su contribución puede ser bajo licencia Creative Commons.

source: You can also add in a comment with your pull request "I, <full name>, agree to have this published under Creative Commons 4.0 International BY".
es: También puede añadir en un comentario con su pull request "Yo, <nombre completo>, estoy acuerdo en que esta publicado bajo licencia Creative Commons 4.0 International BY".

source: Extend Plone With Add-On Packages
es: Extiende Plone con paquetes Complementos

source: There are more than 2,000 add-ons for Plone. We will cover only a handful today.
es: Hay más de 2000 complementos para Plone. Nosotros vamos a cubrir sólo un puñado de hoy.

source: Using them saves a lot of time
es: Usándolos puedes ahorrarte mucho tiempo

source: The success of a project often depends on finding the right add-on
es: El éxito del proyecto a veces depende en encontrar el complemento adecuado

source: Their use, usefulness, quality and complexity varies a lot
es: Su uso, utilidad, calidad y complejidad varia mucho

source: Some notable add-ons
es: Algunos complementos notables

source: A form generator and the successor to `Products.PloneFormGen <https://docs.plone.org/develop/plone/forms/ploneformgen.html>`_
es: Un generador de formularios y el sucesor de complemento `Products.PloneFormGen <https://docs.plone.org/develop/plone/forms/ploneformgen.html>`_

source: A simple form created with collective.easyform.
es: Un formulario simple creado con collective.easyform.

source: Editing a form field through the web.
es: Creando campos de relación a través de la web.

source: Layout solution to easily create complex layouts through the web.
es: Solución de diseño para crear fácilmente diseños complejos a través de la web.

source: Flexible bundle of add-ons to geo-reference content and display in maps
es: Paquete flexible de complementos para hacer referencias geográficamente de contenido y mostrarlo en mapas

source: Allows visitors to subscribe to mailchimp newsletters
es: Permite a los visitantes suscribirse a boletín de noticias mailchimp

source: Create faceted navigation and searches through the web.
es: Crear la navegación facetada y búsquedas a través de la web.

source: Microsites for Plone - makes subfolders appear to be autonomous Plone sites
es: Micro-sitios para Plone: las sub-carpetas parecen estar sitios autónomos de Plone

source: A flexible doormat
es: Un flexible pie de página basado en el patrón de diseño doormat
