Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Note that the only field in the XML schema of the News Item is the one we just added. All others are provided by behaviors.
es: Note que el único campo en el esquema XML de la Noticia es el que acaba de añadir. Todos los demás son proporcionados por los comportamientos.

source: Edit the form-widget-type so it says:
es: Editar el de tipo widget del formulario por lo que dice:

source: Edit the News Item again. The widget changed from a radio field to a check box.
es: Edite de nuevo el elemento de Noticia. El widget de cambiado de un campo de radio a una casilla de verificación.

source: The new field ``Hot News`` is not displayed when rendering the News Item. We'll take care of this later.
es: El nuevo campo ``Hot News`` no se visualiza cuando se representa la Noticia. Nosotros nos ocuparemos de esto más adelante.

source: Creating content types TTW
es: Creando tipos de contenidos a través de la Web

source: In this step we will create a content type called *Talk* and try it out. When it's ready we will move the code from the web to the file system and into our own add-on. Later we will extend that type, add behaviors and a viewlet for Talks.
es: En este paso vamos a crear un tipo de contenido llamado *Talk* (para las charlas) y probarlo. Cuando esté listo vamos a mover el código fuente de la Web para el sistema de archivos y en nuestro propio complemento. Más tarde vamos a ampliar ese tipo, los comportamientos y añadir un viewlet de las Charlas.

source: Add new content type "Talk" and some fields for it:
es: Añadir un nuevo tipo de contenido llamado "Talk" y algunos campos para el:

source: :guilabel:`Add new field` "Type of talk", type "Choice". Add options: talk, keynote, training.
es: :guilabel:`Añada nuevo campo` "Type of talk", de tipo "Selección". Añadir opciones talk, keynote, training.

source: :guilabel:`Add new field` "Details", type "Rich Text" with a maximal length of 2000.
es: :guilabel:`Añada nuevo campo` "Details", de tipo "Rich Text" con un tamaño máximo de 2000.

source: :guilabel:`Add new field` "Audience", type "Multiple Choice". Add options: beginner, advanced, pro.
es: :guilabel:`Añada nuevo campo` "Audience", de tipo "Selección múltiple". Añadir opciones: beginner, advanced, pro.

source: Check the behaviors that are enabled: *Dublin Core metadata*, *Name from title*. Do we need them all?
es: Marque los comportamientos que están habilitados: *Metadatos Dublin Core*, *Nombre a partir del título*. ¿Tenemos todos necesitamos?

source: Test the content type.
es: Pruebe el tipo de contenido.

source: Return to the control panel http://localhost:8080/Plone/@@dexterity-types
es: Regrese al panel de control http://localhost:8080/Plone/@@dexterity-types

source: Extend the new type: add the following fields:
es: Extienda el nuevo tipo: añada los siguientes campos:

source: "Speaker", type: "Text line"
es: "Speaker", tipo: "Línea de texto (cadena de caracteres)"

source: "Email", type: "Email"
es: "Email", tipo: "Email (correo electrónico)"

source: "Image", type: "Image", not required
es: "Image", tipo: "Image", no requerido

source: "Speaker Biography", type: "Rich Text"
es: "Speaker Biography", tipo: "Rich Text"

source: Test again.
es: Probar otra vez.

source: Here is the complete XML schema created by our actions:
es: Aquí está el código completo de esquema XML creado por nuestras acciones:

source: Moving contenttypes into code
es: Moviendo el tipo de contenido dentro del código fuente

source: It's awesome that we can do so much through the web. But it's also a dead end if we want to reuse this content type in other sites.
es: Es impresionante que podemos hacer tanto a través de la Web. Pero también es un callejón sin salida si queremos volver a utilizar este tipo de contenido en otros sitios.

source: Also, for professional development, we want to be able to use version control for our work, and we'll want to be able to add the kind of business logic that will require programming.
es: También, para el desarrollo profesional, queremos ser capaces de utilizar el control de versiones para nuestro trabajo, y vamos a querer ser capaz de añadir la clase de lógica de negocio que requerirá de programación.

source: So, we'll ultimately want to move our new content type into a Python package. We're missing some skills to do that, and we'll cover those in the next couple of chapters.
es: Por lo tanto, vamos a última instancia querer mover nuestro nuevo tipo de contenido en un paquete Python. Nos faltan algunas habilidades para hacer eso, y vamos a cubrir aquellos en los próximos dos capítulos.

source: `The standard behaviors <https://docs.plone.org/external/plone.app.dexterity/docs/reference/standard-behaviours.html>`_
es: `Los comportamientos estandar <https://docs.plone.org/external/plone.app.dexterity/docs/reference/standard-behaviours.html>`_

source: Modify Pages to allow uploading an image as decoration (like News Items do).
es: Modificar el tipo de contenido Páginas para permitir subir una imagen como la decoración (como las Noticias).

source: Go to the dexterity control panel (http://localhost:8080/Plone/@@dexterity-types)
es: Valla al panel de control Tipos de contenido Dexterity (http://localhost:8080/Plone/@@dexterity-types)

source: Click on *Page* (http://127.0.0.1:8080/Plone/dexterity-types/Document)
es: Haga clic en *Página* (http://127.0.0.1:8080/Plone/dexterity-types/Document)

source: Select the tab *Behaviors* (http://127.0.0.1:8080/Plone/dexterity-types/Document/@@behaviors)
es: Seleccione la pestaña *Comportamientos* (http://127.0.0.1:8080/Plone/dexterity-types/Document/@@behaviors)

source: Check the box next to :guilabel:`Lead Image` and save.
es: Marque la casilla junto a :guilabel:`Imagen Lead` y guardar.

source: The images are displayed above the title.
es: Las imágenes se muestran por encima del título.

source: Create a new content type called *Speaker* and export the schema to a XML File. It should contain the following fields:
es: Crear un nuevo tipo de contenido llamada *Speaker* y exportar el esquema a un archivo XML. Debe contener los siguientes campos:

source: Title, type: "Text Line"
es: Title, tipo: "Text Line"

source: Email, type: "Email"
es: Email, tipo: "Email (correo electronico)"

source: Homepage, type: "URL" (optional)
es: Homepage, tipo: "URL" (opcional)

source: Biography, type: "Rich Text" (optional)
es: Biography, tipo: "Rich Text" (opcional)

source: Company, type: "Text Line" (optional)
es: Company, tipo: "Text Line" (opcional)

source: Twitter Handle, type: "Text Line" (optional)
es: Twitter Handle, tipo: "Text Line" (opcional)

source: IRC Handle, type: "Text Line" (optional)
es: IRC Handle, tipo: "Text Line" (opcional)

source: Image, type: "Image" (optional)
es: Image, tipo: "Image" (opcional)

source: Do not use the DublinCore or the Basic behavior since a speaker should not have a description (unselect it in the Behaviors tab).
es: No use DublinCore o el comportamiento básico, ya que un speaker no debe tener una descripción (anule la selección en la pestaña Comportamientos).

source: We could use this content type later to convert speakers into Plone users. We could then link them to their talks.
es: Podríamos utilizar este tipo de contenido después de convertir los ponentes en los usuarios de Plone. Podríamos luego enlazar a sus charlas.

source: The schema should look like this:
es: El esquema debería lucir así:

source: `Model-driven types <https://docs.plone.org/external/plone.app.dexterity/docs/model-driven-types.html#model-driven-types>`_
es: `Tipos dirigidos por Modelo <https://docs.plone.org/external/plone.app.dexterity/docs/model-driven-types.html#model-driven-types>`_

source: Dexterity Types II: Growing Up
es: Tipos Dexterity - Parte II: Creciendo

source: The existing talks are still lacking some functionality we want to use.
es: Las charlas existentes todavía faltan algunas funciones que queremos utilizar.

source: In this part we will:
es: En esta parte vamos a tratar:

source: add a marker interface to our talk type,
es: añadir una interfaz marcador para nuestro tipo de contenido talk,

source: create custom catalog indexes,
es: crear catálogo de índices personalizados,

source: query the catalog for them,
es: consultar al catálogo a estos,

source: enable some more default features for our type.
es: permitir a algunas características más por defecto para nuestro tipo de contenido.

source: Add a marker interface to the talk type
es: Añadir una interfaz marcador para el tipo de contenido talk

source: Marker Interfaces
es: Interfaces Marcador

source: The content type `Talk` is not yet a *first class citizen* because it does not implement its own interface. Interfaces are like nametags, telling other elements who and what you are and what you can do. A marker interface is like such a nametag. The talks actually have an auto-generated marker interface ``plone.dexterity.schema.generated.Plone_0_talk``.
es: El tipo de contenido `Talk` aún no es *ciudadano de primera clase* porque no implementa su propia interfaz. Las interfaces son como nombre de etiquetas, le dicen a otros elementos quién y qué eres y qué puedes hacer. Una interfaz de marcador es como una etiqueta de nombre. Las talks en realidad tienen una interfaz de marcador autogenerada ``plone.dexterity.schema.generated.Plone_0_talk``.

source: One problem is that the name of the Plone instance ``Plone`` is part of that interface name. If you now moved these types to a site with another name the code that uses these interfaces would no longer find the objects in question.
es: Un problema es que el nombre de la instancia de Plone ``Plone`` es parte de ese nombre de interfaz. Si ahora movió estos tipos a un sitio con otro nombre, el código que usa estas interfaces ya no encontrará los objetos en cuestión.

source: To create a real name-tag we add a new :py:class:`Interface` to :file:`interfaces.py`:
es: Para crear una etiqueta de nombre real, añadimos una nueva :py:class:`Interface` al archivo :file:`interfaces.py`:

source: :py:class:`ITalk` is a marker interface. We can bind Views and Viewlets to content that provide these interfaces. Lets see how we can provide this Interface. There are two solutions for this.
es: :py:class:`ITalk` es una interfaz marcador. Podemos anexar Vistas y Viewlets a contenido que provee estas interfaces. Ahora veremos como proveer esta interfaz. Hay dos soluciones para esto.

source: Let them be instances of a class that implements this Interface.
es: Dejemos que sean las instancias de una clase que implementa esta interfaz.

source: Register this interface as a behavior and enable it on talks.
es: Registra esta interfaz como un comportamiento y habilite este en los elementos del tipo de contenido talk.

source: The first option has an important drawback: only *new* talks would be instances of the new class. We would either have to migrate the existing talks or delete them.
es: La primera opción tiene un inconveniente importante: Sólo *nuevas* charlas pueden ser instancias de una nueva clase. Nos gustaría o podríamos tal vez tener que migrar a las charlas existentes o eliminarlas.

source: So let's register the interface as a behavior in :file:`behaviors/configure.zcml`
es: Así que vamos a registrar la interfaz como un comportamiento en el archivo :file:`behaviors/configure.zcml`

source: And enable it on the type in :file:`profiles/default/types/talk.xml`
es: Y habilite este en la definición de tipo de contenido el archivo :file:`profiles/default/types/talk.xml`

source: Either reinstall the add-on, apply the behavior by hand or run an upgrade step (see below) and the interface will be there.
es: Vuelva a instalar el complemento, aplicar el comportamiento a mano o ejecutar una paso de actualización GenericSetup (ver más abajo) y la interfaz estará allí.

source: Then we can safely bind the ``talkview`` to the new marker interface.
es: Entonces podemos unir con seguridad el la vista ``talkview`` a la nueva interfaz marcador.

source: Now the ``/talkview`` can only be used on objects that implement said interface. We can now also query the catalog for objects providing this interface :py:meth:`catalog(object_provides="ploneconf.site.interfaces.ITalk")`. The ``talklistview`` and the ``demoview`` do not get this constraint since they are not only used on talks.
es: Ahora la vista ``/talkview`` puede solamente se usada en objetos que implementan dicha interfaz. Ahora también podemos consultar el catálogo para los objetos que proporcionan esta interfaz :py:meth:`catalog(object_provides="ploneconf.site.interfaces.ITalk")`. Las vistas ``talklistview`` y el ``demoview`` no reciben esta restricción, ya que no sólo son utilizados en las charlas.

source: Just for completeness sake, this is what would have to happen for the first option (associating the :py:class:`ITalk` interface with a :py:class:`Talk` class):
es: Sólo para completarlo, esto es lo que tendría que pasar por la primera opción (asociando la interfaz :py:class:`ITalk` con una clase :py:class:`Talk`):

source: Create a new class that inherits from :py:class:`plone.dexterity.content.Container` and implements the marker interface.
es: Crear una nueva clase que herede desde :py:class:`plone.dexterity.content.Container` e implementa la interfaz marcador.

source: Modify the class for new talks in :file:`profiles/default/types/talk.xml`
es: Modificar la clase para las nuevas charlas en el archivo :file:`profiles/default/types/talk.xml`

source: Create an upgrade step that changes the class of the existing talks. A reuseable method to do such a thing is in `plone.app.contenttypes.migration.dxmigration.migrate_base_class_to_new_class <https://github.com/plone/plone.app.contenttypes/blob/master/plone/app/contenttypes/migration/dxmigration.py#L130>`_.
es: Cree un paso de actualización que cambie la clase de las charlas existentes. Un método reutilizable para hacer tal cosa está en `plone.app.contenttypes.migration.dxmigration.migrate_base_class_to_new_class <https://github.com/plone/plone.app.contenttypes/blob/master/plone/app/contenttypes/migration/dxmigration.py#L130>`_.

source: Upgrade steps
es: Pasos de actualización

source: When projects evolve you sometimes want to modify various things while the site is already up and brimming with content and users. Upgrade steps are pieces of code that run when upgrading from one version of an add-on to a newer one. They can do just about anything. We will use an upgrade-step to enable the new behavior instead of reinstalling the addon.
es: Cuando los proyectos evolucionan, a veces desea modificar varias cosas mientras el sitio ya está activo y rebosando contenido y usuarios. Los pasos de actualización son piezas de código que se ejecutan al actualizar de una versión de un complemento a una más nueva. Ellos pueden hacer casi cualquier cosa. Utilizaremos un paso de actualización para habilitar el nuevo comportamiento en lugar de volver a instalar el complemento.

source: We will create an upgrade step that:
es: Nosotros crearemos un paso de actualización que:

source: runs the typeinfo step (i.e. loads the GenericSetup configuration stored in ``profiles/default/types.xml`` and ``profiles/default/types/...`` so we don't have to reinstall the add-on to have our changes from above take effect) and
es: ejecute el paso ``typeinfo`` (es decir, carga los almacenes de configuración GenericSetup en ``profiles/default/types.xml`` y ``profiles/default/types/...`` por lo que no tiene que volver a instalar el complemento para tener nuestros cambios hechos) y

source: cleans up the talks that might be scattered around the site in the early stages of creating it. We will move all talks to a folder ``talks`` (unless they already are there).
es: haga una limpieza de algún contenido que pudiera estar esparcidos alrededor del sitio en las primeras etapas de su creación. Nos movemos todas las charlas en una carpeta llamadas ``talks`` (a menos que ya están allí).

source: Upgrade steps can be registered in their own ZCML file to prevent cluttering the main :file:`configure.zcml`. Include a new :file:`upgrades.zcml` in our :file:`configure.zcml` by adding:
es: Los pasos de actualización pueden ser registrados en su propios archivo ZCML para prevenir el cluttering del archivo principal :file:`configure.zcml`. Incluir un nuevo archivo :file:`upgrades.zcml` en nuestro archivo :file:`configure.zcml` para añadir:

source: Create :file:`upgrades.zcml`:
es: Cree el archivo :file:`upgrades.zcml`:

source: The upgrade step bumps the version number of the GenericSetup profile of :py:mod:`ploneconf.site` from 1000 to 1001. The version is stored in :file:`profiles/default/metadata.xml`. Change it to
es: El paso de actualización cambia la versión número del perfil GenericSetup del paquete :py:mod:`ploneconf.site` de 1000 a 1001. La versión se almacena en :file:`profiles/default/metadata.xml`. Cámbielo al siguiente:

source: GenericSetup now expects the code as a method :py:meth:`upgrade_site` in the file :file:`upgrades.py`. Let's create it.
es: GenericSetup ahora espera el código como un método :py:meth:`upgrade_site` en el archivo :file:`upgrades.py`. Vamos a crearlo.

source: Note:
es: Nota:

source: Upgrade-steps get the tool ``portal_setup`` passed as their argument.
es: Los pasos de actualización obtienen la herramienta ``portal_setup`` pasada como su argumento.

source: The ``portal_setup`` tool has a method :py:meth:`runImportStepFromProfile`
es: La herramienta ``portal_setup`` tiene un método :py:meth:`runImportStepFromProfile`

source: We create the needed folder-structure if it does not exists.
es: Creamos la estructura de carpetas necesaria si no existe.

source: After restarting the site we can run the step:
es: Después de iniciar de nuevo el sitio, nosotros podemos ejecutar el paso:

source: Go to the :guilabel:`Add-ons` control panel http://localhost:8080/Plone/prefs_install_products_form. There should now be a new section **Upgrades** and a button to upgrade from 1000 to 1001.
es: Valla al panel control :guilabel:`Complementos` en la dirección URL http://localhost:8080/Plone/prefs_install_products_form. Ahora debe haber una nueva sección **Actualizaciones** y un botón para actualizar de 1000 a 1001.

source: Run the upgrade step by clicking on it.
es: Ejecutar el paso de actualización haciendo clic en el.

source: On the console you should see logging messages like::
es: En la consola debería ver mensajes de registro como este::

source: Alternatively you also select which upgrade steps to run like this:
es: Alternativamente, usted puede seleccionar los pasos de actualización para ejecutarlo de la siguiente manera:

source: In the ZMI go to *portal_setup*
es: En la ZMI valla a la herramienta *portal_setup*

source: Go to the tab :guilabel:`Upgrades`
es: Valla a la pestaña :guilabel:`Upgrades`

source: Select :guilabel:`ploneconf.site` from the dropdown and click :guilabel:`Choose profile`
es: Seleccione :guilabel:`ploneconf.site` desde la lista desplegable y haga clic :guilabel:`Choose profile`

source: Run the upgrade step.
es: Ejecutar el paso de actualización.

source: Upgrading from an older version of Plone to a newer one also runs upgrade steps from the package :py:mod:`plone.app.upgrade`. You should be able to upgrade a clean site from 2.5 to 5.0 with one click.
es: Actualizando desde una versión anterior de Plone a uno más reciente también puede ejecutar los pasos de actualización del paquete :py:mod:`plone.app.upgrade`. Usted debe ser capaz de actualizar un sitio limpio de Plone 2.5 a Plone 5.0 con un solo clic.

source: For an example see the upgrade-step to Plone 5.0a1 https://github.com/plone/plone.app.upgrade/blob/master/plone/app/upgrade/v50/alphas.py#L37
es: Para un ejemplo ver el paso de actualización para Plone 5.0a1 https://github.com/plone/plone.app.upgrade/blob/master/plone/app/upgrade/v50/alphas.py#L37

source: Add a browserlayer
es: Añadir una browserlayer

source: A browserlayer is another such marker interface. Browserlayers allow us to easily enable and disable views and other site functionality based on installed add-ons and themes.
es: Una Browser Layer es otro ejemplo de la interfaz marcador. Las Browser Layer nos permiten fácilmente habilitar y deshabilitar opiniones y funcionalidad de otro sitio basado en complementos y temas instalados.

source: Since we want the features we write only to be available when :py:mod:`ploneconf.site` actually is installed we can bind them to a browserlayer.
es: Como queremos que las características que escribimos sólo estén disponible cuando el paquete :py:mod:`ploneconf.site` actualmente este instalado podemos asociarlos a una browserlayer.

source: Our package already has a browserlayer (added by :py:mod:`bobtemplates.plone`). See :file:`interfaces.py`:
es: Nuestro paquete ya tiene un browser layer (añadido por :py:mod:`bobtemplates.plone`). Ver el archivo :file:`interfaces.py`:

source: It is enabled by GenericSetup when installing the package since it is registered in the :file:`profiles/default/browserlayer.xml`
es: GenericSetup lo habilita al instalar el paquete ya que está registrado en el archivo :file:`profiles/default/browserlayer.xml`

source: We should bind all views to it. Here is an example using the talkview.
es: Deberíamos unir todas las vistas. Aquí hay un ejemplo usando la vista talkview.

source: Note the relative Python path :py:class:`..interfaces.IPloneconfSiteLayer`. It is equivalent to the absolute path :py:class:`ploneconf.site.interfaces.IPloneconfSiteLayer`.
es: Tenga en cuenta el ruta relativa Python :py:class:`..interfaces.IPloneconfSiteLayer`. Es equivalente a la ruta absoluta :py:class:`ploneconf.site.interfaces.IPloneconfSiteLayer`.

source: Do you need to bind the :ref:`viewlets1-social2-label` from the chapter 'Writing Viewlets' to this new browser layer?
es: ¿Necesita vincular el :ref:`viewlets1-social2-label` del capítulo 'Writing Viewlets' a esta nueva capa del navegador?

source: No, it would make no difference since the viewlet is already bound to the marker interface :py:class:`ploneconf.site.behaviors.social.ISocial`.
es: No, no haría ninguna diferencia desde el viewlet ya está asociada a la interfaz marcador :py:class:`ploneconf.site.behaviors.social.ISocial`.

source: Add catalog indexes
es: Añadir índices del catálogo

source: In the ``talklistview`` we had to wake up all objects to access some of their attributes. That is OK if we don't have many objects and they are light dexterity objects. If we had thousands of objects this might not be a good idea.
es: En la vista ``talklistview`` nosotros tuvimos que despertar todos los objetos para acceder a algunos de sus atributos. Eso está bien si no tenemos muchos objetos y ellos son objetos ligeros Dexterity. Si tuviéramos miles de objetos que esto podría no ser una buena idea.

source: Instead of loading them all into memory we will use catalog indexes to get the data we want to display.
es: En lugar de cargar a todos en la memoria usaremos índices del catálogo para obtener los datos que queremos mostrar.

source: Add a new file :file:`profiles/default/catalog.xml`
es: Añadir un nuevo archivo :file:`profiles/default/catalog.xml`

source: This adds new indexes for the three fields we want to show in the listing. Note that *audience* is a :py:class:`KeywordIndex` because the field is multi-valued, but we want a separate index entry for every value in an object.
es: Esto añada los nuevos índices para los tres campos que queremos mostrar en el listado. No es que *audience* es un :py:class:`KeywordIndex` porque el campo es de varios valores, pero queremos una entrada de índice independiente para cada valor a un objeto.
