Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Objects are normally not loaded into memory but lie dormant in the ZODB Database. Waking objects up can be slow, especially if you're waking up a lot of objects. Fortunately our talks are not especially heavy since they are:
es: Los objetos normalmente no se cargan en la memoria, sino que permanecen inactivos en la base de datos ZODB. Despertar los objetos puede ser lento, especialmente si está despertando una gran cantidad de objetos. Afortunadamente, nuestras charlas no son especialmente pesadas, ya que son:

source: dexterity-objects which are lighter than their archetypes brothers
es: los objetos dexterity que son más ligeros que sus hermanos objetos archetypes

source: relatively few since we don't have thousands of talks at our conference
es: relativamente pocos, ya que no tenemos miles de charlas en nuestra conferencia

source: We want to show the target audience but that attribute of the talk content type is not in the catalog. This is why we need to get to the objects themselves.
es: Queremos mostrar el público objetivo, pero ese atributo del tipo de contenido charla no está en el catálogo. Es por eso que necesitamos llegar a los objetos mismos.

source: We could also add a new index to the catalog that will add 'audience' to the properties of brains, but we should weigh the pros and cons:
es: También podríamos añadir un nuevo índice al catálogo que añadirá 'audience' a las propiedades de los cerebros, pero debemos sopesar los pros y los contras:

source: talks are important and thus most likely always in memory
es: charlas son importantes y por lo tanto más probable es que siempre este en memoria

source: prevent bloating of catalog with indexes
es: prevenir la inflamación del catálogo con índices

source: The code to add such an index would look like this::
es: El código para añadir este índice se vería como el siguiente::

source: We'd have to register this factory function as a named adapter in the :file:`configure.zcml`. Assuming you've put the code above into a file named :file:`indexers.py`
es: Tendríamos que registrar esta función factory como un adaptador con nombre en el archivo :file:`configure.zcml`. Asumiendo que has puesto el código de arriba en un archivo llamado :file:`indexers.py`

source: We will add some indexers later on.
es: Vamos a añadir algunos índices más adelante.

source: Why use the catalog at all? It checks for permissions, and only returns the talks that the current user may see. They might be private or hidden to you since they are part of a top secret conference for core developers (there is no such thing!).
es: ¿Por qué usar el catálogo? Comprueba los permisos y solo devuelve las charlas que el usuario actual puede ver. Pueden ser privados u ocultos para usted, ya que son parte de una conferencia de alto secreto para los desarrolladores principales (¡no existe tal cosa!).

source: Most objects in Plone act like dictionaries, so you can do :py:meth:`context.values()` to get all its contents.
es: La mayoría de los objetos en Plone actúan como diccionarios, por lo que puedes hacer :py:meth:`context.values()` para obtener todos sus contenidos.

source: For historical reasons some attributes of brains and objects are written differently.
es: Por razones históricas, algunos atributos de cerebros y objetos se escriben de manera diferente.

source: Who can guess what :py:attr:`brain.title` will return since the brain has no such attribute?
es: ¿Quién puede adivinar qué el atributo :py:attr:`brain.title` regresará ya que el cerebro no tiene ese atributo?

source: Answer: Acquisition will get the attribute from the nearest parent. ``brain.__parent__`` is ``<CatalogTool at /Plone/portal_catalog>``. The attribute ``title`` of the ``portal_catalog`` is 'Indexes all content in the site'.
es: Respuesta: La Acquisition obtendrá el atributo de servidor principal más cercano. ``brain.__parent__`` es ``<CatalogTool at /Plone/portal_catalog>``. El atributo ``title`` del ``portal_catalog`` es 'Indexado en todo el contenido en el sitio'.

source: Acquisition can be harmful. Brains have no attribute 'getLayout' :py:meth:`brain.getLayout()`:
es: La acquisition puede ser dañina. Los cerebros no tienen ningún atributo 'getLayout' :py:meth:`brain.getLayout()`:

source: The same is true for methods:
es: Lo mismo es true para los métodos:

source: Querying the catalog
es: Consultando el catálogo

source: The are many `catalog indexes <https://docs.plone.org/develop/plone/searching_and_indexing/indexing.html>`_ to query. Here are some examples:
es: Hay muchos `índices de catálogo <https://docs.plone.org/develop/plone/searching_and_indexing/indexing.html>`_ para consultar. Aquí hay unos ejemplos:

source: Calling the catalog without parameters returns the whole site:
es: Llamar al catálogo sin parámetros devuelve todo el sitio:

source: Since you now know how to query the catalog it is time for some exercise.
es: Ya que ahora saben cómo consultar el catálogo es el momento para un poco de ejercicio.

source: Add a method :py:meth:`get_news` to :py:class:`TalkListView` that returns a list of brains of all News Items that are published and sort them in the order of their publishing-date.
es: Añada un método :py:meth:`get_news` a la clase :py:class:`TalkListView` que devuelve una lista de los cerebros de todas las noticias publicadas y las ordena en el orden de su fecha de publicación.

source: Add a method that returns all published keynotes as objects.
es: Añadir un método que regresa todas las keynotes publicadas como objetos.

source: The template for the listing
es: La plantilla para la lista

source: Next you create a template in which you use the results of the method 'talks'.
es: A continuación, crear una plantilla en la usa los resultados del método de las 'charlas'.

source: Try to keep logic mostly in python. This is for two reasons:
es: Trate de mantener la lógica mayormente en Python. Esto es por dos razones:

source: Readability:
es: Legibilidad:

source: It's much easier to read python than complex tal-structures
es: Es mucho más fácil de leer python que complejas estructuras tal

source: Speed:
es: Velocidad:

source: Python-code is faster than code executed in templates. It's also easy to add caching to methods.
es: El código Python es más rápido que el código ejecutado en las plantillas. También es fácil de añadir almacenamiento en caché a los métodos.

source: DRY:
es: Don't Repeat Yourself (DRY):

source: In Python you can reuse methods and easily refactor code. Refactoring TAL usually means having to do big changes in the html-structure which results in incomprehensible diffs.
es: En Python puede reutilizar métodos y refactorizar código fácilmente. Refactorizar TAL generalmente significa tener que hacer grandes cambios en la estructura html, lo que resulta en diferencias incomprensibles.

source: The MVC-Schema does not directly apply to Plone but look at it like this:
es: El esquema MVC no se aplica directamente a Plone pero míralo de esta manera:

source: Model:
es: Modelo:

source: the object
es: el objeto

source: View:
es: Vista:

source: the template
es: la plantilla

source: Controller:
es: Controlador:

source: the view
es: la vista

source: The view and the controller are very much mixed in Plone. Especially when you look at some of the older code of Plone you'll see that the policy of keeping logic in python and representation in templates was not always enforced.
es: La vista y el controlador están muy mezclados en Plone. Especialmente cuando nos fijamos en algunos de los códigos más antiguos de Plone verás que la política de mantener la lógica en Python y representación en las plantillas no siempre se cumple.

source: But you should nevertheless do it! You'll end up with more than enough logic in the templates anyway.
es: ¡Pero usted debe, no obstante, que lo haga! Usted va a terminar con más que suficiente lógica en las plantillas de todos modos.

source: Add this simple table to :file:`templates/talklistview.pt`:
es: Añada esta simple tabla al archivo :file:`templates/talklistview.pt`:

source: Again we use ``class="listing"`` to give the table a nice style.
es: De nuevo usamos ``class="listing"`` para darle a la tabla un estilo agradable.

source: There are some some things that need explanation:
es: Hay algunas cosas que necesitan explicación:

source: This defines the variable `talks`. We do thins since we reuse it later and don't want to call the same method twice. Since TAL's path expressions for the lookup of values in dictionaries is the same as for the attributes of objects and methods of classes we can write :samp:`view/talks` as we could :samp:`view/someattribute`. Handy but sometimes irritating since from looking at the page template alone we often have no way of knowing if something is an attribute, a method or the value of a dict.
es: Esto define la variable `talks`. Hacemos delgados ya que lo reutilizamos más tarde y no queremos llamar al mismo método dos veces. Como las expresiones de ruta de TAL para la búsqueda de valores en los diccionarios son las mismas que para los atributos de los objetos y los métodos de las clases, podemos escribir :samp:`view/talks` como podríamos :samp:`view/someattribute`. Práctico pero a veces irritante ya que al mirar la plantilla de la página solos, a menudo no tenemos forma de saber si algo es un atributo, un método o el valor de un diccionario.

source: This iterates over the list of dictionaries returned by the view. Each :py:obj:`talk` is one of the dictionaries that are returned by this method.
es: Esto itera sobre la lista de diccionarios devueltos por la vista. Cada uno :py:obj:`talk` es uno de los diccionarios que devuelve este método.

source: 'speaker' is a key in the dict 'talk'. We could also write :samp:`tal:content="talk/speaker"`
es: 'speaker' es una clave en el diccionario 'talk'. También podríamos escribir :samp:`tal:content="talk/speaker"`

source: This is a fallback if no talks are returned. It then returns an empty list (remember :samp:`results = []`?)
es: Esto es un retroceso si no se devuelven las charlas. Luego devuelve una lista vacía (recuerde :samp:`results = []`?)

source: We could also write :samp:`python:not talks` like we could also write :samp:`tal:repeat="talk python:talks"` for the iteration. For simple cases as these path-statements are sometimes fine. On the other hand: If ``talks`` would be a callable we woul need to use ``nocall:talks``, so maybe it would be better to always use ``python:``.
es: También podríamos escribir :samp:`python:not talks` como también podríamos escribir :samp:`tal:repeat="talk python:talks"` para la iteración. Para casos simples, ya que estos enunciados de ruta a veces están bien. Por otro lado: si ``talks`` sería un invocable, necesitaríamos usar ``nocall:talks``, así que tal vez sería mejor usar ``python:``.

source: Modify the view to only use path-expressions. This is **not** best-practice but there is plenty of code in Plone and in Addons so you have to know how to use them.
es: Modifique la vista para usar solo expresiones de ruta. Esta **no** es una de las mejores prácticas pero hay mucho código en Plone y en Addons, así que debes saber cómo usarlos.

source: Setting a custom view as default view on an object
es: Establecer una vista personalizada como vista por defecto en un objeto

source: We don't want to always have to append :samp:`/@@talklistview` to our folder to get the view. There is a very easy way to set the view to the folder using the ZMI.
es: No queremos tener que añadir siempre :samp:`/@@talklistview` a nuestra carpeta para obtener la vista. Hay una manera muy fácil de configurar la vista en la carpeta usando ZMI.

source: If we append :samp:`/manage_propertiesForm` we can set the property "layout" to :samp:`talklistview`.
es: Si añadimos :samp:`/manage_propertiesForm` podemos establecer la propiedad "layout" a :samp:`talklistview`.

source: To make views configurable so that editors can choose them we have to register the view for the content type at hand in its FTI. To enable it for all folders we add a new file :file:`profiles/default/types/Folder.xml`
es: Para hacer las vistas configurables para que los editores puedan elegirlas, debemos registrar la vista para el tipo de contenido en cuestión en su registro FTI. Para habilitarlo para todas las carpetas, añadimos un nuevo archivo :file:`profiles/default/types/Folder.xml`

source: After re-applying the typeinfo profile of our add-on (or simply reinstalling it) the content type "Folder" is extended with our additional view method and appears in the display dropdown.
es: Después de volver a aplicar el perfil typeinfo de nuestro complemento (o simplemente volver a instalarlo), el tipo de contenido "Carpeta" se amplía con nuestro método de vista adicional y aparece en el menú desplegable Mostrar.

source: The :samp:`purge="False"` appends the view to the already existing ones instead of replacing them.
es: El :samp:`purge="False"` añada la vista a las ya existentes en lugar de reemplazarlas.

source: You created a nice listing, that can be called at any place in the website
es: Has creado un buen listado, que se puede llamar en cualquier lugar del sitio web

source: You wrote your first fully grown BrowserView that combines a template, a class and a method in that class
es: Usted escribió su primer BrowserView completamente desarrollado que combina una plantilla, una clase y un método en esa clase

source: You learned about portal_catalog, brains and how they are related to objects
es: Has aprendido sobre el portal_catalog, los cerebros y cómo son sus objetos

source: You learned about Acquisition and how it can have unintended effects
es: Aprendió sobre la Acquisition y cómo puede tener efectos no deseados

source: You extended the FTI of a existing content type to allow the use the new view to all Editor
es: Extendió el FTI de un tipo de contenido existente para permitir el uso de la nueva vista para todos los Editores

source: Learn to write page templates
es: Aprende a escribir page templates

source: TAL and TALES
es: TAL y TALES

source: Page Templates are HTML files with some additional information, written in TAL, METAL and TALES.
es: Las Page Templates son archivos HTML con alguna Información adicional, escritas en TAL, METAL y TALES.

source: Page templates must be valid XML.
es: Page templates deben ser XML válido.

source: The three languages are:
es: Las tres lenguas son:

source: Templating XML/HTML using special attributes
es: Plantilla XML/HTML utilizando atributos especiales

source: Using TAL we include expressions within HTML
es: Usando TAL incluimos expresiones dentro de HTML

source: defines the syntax and semantics of these expressions
es: define la sintaxis y la semántica de estas expresiones

source: this enables us to combine, re-use and nest templates together
es: esto nos permite combinar, la reutilización y las plantillas anidadas juntos

source: TAL and METAL are written like HTML attributes (href, src, title). TALES are written like the values of HTML attributes.
es: TAL y METAL se escriben como atributos HTML (href, src, title). TALES están escritos como los valores de los atributos de HTML.

source: A typical TAL attribute looks like this:
es: Una declaración TAL típica tiene este aspecto:

source: It's used to modify the output:
es: Se utiliza para modificar la salida:

source: results in:
es: resultado en:

source: Let's try it.
es: Vamos a intentarlo.

source: Open the file :file:`training.pt` and add:
es: Abra el archivo :file:`training.pt` y agregue:

source: Let's add some magic and modify the <p>-tag:
es: Vamos a añadir un poco de magia y modificar la etiqueta <p>:

source: This will result in:
es: Esto resultará en el siguiente código html:

source: Without restarting Plone open http://localhost:8080/Plone/@@training.
es: Sin reiniciar Plone abra en el navegador http://localhost:8080/Plone/@@training.

source: The same happens with attributes.
es: Lo mismo ocurre con los atributos.

source: Replace the <p>-line with:
es: Remplace en la línea <p> con el siguiente código:

source: We used three TAL-Attributes here.
es: Nosotros hemos utilizado los tres atributos TAL aquí.

source: This is the complete list of TAL-attributes:
es: A continuación una la lista completa de los atributos TAL:

source: define variables. We defined the variable ``a_fine_url`` to the string "https://www.ploneconf.org/"
es: definir las variables. Nosotros definimos la variable ``a_fine_url`` para la cadena "https://www.ploneconf.org/"

source: replace the content of an element. We replaced the default content above with "An even better conference"
es: reemplazar el contenido de un elemento. Reemplazamos el contenido por defecto anterior con "A even better conference"

source: dynamically change element attributes. We set the HTML attribute ``href`` to the value of the variable ``a_fine_url``
es: cambiar dinámicamente atributos de los elementos. Nosotros hemos establecido el atributo ``href`` HTML a la variable ``a_fine_url``

source: tests whether the expression is true or false, and outputs or omits the element accordingly.
es: prueba si la expresión es true o false, y emite u omite el elemento en consecuencia.

source: repeats an iterable element, in our case the list of talks.
es: repite un elemento iterable, en nuestro caso, la lista de charlas.

source: replace the content of an element, like ``tal:content`` does, but removes the element only leaving the content.
es: reemplazar el contenido de un elemento como el atributo ``tal:content`` hace, pero se elimina el elemento sólo dejando el contenido.

source: remove an element, leaving the content of the element.
es: eliminar un elemento, dejando el contenido del elemento.

source: handle errors.
es: controlar los errores.

source: python expressions
es: expresiones python

source: Till now we only used one TALES expression (the ``string:`` bit). Let's use a different TALES expression now.
es: Hasta ahora sólo utilizamos una expresión TALES (el bit ``string:``). Usemos una expresión TALES diferente ahora.

source: With ``Python:`` we can use Python code.
es: Con ``python:`` podemos usar código python.

source: A example:
es: Un ejemplo:

source: And another:
es: Y otro ejemplo:

source: With python expressions
es: Con expresiones python

source: you can only write single statements
es: sólo se puede escribir declaraciones individuales

source: you could import things but you should not (example: ``tal:define="something modules/Products.PythonScripts/something;``).
es: usted podría importar cosas pero no debe (ejemplo: ``tal:define="something modules/Products.PythonScripts/something;``).

source: tests whether the expression is true or false.
es: prueba si la expresión es verdadera o falsa.

source: If it's true, then the tag is rendered.
es: Si es true, entonces la etiqueta se representa.

source: If it's false then the tag **and all its children** are removed and no longer evaluated.
es: Si es false, entonces la etiqueta **y todos sus hijos** se retiran y ya no se evalúa.

source: We can reverse the logic by perpending a ``not:`` to the expression.
es: Podemos revertir la lógica perpendiendo un ``not:`` a la expresión.

source: Let's add another TAL Attribute to our above example::
es: Vamos a añadir otro atributo TAL para nuestro ejemplo anterior::

source: We could also test for the number of talks::
es: También pudimos probar que el número de charlas::

source: or if a certain talk is in the list of talks::
es: o si una cierta charla está en la lista de charlas::

source: Let's try another attribute:
es: Probemos otro atributo:

source: We change the markup a little to construct a list in which there is an ``<li>`` for every talk:
es: Cambiamos el formato un poco para construir una lista en la que hay una lista de elementos html ``<li>`` para cada charla:

source: path expressions
es: expresiones de rutas

source: Regarding TALES so far we used ``string:`` or ``python:`` or only variables. The next and most common expression are path expressions.
es: En cuanto TALES hasta ahora hemos utilizado la ``string:`` o ``python:`` o sólo las variables. La expresión siguiente y más comunes son de path expressions.

source: Optionally you can start a path expression with ``path:``
es: Opcionalmente se puede iniciar path expression con el ``path:``

source: Every path expression starts with a variable name. It can either be an object like :py:obj:`context`, :py:obj:`view` or :py:obj:`template` or a variable defined by you like :py:data:`talk`.
es: Cada path expression comienza con un nombre de variable. Puede ser tanto un objeto como :py:obj:`context`, :py:obj:`view` o :py:obj:`template` o una variable definida anteriormente como :py:data:`talk`.

source: After the variable we add a slash ``/`` and the name of a sub-object, attribute or callable. The ``/`` is used to end the name of an object and the start of the property name.
es: Después de la variable se añade una barra ``/`` y el nombre de un sub-objeto, atributo o método llamable. El carácter ``/`` se utiliza para terminar el nombre de un objeto y el inicio del nombre de la propiedad.

source: Properties themselves may be objects that in turn have properties.
es: Las propiedades mismas pueden ser objetos que a su vez tienen propiedades.

source: We can chain several of those to get to the information we want.
es: Podemos encadenar varios de los elementos para obtener la información que queremos.

source: This would return the value of the form dictionary of the HTTPRequest object. Useful for form handling.
es: Esto devolverá el valor de la forma de diccionario del objeto HTTPRequest. Útil para la manipulación del formulario.

source: The ``|`` ("or") character is used to find an alternative value to a path if the first path evaluates to ``nothing`` or does not exist.
es: El carácter``|`` (operador lógico "o") se utiliza para encontrar un valor alternativo a una ruta si la primera ruta se evalúe como ``nothing`` o no existe.

source: This returns the id of the context if it has no title.
es: Esto devuelve el id del contexto si no tiene título.

source: This returns nothing if there is no 'average_rating' for a talk.
es: Esto devuelve nothing si no hay 'average_rating' para una charla.

source: What will not work is ``tal:content="python:talk['average_rating'] or ''"``.
es: Lo que no funciona es ``tal:content="python:talk['average_rating'] or ''"``.

source: Who knows what this would yield?
es: ¿Quién sabe lo que esto produciría?

source: We'll get ``KeyError: 'average_rating'``. It is very bad practice to use ``|`` too often since it will swallow errors like a typo in ``tal:content="talk/averange_ratting | nothing"`` and you might wonder why there are no ratings later on...
es: Conseguiremos ``KeyError: 'average_rating'``. Es muy mala práctica, usar el operador ``|`` con demasiada frecuencia, ya que se tragará errores como un error tipográfico en ``tal:content="talk/averange_ratting | nothing"`` y es posible que se preguntan por qué no existen calificaciones más tarde...

source: You can't and should not use it to prevent errors like a try/except block.
es: No puede y no debe utilizarlo para evitar errores como un bloque try/except.

source: There are several **built-in variables** that can be used in paths:
es: Hay varias **variables incorporado** que se pueden utilizar en paths:

source: The most frequently used one is ``nothing`` which is the equivalent to None
es: El más utilizado es ``nothing`` que es el equivalente a None

source: A dict of all the available variables at the current state is ``econtext``
es: Un diccionario de todas las variables disponibles esta en ``econtext``

source: Useful for debugging :-)
es: Muy útil para depuración :-)
