Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: This is more of a Python exercise. The gold- and bronze sponsors should also have a bigger logo than the others. Scale the sponsors logos to the following logo-sizes without using CSS.
es: Esto es más un ejercicio de Python. Los patrocinadores de oro y bronce también deben tener un logotipo más grande que los demás. Escale los logos de los patrocinadores a los siguientes tamaños de logotipo sin usar CSS.

source: Platinum: 500x200
es: Platino: 500x200

source: Gold: 350x150
es: Oro: 350x150

source: Silver: 200x80
es: Plata: 200x80

source: Bronze: 150x60
es: Bronce: 150x60

source: Write Your Own Add-Ons to Customize Plone
es: Escriba sus propios complementos para personalizar Plone

source: Create a custom Python package :py:mod:`ploneconf.site` to hold all the code
es: Cree un paquete de Python personalizado :py:mod:`ploneconf.site` para contener todo el código

source: Modify buildout to install that package
es: Modificar la configuración buildout para instalar esa paquete

source: :py:mod:`mr.bob` and :py:mod:`bobtemplates.plone`
es: :py:mod:`mr.bob` y :py:mod:`bobtemplates.plone`

source: the structure of python packages
es: la estructura de paquetes python

source: Creating the package
es: Creando el paquete

source: Your own code has to be organized as a `Python package <https://docs.python.org/2/tutorial/modules.html#packages>`_. An python package is directory that follows certain conventions to hold python modules.
es: Nuestro propio código tiene que ser organizado como un `paquete Python <https://docs.python.org/2/tutorial/modules.html#packages>`_. Un paquete Python es un directorio que sigue ciertas convenciones que contiene modulos python.

source: We are going to use `bobtemplates.plone <https://pypi.org/project/bobtemplates.plone>`_ to create a skeleton package. You only need to fill in the blanks.
es: Vamos a utilizar `bobtemplates.plone <https://pypi.org/project/bobtemplates.plone>`_ para crear un proyecto de esqueleto. Solo necesitamos completar los espacios en blanco.

source: :py:mod:`bobtemplates.plone` offers several Plone-specific templates for :py:mod:`mr.bob`, a project template builder similar to :py:mod:`cookiecutter`.
es: :py:mod:`bobtemplates.plone` ofrece muchas plantillas especificas de Plone para :py:mod:`mr.bob`, es un proyecto constructor de plantilla similar a paquete de Django :py:mod:`cookiecutter`.

source: Enter the :file:`src` directory (*src* is short for *sources*) and call a script called :command:`mrbob` from our buildout's :file:`bin` directory:
es: Nosotros creamos y accedemos al directorio :file:`src` (*src* es un atajo para *sources*) y ejecutamos un script llamado :command:`mrbob` ubicado en nuestros directorio :file:`bin` del buildout:

source: Before version 2.0.0 of :py:mod:`bobtemplates.plone` the command to create a addon was different:
es: Ante de la versión 2.0.0 del paquete :py:mod:`bobtemplates.plone` el comando para crear un complemento fue diferente:

source: You have to answer some questions about the add-on. Press :kbd:`Enter` (i.e. choosing the default value) for all questions except 3 (where you enter your GitHub username if you have one) and 5 (Plone version), where you enter :kbd:`5.1`::
es: Tenemos que responder a algunas preguntas sobre el complemento. Vamos a presionar la tecla :kbd:`Enter` (es decir, elegir el valor por defecto) para todas las preguntas, excepto la 3era pregunta (donde ingresa su nombre de usuario github si tiene uno) y la 5ta pregunta (versión Plone), donde ingresa :kbd:`5.1`::

source: If this is your first python package, this is a very special moment.
es: Si este es su primer paquete python, esto es un momento muy especial.

source: You generated a package with a lot files. It might look like too much boilerplate but all files in this package serve a clear purpose and it will take some time to learn about the meaning of each of them.
es: Usted generó un paquete con muchos archivos. Puede parecer demasiado repetitivo pero todos los archivos en este paquete tienen un propósito claro y tomará un tiempo aprender sobre el significado de cada uno de ellos.

source: Eggs
es: Paquetes Eggs

source: When a python package is production-ready you can choose to distribute it as an egg over the python package index, `pypi <https://pypi.org>`_. This allows everyone to install and use your package without having to download the code from github. The over 260 python packages that are used by your current Plone instance are also distributed as eggs.
es: Cuando un paquete python está listo para producción, puede optar por distribuirlo como un paquete egg sobre el índice del paquete python, `pypi <https://pypi.org>`_. Esto permite que todos puedan instalar y usar su paquete sin tener que descargar el código de github. Los más de 260 paquetes python que usa su instancia actual de Plone también se distribuyen como paquetes eggs.

source: Inspecting the package
es: Inspeccione el paquete

source: In :file:`src` there is now a new folder :file:`ploneconf.site` and in there is the new package. Let's have a look at some of the files:
es: En la carpeta :file:`src` ahora hay una nueva carpeta :file:`ploneconf.site` y ahí está el nuevo paquete. Echemos un vistazo a algunos de los archivos:

source: You can ignore these files for now. They are here to create a buildout only for this package to make distributing and testing it easier.
es: Puede pasar por alto estos archivos por ahora. Ellos están aquí para crear un buildout sólo para este paquete egg para hacer las pruebas más fáciles.

source: The documentation of your package goes in here.
es: La documentación de su paquete egg van aquí.

source: This file configures the package, its name, dependencies and some metadata like the author's name and email address. The dependencies listed here are automatically downloaded when running buildout.
es: Este archivo configura el paquete, su nombre, las dependencias y algunos metadatos como el nombre del y correo electrónico del autor. Las dependencias listadas aquí son descargadas automáticamente cuando ejecuta buildout.

source: The python code of your package itself lives inside a special folder structure. That seems confusing but is necessary for good testability. Our package contains a `namespace package <https://www.python.org/dev/peps/pep-0420/>`_ called *ploneconf.site* and because of this there is a folder :file:`ploneconf` with a :file:`__init__.py` and in there another folder :file:`site` and in there finally is our code. From the buildout's perspective your code is in :file:`{your buildout directory}/src/ploneconf.site/src/ploneconf/site/{real code}`
es: La distribución misma vive dentro de una estructura de carpetas especial. Eso parece confuso, pero es necesario para tener buena habilidad de prueba. Nuestra distribución contiene un `paquete de espacio de nombres <https://www.python.org/dev/peps/pep-0420/>`_ llamado *ploneconf.site* y debido a esto hay una carpeta :file:`ploneconf` con un archivo :file:`__init__.py` y allí hay otra carpeta :file:`site` y ahí finalmente está nuestro código. Desde la perspectiva de buildout, nuestro código está en la ruta :file:`{su directorio buildout}/src/ploneconf.site/src/ploneconf/site/{código real}`

source: Unless discussing the buildout we will from now on silently omit these folders when describing files and assume that :file:`{your buildout directory}/src/ploneconf.site/src/ploneconf/site/` is the root of our package!
es: A menos que discutamos el buildout, de ahora en adelante, omitiremos silenciosamente estas carpetas al describir los archivos y asumiremos que :file:`{su directorio buildout}/src/ploneconf.site/src/ploneconf/site/` ¡es el directorio raíz de nuestro paquete!

source: The phone book of the distribution. By reading it you can find out which functionality is registered using the component architecture. There are more registrations in other zcml-files in this addons (e.g. :file:`browser/configure.zcml`, :file:`upgrades.zcml` and :file:`permissions.zcml`) that are included in your main :file:`browser/configure.zcml`
es: La guía de los paquetes. De su lectura se puede averiguar qué funcionalidad está registrado a través de la arquitectura de componentes. Allí hay muchos más registros en otros archivos zcml en los complementos (e.g. :file:`browser/configure.zcml`, :file:`upgrades.zcml` and :file:`permissions.zcml`) eso son incluidos en el archivo principal :file:`browser/configure.zcml`

source: This holds code that is automatically run when installing and uninstalling our add-on.
es: Esto contiene el código que se ejecuta automáticamente al instalar y desinstalar nuestro complemento.

source: Here a browserlayer is defined in a straightforward python class. We will need it later.
es: Aquí se define un browserlayer en una simple clase de python. Lo necesitaremos más tarde.

source: This holds the setup for running tests.
es: Esta contiene la configuración para correr las pruebas del paquete.

source: This holds the tests.
es: Esta contiene las pruebas del paquete.

source: This directory is a python package (because it has a :file:`__init__.py`) and will by convention hold most things that are visible in the browser.
es: Este directorio es un paquete python (porque tiene un :file:`__init__.py) y por convención contiene la mayoría de las cosas que son visibles en el navegador.

source: The phonebook of the browser package. Here views, resources and overrides are registered.
es: La agenda del paquete del browser. Aquí se registran vistas, recursos y sobre-escrituras de Plone.

source: This folder is here to allow overriding existing default Plone templates.
es: Este complemento ya está configurado para permitir la sustitución o sobre-escritura de las plantillas por defecto de Plone existentes.

source: A directory that holds static resources (images/css/js). The files in here will be accessible through URLs like ``++resource++ploneconf.site/myawesome.css``
es: Un directorio que contiene los recursos estáticos (archivos de imágenes, CSS y JS). Los archivos aquí serán accesibles a través de las URLs como ``++resource++ploneconf.site/myawesome.css``

source: This directory can hold translations of text used in the package to allow for multiple languages of your user-interface.
es: Este directorio puede contener traducciones de texto usada en le paquete para permitir lenguajes múltiples de su interfaz de usuario.

source: This folder contains the GenericSetup profile. During the training we will put some XML files here that hold configuration for the site.
es: Esta carpeta contiene el perfil GenericSetup. Durante el entrenamiento pondremos aquí algunos archivos XML que contienen la configuración del sitio.

source: Version number and dependencies that are auto-installed when installing our add-on.
es: Número de versión y dependencias que son auto-instalado cuando esta instalando su propio complemento.

source: Including the package in Plone
es: Incluyendo el paquete egg en Plone

source: Before we can use our new package we have to tell Plone about it. Look at :file:`buildout.cfg` and see how ``ploneconf.site`` is included in `auto-checkout`, `eggs` and `test`:
es: Antes de poder utilizar nuestro nuevo complemento tenemos que indicarle de la existencia de este a Plone. Entonces edite el archivo :file:`buildout.cfg` y vea como ``ploneconf.site`` es incluida en `auto-checkout`, `eggs` y `test`:

source: This tells Buildout to add the egg :py:mod:`ploneconf.site`. The sources for this eggs are defined in the section ``[sources]`` at the bottom of :file:`buildout.cfg`.
es: Esto le dice a Buildout que añada el paquete egg :py:mod:`ploneconf.site`. Las fuentes para estos paquetes eggs se definen en la sección ``[sources]`` en la parte inferior de :file:`buildout.cfg`.

source: This tells buildout to not download it from pypi but to do a checkout from GitHub put the code in :file:`src/ploneconf.site`.
es: Esto le dice a buildout que no lo descargue de pypi, pero para hacer un checkout desde GitHub ponga el código en :file:`src/ploneconf.site`.

source: The package :py:mod:`ploneconf.site` is now downloaded from GitHub and automatically in the branch master. :py:mod:`ploneconf.site` can be called an egg even though it has not been released on pypi. Plone can use it like it uses an egg.
es: El paquete :py:mod:`ploneconf.site` ahora se descarga desde github y automáticamente en la rama master. :py:mod:`ploneconf.site` puede ser llamado un paquete egg a pesar de que no ha sido lanzado en pypi. Plone puede usarlo como usa un paquete egg.

source: If you do **not** want to use the prepared package for ploneconf.site from GitHub but write it yourself (we suggest you try that) then add the following instead:
es: Si **no** desea utilizar el paquete preparado para ploneconf.site desde GitHub, puede escribirlo usted mismo (le sugerimos que lo intente) y luego añada lo siguiente:

source: This tells buildout to expect `ploneconf.site` in :file:`src/ploneconf.site`. The directive ``fs`` allows you to add eggs on the filesystem without a version control system.
es: Esto le dice a Buildout añadir el paquete egg `ploneconf.site` en el directorio :file:`src/ploneconf.site`. La directiva ``fs`` le permite añadir paquetes eggs en el sistema de archivos sin un sistema de control de versiones.

source: Now run buildout to reconfigure Plone with the updated configuration:
es: Ahora ejecute buildout para reconfigurar Plone con la configuración actualizada:

source: After restarting Plone with :command:`./bin/instance fg` the new add-on :py:mod:`ploneconf.site` is available for install like EasyForm or Plone True Gallery.
es: Después reinicie Plone con el comando :command:`./bin/instance fg` el nuevo complemento :py:mod:`ploneconf.site` está disponible para instalar como `PloneFormGen` o `Plone True Gallery`.

source: We will not install it now since we did not add any of our own code or configuration yet. Let's do that next.
es: No lo instalaremos ahora ya que no añadimos ningún código o configuración propios todavía. Hagámoslo a continuación.

source: Create a new package called :py:mod:`collective.behavior.myfeature`. Inspect the directory structure of this package. Delete it after you are done. Many packages that are part of Plone and some add-ons use a nested namespace such as :py:mod:`plone.app.contenttypes`.
es: Crea un nuevo paquete llamado :py:mod:`collective.behavior.myfeature`. Inspeccione la estructura del directorio de este paquete. Eliminarlo una vez que haya terminado. Muchos paquetes que son parte de Plone y algunos complementos usan un espacio de nombres anidado como :py:mod:`plone.app.contenttypes`.

source: Open https://github.com/plone/bobtemplates.plone and read about the templates and subtemplates it provides.
es: Abra https://github.com/plone/bobtemplates.plone y lea acerca de las plantillas y sub-plantillas proveídas por ese paquete.

source: You created the package * :py:mod:`ploneconf.site` to hold your code.
es: Usted creo el paquete * :py:mod:`ploneconf.site` para contener su código.

source: You added the new package to buildout so that Plone can use it.
es: Usted agrego el nuevo paquete a buildout eso hace a Plone poder usarlo.

source: Creating Reusable Packages
es: Creando paquetes reusables

source: We already created the package :py:mod:`ploneconf.site` much earlier.
es: Nosotros ya hemos creado un paquete :py:mod:`ploneconf.site` anteriormente.

source: Build your own standalone egg.
es: Construir su propio paquete egg standalone.

source: Now you are going to create a feature that is independent of the ploneconf site and can be reused in other packages.
es: Ahora vamos a crear una característica que es totalmente independiente de nuestro sitio ploneconf y puede ser reutilizado en otros paquetes.

source: To make the distinction clear, this is not a package from the namespace :samp:`ploneconf` but from :samp:`starzel`.
es: Para hacer la distinción clara, esto no es un paquete de los nombres :samp:`ploneconf` pero desde :samp:`starzel`.

source: We are going to add a voting behavior.
es: Vamos a añadir el comportamiento voting.

source: For this we need:
es: Para esto nosotros necesitamos:

source: A behavior that stores its data in annotations
es: Un comportamiento que almacene esa data en anotaciones

source: A viewlet to present the votes
es: Un viewlet para presentar los votos

source: A bit of JavaScript
es: Un poco de JavaScript

source: A bit of CSS
es: Un poco de CSS

source: Some helper views so that the JavaScript code can communicate with Plone
es: Algunos helper views para que el código Javascript puede comunicarse con Plone

source: We move to the :file:`src` directory and again use a script called :file:`mrbob` from our project's :file:`bin` directory and the template from ``bobtemplates.plone`` to create the package.
es: Nos ubicamos dentro del directorio :file:`src` y ejecutamos el script llamado :file:`mrbob` desde nuestro directorio de proyecto :file:`bin` y la plantilla de ``bobtemplates.plone`` creará el paquete.

source: We press :kbd:`Enter` to all questions *except* our personal data and the Plone version. Here we enter :kbd:`5.0a3`.
es: Presionamos :kbd:`Enter` para todas las preguntas *excepto* nuestros datos personales y la versión de Plone. Aquí ingresamos :kbd:`5.0a3`.

source: Using starzel.votable_behavior in ploneconf.site
es: Usando starzel.votable_behavior en ploneconf.site

source: Integrate your own third party package into your site.
es: Integrar su propio paquete de terceros en su sitio.

source: Permissions
es: Permisos

source: Workflows
es: Flujos de trabajos

source: Get the code for this chapter (:doc:`More info <code>`) using this command in the buildout directory:
es: Obtén el código para este capítulo (:doc:`Más información <code>`) usando este comando en el directorio buildout:

source: We want to use the votable behavior, so that our reviewers can vote.
es: Queremos usar el comportamiento de votación, para que nuestros usuarios revisores puedan votar.

source: To show how to use events, we are going to auto-publish talks that have reached a certain rating.
es: Para mostrar cómo usar los eventos, vamos a publicar automáticamente los tipos de contenidos talks que han alcanzado una cierta puntuación.

source: We are not going to let everybody vote everything.
es: No vamos a dejar que todos voten todo.

source: First, we must add our package as a dependency to ploneconf.site.
es: Primero, debemos añadir nuestro paquete como una dependencia al paquete ploneconf.site.

source: We do this in two locations. The egg description :file:`setup.py` needs :samp:`starzel.votable_behavior` as a dependency. Else no source code will be available.
es: Hacemos esto en dos lugares. La descripción del paquete egg en el archivo :file:`setup.py` necesita :samp:`starzel.votable_behavior` como una dependencia. De lo contrario ningún código fuente estará disponible.

source: The persistent configuration needs to be installed when we install our site. This is configured in GenericSetup.
es: La configuración persistente necesita ser instalada cuando instalamos nuestro sitio. Esto se configura en GenericSetup.

source: We start by editing :file:`setup.py`
es: Comenzamos con la edición del archivo :file:`setup.py`

source: Next up we modify :file:`profiles/default/metadata.xml`
es: A continuación modificamos el archivo :file:`profiles/default/metadata.xml`

source: What a weird name. profile- is a prefix you will always need nowadays. Then comes the egg name, and the part after the colon is the name of the profile. The name of the profile is defined in zcml. So far I've stumbled over only one package where the profile directory name was different than the GenericSetup Profile name.
es: Qué nombre tan raro. profile- es un prefijo que siempre necesitarás hoy en día. Luego viene el nombre del paquete egg, y la parte después de los dos puntos es el nombre del perfil. El nombre del perfil se define en configuraciones zcml. Hasta ahora he tropezado sólo sobre un paquete donde el nombre del directorio de perfil era diferente al nombre GenericSetup Profile.

source: Now the package is there, but nothing is votable. That is because no content type declares to use this behavior. We can add this behavior via the control panel, export the settings and store it in our egg. Let's just add it by hand now.
es: Ahora el paquete está allí, pero nada es votable. Esto se debe a que ningún tipo de contenido declara utilizar este comportamiento. Podemos añadir este comportamiento a través del panel de control, exportar la configuración y almacenarla en nuestro paquete egg. Vamos a añadirlo a mano ahora.

source: To add the behavior to talks, we do this in :file:`profiles/default/types/talk.xml`
es: Añadir comportamiento al tipo de contenidos talks, haremos esto en el archivo :file:`profiles/default/types/talk.xml`

source: After changing the :file:`metadata.xml` you have to restart your site since unlike other GenericSetup XML files that file is cached.
es: Después de cambiar el :file:`metadata.xml`, debe reiniciar su sitio, ya que a diferencia de otros archivos XML de GenericSetup, ese archivo se almacena en caché.

source: Managing dependencies in :file:`metadata.xml` is good practice. We can't rely on remembering what we'd have to do by hand. In Plone 4 we should also have added :samp:`<dependency>profile-plone.app.contenttypes:plone-content</dependency>` like the `documentation for plone.app.contenttypes <https://docs.plone.org/external/plone.app.contenttypes/docs/README.html#installation-as-a-dependency-from-another-product>`_ recommends.
es: Administrar dependencias en el archivo :file:`metadata.xml` es una buena práctica. No podemos confiar en recordar lo que tendríamos que hacer a mano. En Plone 4 también deberíamos haber añadido :samp:`<dependency>profile-plone.app.contenttypes:plone-content</dependency>` como la `documentación para plone.app.contenttypes <https://docs.plone.org/external/plone.app.contenttypes/docs/README.html#installation-as-a-dependency-from-another-product>`_ recomienda.

source: Read more: https://docs.plone.org/develop/addons/components/genericsetup.html#dependencies
es: Leer más: https://docs.plone.org/develop/addons/components/genericsetup.html#dependencies

source: Now you can reinstall your Plone site.
es: Ahora puede volver a instalar su sitio Plone.

source: Everybody can now vote on talks. That's not what we wanted. We only want reviewers to vote on *pending* Talks. This means the permission has to change depending on the workflow state. Luckily, workflows can be configured to do just that. Since Talks already have their own workflow we also won't interfere with other content.
es: Todos ahora pueden votar sobre las talks. Eso no es lo que queríamos. Solo queremos que los revisores voten en las Talks *pendientes*. Esto significa que el permiso tiene que cambiar según el estado del flujo de trabajo. Afortunadamente, los flujos de trabajo se pueden configurar para hacer justamente eso. Como las Talks ya tienen su propio flujo de trabajo, no interferiremos con otros contenidos.

source: First, we have to tell the workflow that it will be managing more permissions. Next, for each state we have to configure which role has the two new permissions.
es: En primer lugar, tenemos que decirle que ese flujo de trabajo gestionará más permisos. A continuación, para cada estado tenemos que configurar, que el rol de usuario tiene los dos nuevos permisos.
