Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Basically this is Zope.
es: Básicamente esto es Zope.

source: `CMF (Content Management Framework) <http://old.zope.org/Products/CMF/index.html/>`_ is add-on for Zope to build Content Management Systems (like Plone).
es: `CMF (Content Management Framework) <http://old.zope.org/Products/CMF/index.html/>`_ es un complemento para Zope para construir sistemas de gestión de contenido (como Plone).

source: After many websites were successfully created using Zope, a number of recurring requirements emerged, and some Zope developers started to write CMF, the Content Management Framework.
es: Después de muchos sitios web creados con éxito basado en Zope, una serie de requisitos que se repiten surgieron, y algunos desarrolladores Zope comenzaron a escribir el CMF, el Content Management Framework.

source: The CMF offers many services that help you to write a CMS based on Zope. Most objects you see in the ZMI are part of the CMF somehow.
es: La CMF ofrece muchos servicios que le ayudan a escribir un CMS basado en Zope. La mayoría de los objetos que ve en la ZMI son parte de la CMF de alguna manera.

source: The developers behind CMF do not see CMF as a ready to use CMS. They created a CMS Site which was usable out of the box, but made it deliberately ugly, because you have to customize it anyway.
es: Los desarrolladores detrás CMF no ven CMF como un producto listo para usar CMS. Ellos crearon un sitio CMS que era utilizable fuera de la caja, pero dejó deliberadamente feo, porque usted tiene que personalizar todas formas.

source: We are still in prehistoric times here. There were no eggs (Python packages), Zope did not consist of 100 independent software components but was one big file set.
es: Todavía estamos en los tiempo de la prehistoria aquí. En ese entonces no existían los paquetes eggs (paquetes Python), Zope no consistía en más de 100 componentes de software independientes, pero era una gran conjunto.

source: Many parts of Plone are derived from the CMF, but it's a mixed heritage. The CMF is an independent software project, and has often moved more slowly than Plone.
es: Muchas partes de Plone se derivan de la CMF, pero es una herencia mixta. El CMF es un proyecto independiente de software, y se ha movido a menudo más lentamente que Plone.

source: Plone is gradually eliminating dependence on most parts of the CMF.
es: Plone está eliminando gradualmente la dependencia de la mayoría de las partes de la CMF.

source: Zope 3 was originally intended as a rewrite of Zope from the ground up.
es: Zope 3 fue originalmente pensado como una re-escritura de Zope desde el principio.

source: Plone uses parts of it provided by the `Zope Toolkit (ZTK) <https://zopetoolkit.readthedocs.io/en/latest/>`_.
es: Plone usa partes provistas por el `Zope Toolkit (ZTK) <https://zopetoolkit.readthedocs.io/en/latest/>`_.

source: Unfortunately, only few people started to use Zope 3, nobody migrated to Zope 3 because nobody knew how.
es: Por desgracia, nadie empezó a usar Zope 3, nadie migró a Zope 3, porque nadie sabía cómo hacerlo.

source: But there were many useful things in Zope 3 that people wanted to use in Zope 2, thus the Zope community adapted some parts so that they could use them in Zope 2.
es: Pero había muchas cosas útiles en Zope 3 que las personas querían usar en Zope 2, por lo que la comunidad Zope adaptado algunas partes para que pudieran utilizarlos en Zope 2.

source: Sometimes, a wrapper of some sort was necessary, these usually are being provided by packages from the :py:mod:`five` namespace. (Zope 2 + Zope 3 = "five")
es: A veces, una clase wrapper de algún tipo era necesario, estas por lo general son ofrecidas por los paquetes que tienen el espacios de nombres :py:mod:`five`. (Zope 2 + Zope 3 = "five")

source: To make the history complete, since people stayed on Zope 2, the Zope community renamed Zope 3 to Bluebream, so that people would not think that Zope 3 was the future.
es: Para hacer la historia completa, ya que la gente se quedó en Zope 2, la comunidad Zope renombrado Zope 3 a Bluebream, por lo que esa gente no piensa que Zope 3 era el futuro.

source: It wasn't anymore.
es: No era nada más.

source: The `Zope Component Architecture <https://zopecomponent.readthedocs.io/en/latest/>`_, which was developed as part of Zope 3, is a system which allows for component pluggability and complex dispatching based on objects which implement an interface (a description of a functionality).
es: La `Zope Component Architecture <https://zopecomponent.readthedocs.io/en/latest/>`_, que fue desarrollado como parte de Zope 3, es un sistema el cual permite componente conectable y de despacho complejo basado en objetos el cual implementan una interfaz (una descripción de una funcionalidad).

source: It is a subset of the ZTK but can be used standalone. Plone makes extensive use of the ZCA in its codebase.
es: Es un subconjunto de la ZTK pero se puede usar independiente. Plone hace uso extensivo de la ZCA en su código base.

source: `Pyramid <https://trypyramid.com>`_ is a Python web application development framework that is often seen as the successor to Zope.
es: `Pyramid <https://trypyramid.com>`_ es un framework para el desarrollo de aplicaciones Web en Python que es a veces visto como el sucesor natural de Zope.

source: It does less than Zope, is very pluggable and `uses the Zope Component Architecture <https://docs.pylonsproject.org/projects/pyramid/en/latest/narr/zca.html>`_ "under the hood" to perform view dispatching and other application configuration tasks.
es: Ese framework hace menos que Zope, es muy conectable y `usa la Zope Component Architecture <https://docs.pylonsproject.org/projects/pyramid/en/latest/narr/zca.html>`_ "bajo el capó" para realizar el envío de vistas y otras tareas de configuración de aplicaciones.

source: You can use it with a relational Database instead of ZODB if you want, or you can use both databases or none of them.
es: Se puede utilizar con una base de datos relacional en lugar de la ZODB si quieres, o usar las dos bases de datos o ninguno de ellos.

source: Apart from the fact that Pyramid was not forced to support all legacy functionality, which can make things more complicated, the original developer had a very different stance on how software must be developed. While both Zope and Pyramid have good test coverage, Pyramid has good documentation; something that was very neglected in Zope, and at times in Plone too.
es: Aparte del hecho de que Pyramid no se vio obligado a soportar todas las funcionalidades legado, que pueden hacer las cosas más complicadas, el desarrollador original tenía una postura muy diferente sobre cómo el software debe ser desarrollado. Mientras tanto Zope y Pyramid tienen una buena covertura de pruebas de software, Pyramid tiene una buena documentación; algo que estaba muy descuidado en Zope, y en ocasiones en Plone también.

source: Whether the component architecture is better in Pyramid or not we don't dare say, but we like it more. But maybe it's just because it was documented.
es: Ya sea que si ¿la arquitectura de componentes es mejor en Pyramid o no?, no nos atrevemos a decir, pero nos gusta más. Pero tal vez es sólo porque fue documentada.

source: Exercise
es: Ejercicio

source: Definition of the PYTHON_PATH makes up most of the `bin/instance` script's code. Look at the package list (and maybe also the links provided in the respective sections of this chapter). Try to identify 3 packages that belong to the original Zope2, 3 packages from CMF, 3 Zope Toolkit packages and 3 packages from the ZCA.
es: La definición de PYTHON_PATH constituye la mayor parte del código del script `bin/instance`. Mire la lista de paquetes (y tal vez también los enlaces provistos en las secciones respectivas de este capítulo). Intente identificar 3 paquetes que pertenecen al Zope2 original, 3 paquetes de CMF, 3 paquetes de Zope Toolkit y 3 paquetes del ZCA.

source: CMF: Products.CMFCore, Products.CMFUid, Products.CMFEditions, ... Products.DCWorkflow doesn't fit the pattern but is a very important part of the CMF
es: CMF: Products.CMFCore, Products.CMFUid, Products.CMFEditions, ... Products.DCWorkflow no encaja en el patrón, pero es una parte muy importante del CMF

source: ZTK: zope.browser, zope.container, zope.pagetemplate, ... You can find a complete list `here <https://dist.plone.org/versions/zopetoolkit-1-0-8-zopeapp-versions.cfg>`_
es: ZTK: zope.browser, zope.container, zope.pagetemplate, ... Puede encontrar una lista completa `aquí <https://dist.plone.org/versions/zopetoolkit-1-0-8-zopeapp-versions.cfg>`_

source: Programming Plone
es: Programando en Plone

source: Learn about the right ways to do something in code in Plone.
es: Aprende sobre las formas correctas de hacer algo en código en Plone.

source: Learn to debug
es: Aprende a depurar

source: Debugging
es: Depurando

source: Portal tools
es: Herramientas del portal

source: The most important tool nowadays for plone developers is the add-on `plone.api <https://docs.plone.org/develop/plone.api/docs/index.html>`_ that covers 20% of the tasks any Plone developer does 80% of the time. If you are not sure how to handle a certain task be sure to first check if plone.api has a solution for you.
es: La herramienta más importante actualmente para los desarrolladores Plone es el complemento `plone.api <https://docs.plone.org/develop/plone.api/docs/index.html>`_ el cual cubre el 20% de las tareas que cualquier desarrollador Plone normalmente hace en 80% de su tiempo. Si no está seguro de cómo manejar una determinada tarea, asegúrese primero de comprobar si plone.api tiene una solución para usted.

source: The API is divided in five sections. Here is one example from each:
es: El API esta divido en 5 secciones. Este es un ejemplo de cada uno:

source: `Content:` `Create content <https://docs.plone.org/develop/plone.api/docs/content.html#create-content>`_
es: `Contenido:` `Crear contenido <https://docs.plone.org/develop/plone.api/docs/content.html#create-content>`_

source: `Portal:` `Send E-Mail <https://docs.plone.org/develop/plone.api/docs/portal.html#send-e-mail>`_
es: `Portal:` `Enviar correo electrónico <https://docs.plone.org/develop/plone.api/docs/portal.html#send-e-mail>`_

source: `Groups:` `Grant roles to group <https://docs.plone.org/develop/plone.api/docs/group.html#grant-roles-to-group>`_
es: `Grupos:` `Asignar roles al grupo <https://docs.plone.org/develop/plone.api/docs/group.html#grant-roles-to-group>`_

source: `Users:` `Get user roles <https://docs.plone.org/develop/plone.api/docs/user.html#get-user-roles>`_
es: `Usuarios:` `Obtener roles de usuario <https://docs.plone.org/develop/plone.api/docs/user.html#get-user-roles>`_

source: `Environment:` `Switch roles inside a block <https://docs.plone.org/develop/plone.api/docs/env.html#switch-roles-inside-a-block>`_
es: `Entorno:` `Cambiar roles dentro de un bloque <https://docs.plone.org/develop/plone.api/docs/env.html#switch-roles-inside-a-block>`_

source: :py:mod:`plone.api` is a great tool for integrators and developers that is included when you install Plone, though for technical reasons it is not used by the code of Plone itself.
es: :py:mod:`plone.api` es una grandiosa herramienta para integradores y desarrolladores que esta incluida cuando usted instala Plone, por razones técnicas ese no lo veras usado por el código dentro de Plone.

source: In existing code you'll often encounter methods that don't mean anything to you. You'll have to use the source to find out what they do.
es: En el código existente a veces encontraras métodos que para usted no significan nada. Usted tiene que usar el código fuente para averiguar que hacen.

source: Some of these methods will be replaced by :py:mod:`plone.api` in the future:
es: Algunos de estos métodos serán reemplazados por ``plone.api`` en el futuro:

source: portal-tools
es: herramientas del portal

source: Some parts of Plone are very complex modules in themselves (e.g. the versioning machinery of :py:mod:`Products.CMFEditions`). Most of them have an API of themselves that you will have to look up at when you need to implement a feature that is not covered by plone.api.
es: Algunas partes de Plone son módulos muy complejos en si mismo (ej. el mecanismo de versionado de :py:mod:`Products.CMFEditions`). Algunos de ellos tienen una API que usted aprenderá a usar tarde o temprano.

source: Here are a few examples:
es: Aquí tienes unos ejemplos:

source: :py:meth:`unrestrictedSearchResults()` returns search results without checking if the current user has the permission to access the objects.
es: :py:meth:`unrestrictedSearchResults()` regresa los resultados de búsqueda sin verificar si el usuario actual tiene permiso de acceso a los objetos.

source: :py:meth:`uniqueValuesFor()` returns all entries in an index
es: :py:meth:`uniqueValuesFor()` regresa todas las entradas en un indice

source: :py:meth:`runAllExportSteps()` generates a tarball containing artifacts from all export steps.
es: :py:meth:`runAllExportSteps()` genera un archivo comprimido en formato Tar conteniendo los artefactos de todos los pasos de exportación.

source: :py:meth:`isProductInstalled()` checks if a product is installed.
es: :py:meth:`isProductInstalled()` verifica si un producto (complemento) esta instalado.

source: Usually the best way to learn about the API of a tool is to look in the :file:`interfaces.py` in the respective package and read the docstrings. But sometimes the only way to figure out which features a tool offers is to read its code.
es: Usualmente la mejor forma para aprender acerca de la herramienta de un API es mirando en el archivo :file:`interfaces.py` en el respectivo paquete y leer la documentación incluida en ``docstrings``. Pero a veces la única forma de descubrir qué características ofrece una herramienta es leer su código.

source: To use a tool you usually first get the tool with :py:mod:`plone.api` and then invoke the method.
es: Para usar una herramienta, usualmente primero obtienes la herramienta con :py:mod:`plone.api` y luego invocas el método.

source: Here is an example where we get the tool `portal_membership` and use one of its methods to logout a user:
es: Aquí hay un ejemplo donde obtenemos la herramienta `portal_membership` y usamos uno de sus métodos para cerrar la sesión de un usuario:

source: The code for :py:meth:`logoutUser()` is in :py:meth:`Products.PlonePAS.tools.membership.MembershipTool.logoutUser`. Many tools that are used in Plone are actually subclasses of tools from the package :py:mod:`Products.CMFCore`. For example `portal_membership` is subclassing and extending the same tool from :py:class:`Products.CMFCore.MembershipTool.MembershipTool`. That can make it hard to know which options a tool has. There is a ongoing effort by the Plone Community to consolidate tools to make it easier to work with them as a developer.
es: El código para :py:meth:`logoutUser()` está en :py:meth:`Products.PlonePAS.tools.membership.MembershipTool.logoutUser`. Muchas herramientas que se usan en Plone son en realidad subclases de herramientas del paquete :py:mod:`Products.CMFCore`. Por ejemplo `portal_membership` está haciendo subclases y extendiendo la misma herramienta desde :py:class:`Products.CMFCore.MembershipTool.MembershipTool`. Eso puede dificultar saber qué opciones tiene una herramienta. Hay un esfuerzo continuo por parte de la Comunidad Plone para consolidar las herramientas para facilitar el trabajo con ellas como desarrollador.

source: Here are some tools and techniques we often use when developing and debugging. We use some of them in various situations during the training.
es: Aquí hay algunas herramientas y técnicas que usamos frecuentemente cuando desarrollamos y depuramos. Usamos algunas de ellas en varias situaciones durante el entrenamiento.

source: tracebacks and the log
es: rastreos y el registro

source: The log (and the console when running in foreground) collects all log messages Plone prints. When an exception occurs Plone throws a traceback. Most of the time the traceback is everything you need to find out what is going wrong. Also adding your own information to the log is very simple.
es: El registro (y la consola cuando ejecutamos en modo foreground) recolecta todos los mensajes de registro que Plone imprime. Cuando ocurre una excepción Plone lanza un rastreo detallado. La mayoría del tiempo el rastreo es todo lo que necesitas para averiguar que esta sucediendo. También añadiendo tu propia información al registro es muy simple.

source: The python debugger pdb is the single most important tool for us when programming. Just add ``import pdb; pdb.set_trace()`` in your code and debug away!
es: El depurador de Python pdb, es la herramienta simple más importante para nosotros cuando programemos. ¡Solo añada ``import pdb; pdb.set_trace()`` en tu código y empieza a depurar!

source: Since Plone 5 you can even add it to templates: add ``<?python import pdb; pdb.set_trace() ?>`` to a template and you end up in a pdb shell on calling the template. Look at the variable :py:obj:`econtext` to see what might have gone wrong.
es: Desde Plone 5, incluso puedes añadirlo a las plantillas: añada ``<?python import pdb; pdb.set_trace() ?>`` a una plantilla y termina en un shell pdb al llamar a la plantilla. Mire la variable :py:obj:`econtext` para ver qué pudo haber salido mal.

source: A great drop-in replacement for pdb with tab completion, syntax highlighting, better tracebacks, introspection and more. And the best feature ever: The command :command:`ll` prints the whole current method.
es: Un gran reemplazo directo para pdb con el implementación del tabulador, resaltado de sintaxis, mejores trazas, introspección y más. Y la mejor característica de todos: el comando :command:`ll` imprime todo el método actual.

source: Another enhanced pdb with the power of IPython, e.g. tab completion, syntax highlighting, better tracebacks and introspection. It also works nicely with :py:mod:`Products.PDBDebugMode`. Needs to be invoked with ``import ipdb; ipdb.set_trace()``.
es: Mejorar pdb con el poder de IPython, por ejemplo, la implementación del tabulador, resaltado de sintaxis, mejores rastreos y la introspección. También funciona muy bien con el complemento :py:mod:`Products.PDBDebugMode`. Es necesario ser invocado con ``import ipdb; ipdb.set_trace()``.

source: An add-on that has two killer features.
es: Un complemento que tiene dos características esenciales para su uso.

source: **Post-mortem debugging**: throws you in a pdb whenever an exception occurs. This way you can find out what is going wrong.
es: **Post-mortem debugging**: le lanza en un pdb cuando ocurra una excepción. De esta forma puedes averiguar que es lo que esta mal.

source: **pdb view**: simply adding ``/pdb`` to a url drops you in a pdb session with the current context as :py:obj:`self.context`. From there you can do just about anything.
es: **pdb view**: simplemente añadiendo ``/pdb`` a una dirección URL, le lanza a una sesión pdb con el contexto actual como :py:obj:`self.context`. De allí puedes hacer casi todo.

source: Debug mode
es: Modo depuración

source: When starting Plone using :command:`./bin/instance debug` you'll end up in an interactive debugger.
es: Cuando se inicia Plone usando el comando :command:`./bin/instance debug` usted terminará en una depurador Interactivo.

source: An add-on that allows you to inspect nearly everything. It even has an interactive console, a tester for TALES-expressions and includs a reload-feature like :py:mod:`plone.reload`.
es: Un complemento que permite inspeccionar todo muy cercanamente. Incluso tiene una consola interactiva y un probador para expresiones TALES y incluyen una función de recarga como :py:mod:`plone.reload`.

source: An add-on that allows to reload code that you changed without restarting the site. It is also used by :py:mod:`plone.app.debugtoolbar`.
es: Un complemento que permite recargar el código que has cambiado sin reiniciar el sitio. Esto es también usado por el paquete :py:mod:`plone.app.debugtoolbar`.

source: An add-on that prevents Plone from sending mails. Instead, they are logged.
es: Un complemento que previene a Plone de enviar mensajes. Ellos son registrados como eventos en el registro o log del servicio.

source: Products.enablesettrace or Products.Ienablesettrace
es: Products.enablesettrace o Products.Ienablesettrace

source: Add-on that allows to use pdb and ipdb in Python skin scripts. Very useful when debugging terrible legacy code.
es: Complemento que permite usar pdb y ipdb en scripts Python skin. Muy útil al depurar código legado.

source: An option for the recipe :py:mod:`plone.recipe.zope2instance` that logs the detailed reasons why a user might not be authorized to see something.
es: Una opción para la receta :py:mod:`plone.recipe.zope2instance` que registra las razones detalladas sobre por que un usuario no puede ser autorizado a ver algo.

source: An option when running buildout that logs all the pulled packages and versions.
es: Una opción que cuando se ejecute buildout realiza registros de los paquetes traídos y sus versiones.

source: `Sentry <https://github.com/getsentry/sentry>`_ is an error logging application you can host yourself. It aggregates tracebacks from many sources and (here comes the killer feature) even the values of variables in the traceback. We use it in all our production sites.
es: `Sentry <https://github.com/getsentry/sentry>`_ es una aplicación de log de errores que puede usar usted mismo. Ese añada rastreos de muchas fuentes y (aquí viene la característica esencial para su uso) incluso los valores de las variables en el rastreo. Lo usamos en todos nuestros sitios de producción.

source: Buildout can create a python shell for you that has all the packages from your Plone site in its python path. Add the part like this::
es: Buildout puede crear un script de shell de Python para usted que tiene los paquetes de su sitio Plone en su ruta de acceso de python ``PYTHONPATH``. Añada la sección en la declarativa ``parts`` y la finalizar del archivo la configuración como esta::

source: A video of the talk `Debug like a pro. How to become a better programmer through pdb-driven development <http://pyvideo.org/pycon-de-2016/debug-like-a-pro-how-to-become-a-better-programmer-through-pdb-driven-development.html>`_
es: Un video de la charla `Depurar como un profesional. Cómo convertirse en un mejor programador a través del desarrollo impulsado por pdb <http://pyvideo.org/pycon-de-2016/debug-like-a-pro-how-to-become-a-better-programmer-through-pdb-driven-development.html>`_

source: Behaviors
es: Comportamientos

source: Get the code for this chapter (:doc:`More info <code>`):
es: Obtén el código para este capítulo (:doc:`Más información <code>`):

source: Add another field to talks by using a behavior
es: Añada otro campo a las charlas mediante el uso de un comportamiento

source: You can extend the functionality of your dexterity object by writing an adapter that adapts your dexterity object to add another feature or aspect.
es: Usted puede extender la funcionalidad de su objeto dexterity solo creando un adaptador que se adapte a su objeto dexterity para añadir otra característica o aspecto.

source: But if you want to use this adapter, you must somehow know that an object implements that. Also, adding more fields to an object would not be easy with such an approach.
es: Pero si desea utilizar este adaptador, debe saber de alguna manera que un objeto implementa eso. Además, añadir más campos a un objeto no sería fácil con este enfoque.

source: Dexterity Approach
es: Enfoque Dexterity
