Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Plone and its objects are stored in an object database, the ZODB. You can use `bin/instance debug` as a database client (in the same way e.g. `psql` is a client for PostgreSQL). Instead of a special query language (like SQL) you simply use Python to access and manipulate ZODB objects. Don't worry if you accidentally change objects in `bin/instance debug` - you would have to commit your changes explicitly to make them permanent. The Python code to do so is:
es: Plone y sus objetos se almacenan en una base de datos de objetos, ZODB. Puede usar `bin/instance debug` como un cliente de base de datos (de la misma manera, por ejemplo `psql` es un cliente para PostgreSQL). En lugar de un lenguaje de consulta especial (como SQL) simplemente usa Python para acceder y manipular objetos ZODB. No se preocupe si accidentalmente cambia objetos en la sesión iniciada con el comando `bin/instance debug` - tendría que confirmar los cambios de forma explícita para que sean permanentes. El código de Python para hacerlo es:

source: You have been warned.
es: Usted ha sido advertido.

source: Walkthrough of the UI
es: Tutorial de la interfaz de usuario - UI

source: Let's see what is there...
es: Vamos a ver lo que está ahí...

source: :guilabel:`logo`: with a link to the front page
es: :guilabel:`logo`: con un enlace a la página principal

source: :guilabel:`searchbox`: search (with live-search)
es: :guilabel:`searchbox`: búsqueda (con búsqueda en vivo)

source: :guilabel:`navigation`: The global navigation
es: :guilabel:`navigation`: La navegación global

source: :guilabel:`banner`: A banner. Only visible on the front page.
es: :guilabel:`banner`: Una pancarta. Solo visible en la página principal.

source: :guilabel:`portal-columns`: a container holding:
es: :guilabel:`portal-columns`: un contenedor que contienen:

source: :guilabel:`portal-column-one`: portlets (configurable boxes with tools like navigation, news etc.)
es: :guilabel:`portal-column-one`: los portlets (cajas configurables con herramientas como navegación, noticias, etc.)

source: :guilabel:`portal-column-content`: the content and the editor
es: :guilabel:`portal-column-content`: el contenido y el editor

source: :guilabel:`portal-column-two`: portlets
es: :guilabel:`portal-column-two`: Los portlets

source: :guilabel:`portal-footer`: portlets for the footer, site actions, and colophon
es: :guilabel:`portal-footer`: los portlets para el pie de página, acciones del sitio y colofón

source: :guilabel:`edit-zone`: a vertical bar on the left side of the browser window with editing options for the content
es: :guilabel:`edit-zone`: una barra vertical en el lado izquierdo de la ventana del navegador con opciones de edición para el contenido

source: These are also the CSS classes of the respective divs. If you want to do theming, you'll need them.
es: Estas son también las clases de CSS de los elementos div html respectivos. Si quieres hacer temas en Plone, lo necesitarás.

source: On the edit bar, we find options affecting the current context...
es: En la barra de edición, encontramos opciones que afectan el contexto actual...

source: :guilabel:`folder contents`
es: :guilabel:`Carpeta de contenidos`

source: :guilabel:`edit`
es: :guilabel:`Editar`

source: :guilabel:`view`
es: :guilabel:`Visualizar`

source: :guilabel:`add`
es: :guilabel:`Añadir nuevo...`

source: :guilabel:`state`
es: :guilabel:`Estado`

source: :guilabel:`actions`
es: :guilabel:`Acciones`

source: :guilabel:`display`
es: :guilabel:`Mostrar`

source: :guilabel:`manage portlets`
es: :guilabel:`Administrar portlets`

source: :guilabel:`history`
es: :guilabel:`Histórico`

source: :guilabel:`sharing`
es: :guilabel:`Compartir`

source: :guilabel:`rules`
es: :guilabel:`Reglas`

source: :guilabel:`user actions`
es: :guilabel:`Acciones de usuario`

source: Some edit bar options only show when appropriate; for example, :guilabel:`folder contents` and :guilabel:`add` are only shown for Folders. :guilabel:`rules` is currently invisible because we have no content rules available.
es: Algunas opciones de barra de edición solo se muestran cuando es apropiado; por ejemplo, :guilabel:`Contenido de carpeta` y :guilabel:`Añadir nuevo...` solo se muestran para Carpetas. :guilabel:`Reglas` es actualmente invisible porque no tenemos reglas de contenido disponibles.

source: Let's create our first users within Plone. So far we used the admin user (admin:admin) configured in the buildout. This user is often called "Zope root" and is not managed in Plone but only by Zope. Therefore the user is missing some features like email and full name and won't be able to use some of Plone's features. But the user has all possible permissions. As with the root user of a server, it's bad practice to make unnecessary use of Zope root. Use it to create Plone sites and their initial users, but not much else.
es: Creemos nuestros primeros usuarios dentro de Plone. Hasta ahora usamos el usuario administrador (usuario: admin y contraseña: admin) configurado en el buildout. Este usuario a menudo se denomina "el root de Zope" y no se gestiona en Plone, sino solo por Zope. Por lo tanto, al usuario le faltan algunas características, como el correo electrónico y el nombre completo, y no podrá usar algunas de las funciones de Plone. Pero el usuario tiene todos los permisos posibles. Al igual que con el usuario raíz de un servidor, es una mala práctica hacer un uso innecesario de la raíz de Zope. Úselo para crear sitios Plone y sus usuarios iniciales, pero no mucho más.

source: You can also add Zope users via the terminal by entering::
es: También puede añadir usuarios Zope a través de la terminal ingresando::

source: That way you can access databases you get from customers where you have no Plone user.
es: De esta forma, puede acceder a las bases de datos que obtiene de los clientes donde no tiene un usuario de Plone.

source: To add a new user in Plone, click on the user icon at the bottom of the left vertical bar and then on :guilabel:`Site setup`. This is Plone's control panel. You can also access it by browsing to http://localhost:8080/Plone/@@overview-controlpanel
es: Para añadir un nuevo usuario en Plone, haga clic en el icono del usuario en la parte inferior de la barra vertical izquierda y luego en :guilabel:`Configuración del sitio`. Este es el panel de control de Plone. También puede acceder a él navegando por la dirección URL http://localhost:8080/Plone/@@overview-controlpanel

source: Click on :guilabel:`Users and Groups` and add a user. If we had configured a mail server, Plone could send you a mail with a link to a form where you can choose a password. (Or, if you have Products.PrintingMailHost in your buildout, you can see the email scrolling by in the console, just the way it would be sent out.) We set a password here because we haven't yet configured a mail server.
es: Haga clic en :guilabel:`Usuarios y Grupos` y añada un usuario. Si hubiéramos configurado un servidor de correo, Plone podría enviarle un correo electrónico con un enlace a un formulario donde puede elegir una contraseña. (O bien, si tiene el complemento Products.PrintingMailHost en su buildout, puede ver el correo electrónico desplazándose en la consola, tal como se enviaría). Configuramos una contraseña aquí porque aún no hemos configurado un servidor de correo.

source: Make this user with your name an administrator.
es: Establezca a este usuario con su nombre un administrador del sitio.

source: Then create another user called ``testuser``. Make this one a normal user. You can use this user to see how Plone looks and behaves to users that have no admin permissions.
es: Luego crea otro usuario llamado ``testuser``. Haz que este sea un usuario normal. Puede usar este usuario para ver cómo Plone se ve y se comporta para los usuarios que no tienen permisos de administrador.

source: Now let's see the site in 3 different browsers with three different roles:
es: Ahora vamos a ver el sitio en 3 navegadores diferentes, con tres roles diferentes:

source: as anonymous
es: como anónimo

source: as editor
es: como editor

source: as admin
es: como administrador

source: Create some Plone users:
es: Crear algunos usuarios Plone:

source: :guilabel:`admin` > :guilabel:`Site setup` > :guilabel:`Users and Groups`
es: :guilabel:`admin` > :guilabel:`Configuración del sitio` > :guilabel:`Usuarios y Grupos`

source: Add user <yourname> (groups: Administrators)
es: Añadir rio <sunombre> (groups: Administrators)

source: Add another user "tester" (groups: None)
es: Añadir otro usuario "tester" (grupos: Ninguno)

source: Add another user "editor" (groups: None)
es: Añadir otro usuario "editor" (grupos: Ninguno)

source: Add another user "reviewer" (groups: Reviewers)
es: Añadir otro usuario "reviewer" (grupos: Reviewers)

source: Add another user "jurymember" (groups: None)
es: Añadir otro usuario "jurymember" (grupos: Ninguno)

source: Logout as admin by clicking 'Logout' and following the instructions.
es: Cierre sesión como administrador haciendo clic en 'Cerrar sesión' y siguiendo las instrucciones.

source: Login to the site with your user now.
es: Iniciar sesión de usuario del sitiio con su usuario ahora.

source: Configure a Mailserver
es: Configurar un servidor de correo

source: We have to configure a mailserver since later we will create some content rules that send emails when new content is put on our site.
es: Tenemos que configurar un servidor de correo ya que más tarde crearemos algunas reglas de contenido que enviarán correos electrónicos cuando se coloque contenido nuevo en nuestro sitio.

source: Server: :samp:`localhost`
es: Servidor: :samp:`localhost`

source: Username: leave blank
es: Nombre de usuario: dejar en blanco

source: Password: leave blank
es: Contraseña: dejar en blanco

source: Site 'From' name: Your name
es: Nombre 'Del remitente del correo' de su sitio: Su nombre

source: Site 'From' address: Your email address
es: Dirección 'Del remitente del correo' de su sitio: Su dirección de correo electrónico

source: Click on `Save and send test e-mail`. Since we have configured PrintingMailHost, you will see the mail content in the console output of your instance. Plone will not actually send the email to the receivers address.
es: Haga clic en `Guardar y enviar correo electrónico de prueba`. Como hemos configurado el complemento PrintingMailHost, verá el contenido del correo en la salida de la consola de su instancia. Plone en realidad no enviará el correo electrónico a la dirección del receptor.

source: Content-Types
es: Tipos de Contenidos

source: Edit a page:
es: Editar una página:

source: :guilabel:`Edit front-page`
es: :guilabel:`Edite el documento front-page`

source: :guilabel:`Title` :samp:`Plone Conference 2017, Barcelona`
es: :guilabel:`Título` :samp:`Plone Conference 2017, Barcelona`

source: :guilabel:`Summary` :samp:`Tutorial`
es: :guilabel:`Descrición` :samp:`Tutorial`

source: :guilabel:`Text` :samp:`...`
es: :guilabel:`Texto` :samp:`...`

source: Create a site structure:
es: Crear un estructura del sitio:

source: Add a folder "The Event" and in it add:
es: Añadir una carpeta llamada "El Evento" y que contenga:

source: Folder "Talks"
es: Carpeta "Charlas"

source: Folder "Training"
es: Carpeta "Entrenamientos"

source: Folder "Sprint"
es: Carpeta "Sprint"

source: The view of the newly created site structure.
es: La vista del estructura del sitio recientemente creado.

source: In ``/news``: Add a News Item "Conference Website online!" with some image
es: En ``/news``: Añada una noticia "Sitio web de la Conferencia en linea!" con alguna imagen

source: In ``/news``: Add a News Item "Submit your talks!"
es: En ``/news``: Añada una noticia "¡Envíe su charla!"

source: In ``/events``: Add an Event "Deadline for talk submission" Date: 2017/08/10
es: En ``/events``: Añada un Evento "Fecha tope para presentar las tasks" Fecha: 2017/08/10

source: Add a Folder "Register"
es: Añadir carpeta "Registro"

source: Delete the Folder "Users"
es: Eliminar la Carpeta "Users"

source: Add a Folder "Intranet"
es: Añadir carpeta "Intranet"

source: The view of the extended navigation bar.
es: La vista de la barra de navegación extendida.

source: The default Plone content types are:
es: Los tipos de contenidos predeterminados son:

source: Collection
es: Colección

source: Event
es: Evento

source: File
es: Archivo

source: Folder
es: Carpeta

source: Image
es: Imagen

source: Link
es: Enlace

source: News Item
es: Noticia

source: Page
es: Página

source: Please keep in mind that we use `plone.app.contenttypes <https://docs.plone.org/external/plone.app.contenttypes/docs/README.html>`_ for the training, which are the default in Plone 5. Therefore the types are based on Dexterity and slightly different from the types that you will find in a default Plone 4.3.x site.
es: Por favor, tenga en cuenta que usamos `plone.app.contenttypes <https://docs.plone.org/external/plone.app.contenttypes/docs/README.html>`_ para el entrenamiento, el cual son los predeterminados en Plone 5. Por lo tanto, los tipos de contenido se basan en Dexterity y ligeramente diferentes de los tipos de contenidos que encontrará en un sitio de Plone 4.3.x por defecto.

source: Folders
es: Carpetas

source: Go to 'the-event'
es: Valla a la carpeta 'el-evento'

source: explain the difference between title, ID, and URL
es: explicar la diferencia entre título, ID y dirección URL

source: explain /folder_contents
es: explicar /folder_contents

source: change the order of items
es: cambiar el orden de los elementos

source: explain bulk actions
es: explica las acciones por lotes

source: dropdown "display"
es: menú desplegable "Mostrar"

source: default pages
es: páginas por defecto

source: Add a page to 'the-event': "The Event" and make it the default page
es: Añadir una página a a la carpeta 'el-evento': "El Evento" y hacerla página por defecto

source: Collections
es: Colecciones

source: add a new collection: "all content that has ``pending`` as wf_state".
es: añada una nueva colección: "todo el contenido que tiene ``pending`` como estado de flujo de trabajo".

source: Add a collection through the web.
es: Añadir una colección a traves de la web.

source: explain the default collection for events at http://localhost:8080/Plone/events/aggregator/edit
es: explicar la colección por defecto de eventos en la dirección URL http://localhost:8080/Plone/events/aggregator/edit

source: explain Topics
es: explicar Tópicos

source: mention collection portlets
es: mencionar portlets de colección

source: multi-path queries
es: consultas de múltiples rutas

source: constraints, e.g. ``/Plone/folder::1``
es: restricciones, ej. ``/Plone/folder::1``

source: Create new rule "a new talk is in town"!
es: ¡Crear una nueva regla llamada "una nueva charla está presente"!

source: New content in folder "Talks" -> Send Mail to reviewers.
es: Nuevo contenido en Carpeta "Charlas" -> Enviar correo a revisores.

source: Add a rule through the web.
es: Añadir una regla a traves de la web.

source: Add an action to the rule.
es: Añadir una acción a traves de la web.

source: Add mail action.
es: Añadir una acción de correo.

source: Assign the newly created rule.
es: Asignar la regla creada reciente.

source: History
es: Histórico

source: Show and explain; mention versioning and its relation to types.
es: Mostrar y explicar; el control de versiones y su relación con los tipos.

source: Manage members and groups
es: Administrar usuarios y grupos

source: add/edit/delete Users
es: añadir/editar/eliminar Usuarios

source: groups
es: grupos

source: Add group "Editors" and add the user 'editor' to it
es: Añadir grupo "Editores" y añadir el usuario 'editor' a ese.

source: Add group: ``orga``
es: Añadir grupo: ``orga``

source: Add group: ``jury`` and add user 'jurymember' to it.
es: Añadir grupo: ``jury`` y añada usuario 'jurymember' a ese.

source: Take a look at the :guilabel:`state` drop down on the edit bar on the homepage. Now, navigate to one of the folders just added. The homepage has the status ``published`` and the new content is ``private``.
es: Eche un vistazo al menú desplegable :guilabel:`Estado` en la barra de edición en la página de inicio. Ahora, navegue a una de las carpetas que acaba de añadir. La página de inicio tiene el estado ``publicado`` y el nuevo contenido es ``privado``.

source: Let's look at the state transitions available for each type. We can make a published item private and a private item published. We can also submit an item for review.
es: Echemos un vistazo a las transiciones de estado disponibles para cada tipo. Podemos hacer un elemento publicado privado y un elemento privado se pueda publicar. También podemos enviar un elemento para su revisión.

source: Each of these states connects roles to permissions.
es: Cada uno de esos estados conecta los roles a permisos.

source: In ``published`` state, the content is available to anonymous visitors;
es: En el estado ``Publicado``, el contenido está disponible para los visitantes anónimos;

source: In ``private`` state, the content is only viewable by the author (owner) and users who have the ``can view`` role for the content.
es: En el estado ``Privado``, el contenido es sólo visible para el autor (propietario) y los usuarios que tienen el rol local ``Puede ver`` para el contenido.

source: A *workflow state* is an association between a role and one or more permissions. Moving from one state to another is a ``transition``. Transitions (like ``submit for review``) may have actions — such as the execution of a content rule or script — associated with them.
es: Un *estado de flujo de trabajo* es una asociación entre un rol y uno o más permisos. Moverse de un estado a otro es una ``transición``. Las transiciones (como ``Enviar para revisión``) pueden tener acciones, como la ejecución de una regla de contenido o script, asociadas a ellas.

source: A complete set of workflow states and transitions makes up a *workflow*. Plone allows you to select among several pre-configured workflows that are appropriate for different types of sites. Individual content types may have their own workflow. Or, and this is particularly interesting, they may have no workflow. In that case, which initially applies to file and image uploads, the content object inherits the workflow state of its container.
es: Un conjunto completo de estados de flujo de trabajo y transiciones constituye un *flujo de trabajo*. Plone le permite seleccionar entre varios flujos de trabajo preconfigurados que son apropiados para diferentes tipos de sitios. Los tipos de contenido individuales pueden tener su propio flujo de trabajo. O, y esto es particularmente interesante, es posible que no tengan flujo de trabajo. En ese caso, que inicialmente se aplica a las cargas de archivo e imagen, el objeto de contenido hereda el estado del flujo de trabajo de su contenedor.

source: An oddity in all of the standard Plone workflows: a content item may be viewable even if its container is not. Making a container private does **not** automatically make its contents private.
es: Una rareza en todos los flujos de trabajo de Plone estándar: un elemento de contenido puede ser visible incluso si su contenedor no lo es. Hacer un contenedor privado **no** automáticamente hace que sus contenidos sean privados.

source: Read more at: https://docs.plone.org/working-with-content/collaboration-and-workflow/index.html
es: Lea más en la dirección URL: https://docs.plone.org/working-with-content/collaboration-and-workflow/index.html

source: Working copy
es: Copia de trabajo

source: Published content, even in an intranet setting, can pose a special problem for editing. It may need to be reviewed before changes are made available. In fact, the original author may not even have permission to change the document without review. Or, you may need to make a partial edit. In either case, it may be undesirable for changes to be immediately visible.
es: El contenido publicado, incluso en un entorno de Intranet, puede plantear un problema especial para la edición. Puede ser necesario revisar antes de que los cambios se hacen disponible. De hecho, el autor original puede incluso podría no tener permiso para cambiar el documento sin revisión. O bien, puede que tenga que hacer una edición parcial. En cualquiera de los casos, puede ser deseable para que los cambios sean visibles inmediatamente.

source: Plone's working copy support solves this problem by adding a check-out/check-in function for content — available on the actions menu. A content item may be checked out, worked on, then checked back in. Or it may abandoned if the changes weren't acceptable. Not until check in is the new content visible.
es: El complemento *Soporte de Copia de Trabajo* resuelve este problema mediante la adición una acción para *Retirar revisión* o *Guardar nueva revisión* de cambios para el contenido - disponible en el menú de acciones. Un elemento de contenido puede *Guardar nueva revisión*, trabajado en una copia del elemento y después se *Guardar nueva revisión* de nuevo. O *Cancelar retirada de revisión* si los cambios no eran aceptables. Hasta no guardar una nueva revisión de los cambios, el contenido anterior será visible.

source: While it's shipped with Plone, working copy support is not a common need. So, if you need it, you need to activate it via the add-on packages configuration page. Unless activated, check-in/check-out options are not visible.
es: Mientras este complemento viene incorporado en Plone, el soporte de copia de trabajo no es una necesidad común. Así que, si usted lo necesita, usted necesita para activarlo a través de la página de configuración de Complementos. A menos que se active este complemento, las opciones de *Retirar revisión* / *Guardar nueva revisión* no son visibles.

source: Working Copy Support has limited support for Dexterity content types. The limitation is that there are some outstanding issues with folderish items that contain many items. See: `plone/Products.CMFPlone#665 <https://github.com/plone/Products.CMFPlone/issues/665>`_
es: El soporte de copia de trabajo tiene soporte limitado para los tipos de contenido Dexterity. La limitación es que hay algunos problemas pendientes con los elementos de la carpeta que contienen muchos elementos. Ver: `plone/Products.CMFPlone#665 <https://github.com/plone/Products.CMFPlone/issues/665>`_

source: Placeful workflows
es: Flujos de trabajo Placeful

source: You may need to have different workflows in different parts of a site. For example, we created an intranet folder. Since this is intended for use by our conference organizers — but not the public — the simple workflow we wish to use for the rest of the site will not be desirable.
es: Usted puede necesitar tener diferentes flujos de trabajo en diferentes partes de un sitio. Por ejemplo, creamos una carpeta intranet. Dado que este es para uso de nuestros organizadores de la conferencia - pero no para el público - el sencillo flujo de trabajo que deseamos utilizar para que el resto del sitio no será deseable aquí.

source: Plone's ``Workflow Policy Support`` package gives you the ability to set different workflows in different sections of a site. Typically, you use it to set a special workflow in a folder that will govern everything under that folder. Since it has effect in a "place" in a site, this mechanism is often called "Placeful Workflow".
es: El complemento ``Soporte de Políticas de Flujos de Trabajo`` te da la posibilidad de configurar diferentes flujos de trabajo en las diferentes secciones de un sitio. Normalmente, se utiliza para configurar un flujo de trabajo especial en una carpeta que regirá todo bajo esa carpeta. Ya que tiene efecto en un "lugar" en un sitio, este mecanismo es a menudo llamado "Flujo de trabajo Placeful".
