Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: The Widget retrieves the original object with the UUID.
es: El widget recupera el objeto original con el UUID.

source: Some datamanager gets another unique ID from an IntID Tool.
es: Algunos administradores de datos obtienen otro ID único de una herramienta de IntID.

source: The same datamanager creates a RelationValue from this id, and stores this relation value on the source object.
es: El mismo administrador de datos crea un RelationValue a partir de este id, y almacena este valor de relación en el objeto de origen.

source: Some Event handlers update the catalogs.
es: Algunos controladores de eventos actualizan los catálogos.

source: You could delete a Relation like this `delattr(rel.from_object, rel.from_attribute)`
es: Puede eliminar una Relación como esta `delattr(rel.from_object, rel.from_attribute)`

source: This is a terrible idea by the way, because when you define in your schema that one can store multiple RelationValues, your Relation is stored in a list on this attribute.
es: Por cierto, esta es una idea terrible, porque cuando defines en tu esquema que puedes almacenar múltiples valores de relación (RelationValues), tu relación se almacena en una lista en este atributo.

source: Relations depend on a lot of infrastructure to work. This infrastructure in turn depends a lot on event handlers being thrown properly. When this is not the case things can break. Because of this, there is a method `isBroken` which you can use to check if the target is available.
es: Las relaciones dependen de una gran cantidad de infraestructura para trabajar. Esta infraestructura a su vez depende en gran medida de que los manejadores de eventos sean lanzados correctamente. Cuando este no es el caso, las cosas pueden romperse. Debido a esto, hay un método `isBroken` que puede usar para verificar si el objetivo está disponible.

source: There are alternatives to using Relations. You could instead just store the UUID of an object. But using real relations and the catalog allows for very powerful things. The simplest concrete advantage is the possibility to see what links to your object.
es: Hay alternativas al uso de las Relaciones. En su lugar, podría simplemente almacenar el UUID de un objeto. Pero el uso de relaciones reales y el catálogo permite cosas muy poderosas. La ventaja concreta más simple es la posibilidad de ver qué enlaces a su objeto.

source: The builtin linkintegrity-feature of Plone 5 is also built using relations.
es: La función de integridad de enlace incorporada de Plone 5 también se crea utilizando relaciones.

source: RelationValue objects have a fairly complete API. For both target and source, you can receive the IntId, the object and the path. On a RelationValue, the terms `source` and `target` aren't used. Instead, they are `from` and `to`. So the API for getting the target is:
es: Los objetos RelationValue tienen una API bastante completa. Tanto para el objetivo como para el origen, puede recibir el IntId, el objeto y la ruta. En un RelationValue, los términos `source` y `target` no se usan. En cambio, son `from` y `to`. Entonces la API para obtener el objetivo es:

source: In addition, the relation value knows under which attribute it has been stored as `from_attribute`. It is usually the name of the field with which the relation is created. But it can also be the name of a relation that is created by code, e.g. linkintegrity-relations (`isReferencing`) or the relation between a working copy and the original (`iterate-working-copy`).
es: Además, el valor de relación sabe bajo qué atributo se ha almacenado como `from_attribute`. Por lo general, es el nombre del campo con el que se crea la relación. Pero también puede ser el nombre de una relación creada por código, por ej. relaciones integridad de enlaces linkintegrity-relations (`isReferencing`) o la relación entre una copia de trabajo y el documento original (`iterate-working-copy`).

source: Accessing relations and backrelations from code
es: Accediendo las relaciones y recoriendo la relaciones desde el código

source: If you want to find out what objects are related to each other, you use the relation catalog. Here is a convenience-method that allows you to find all kinds of relations.
es: Si desea averiguar qué objetos están relacionados entre sí, use el catálogo de relación. Aquí hay un método de conveniencia que le permite encontrar todo tipo de relaciones.

source: Resources
es: Recursos

source: We have not yet talked about CSS and JavaScript. At the moment these are considered static resources.
es: Todavía no hemos hablado de los archivos CSS y Javascript. Por el momento estos son considerados recursos estáticos.

source: You can declare and access static resources with special URLs. The `configure.zcml` of our package already has a declaration for a resource-folder :file:`static`.
es: Usted puede declarar y acceder a recursos estáticos desde direcciones URLs especiales. El archivo `configure.zcml` de su paquete ya tiene una declaración del directorio de recursos :file:`static`.

source: All files we put in the :file:`static` folder can be accessed via the url http://localhost:8080/Plone/++plone++ploneconf.site/the_real_filename.css
es: Todos los archivos los cuales nosotros colocamos en la carpeta :file:`static` pueden ser accedidos vía la dirección url http://localhost:8080/Plone/++plone++ploneconf.site/the_real_filename.css

source: Another feature of this folder is that the resources you put in there are editable and overrideable in the browser using the overrides-tab of the resource registry.
es: Otra característica de esta carpeta es que los recursos que ingresas allí son editables y sobreescribibles en el navegador usando la pestaña de overrides del registro de recursos.

source: Let's create a file :file:`ploneconf.css` in the :file:`static` folder with some CSS:
es: Crearemos un archivo :file:`ploneconf.css` en la carpeta :file:`static` con alguna sentencia CSS:

source: The css is not very exciting. It hides the :guilabel:`only in current section` below the search-box (we could also overwrite the viewlet, but ...).
es: El css no es muy emocionante. Oculta la :guilabel:`solo en la sección actual` debajo del cuadro de búsqueda (también podríamos sobrescribir el viewlet, pero ...).

source: It also hides the event-fields we added in :ref:`events-label` from people submitting their talks.
es: También oculta los campos de eventos que añadimos en :ref:`events-label` de las personas que envían sus charlas.

source: For exiting CSS you take the training :ref:`theming-label`.
es: Para el existente CSS usted tome el entrenamiento :ref:`theming-label`.

source: If we now access http://localhost:8080/Plone/++plone++ploneconf.site/ploneconf.css we see our CSS file.
es: Si nosotros ahora accedemos a http://localhost:8080/Plone/++plone++ploneconf.site/ploneconf.css nosotros veremos nuestro archivo CSS.

source: Also add a :file:`ploneconf.js` in the same folder but leave it empty for now. You could add some JavaScript to that file later.
es: También añada un archivo :file:`ploneconf.js` en la misma carpeta pero déjalo vacío por el momento. Puede añadir algo de código JavaScript a ese archivo más adelante.

source: How do our JavaScript and CSS files get used when visiting the page? For now the new files are accessible in the browser but we want Plone to use them every time we access the page.
es: ¿Cómo se utilizan nuestros archivos JavaScript y CSS al visitar la página? Por ahora, los nuevos archivos están accesibles en el navegador, pero queremos que Plone los use cada vez que accedemos a la página.

source: Adding them directly into the HTML is not a good solution, having many CSS and JS files slows down the page loading.
es: Añadirilos directamente al HTML no es una buena solución, tener muchos archivos CSS y JS ralentiza la carga de la página.

source: For this we need to register a *bundle* that contains these files. Plone will then make sure that all files that are part of this bundle are also deployed.
es: Para esto necesitamos registrar un archivo *bundle* que contenga estos archivos. Plone se asegurará de que todos los archivos que forman parte de este archivo bundle también se desplieguen.

source: We need to register our resources with GenericSetup.
es: Nosotros necesitamos registrar nuestros recursos con GenericSetup.

source: Open the file :file:`profiles/default/registry.xml` and add the following:
es: Abra el archivo :file:`profiles/default/registry.xml` y añada los siguiente:

source: The resources that are part of the registered bundle will now be deployed with every request.
es: Los recursos que forman parte del archivo bundle registrado y ahora se implementarán con cada request.

source: For more infos please see the docs about `resource registry <https://docs.plone.org/adapt-and-extend/theming/resourceregistry.html>`_ or this `training part <https://training.plone.org/5/theming/adv-diazo.html>`_.
es: Para obtener más información, consulte la documentación acerca de `registro de recursos <https://docs.plone.org/adapt-and-extend/theming/resourceregistry.html>`_ o esta `parte del entrenamiento <https://training.plone.org/5/theming/adv-diazo.html>`_.

source: Plone REST API
es: API Plone REST

source: In this chapter, we will have a look at the relatively new add-on `plone.restapi <https://plonerestapi.readthedocs.io/en/latest/index.html>`_.
es: En este capítulo, tendremos una mirada al relativamente nuevo complemento `plone.restapi <https://plonerestapi.readthedocs.io/en/latest/index.html>`_.

source: It provides a hypermedia API to access Plone content using REST (Representational State Transfer).
es: Ese provee una API hypermedia para acceder a contenido Plone usando REST (Representational State Transfer).

source: We will use :py:mod:`plone.restapi` to develop a small standalone 'single page app' targeted at mobile devices. We will present our users with a simple list of conference talks.
es: Nosotros usaremos el paquete :py:mod:`plone.restapi` para desarrollar una pequeña standalone 'single page app' destinada a dispositivos móviles. Nosotros presentaremos a nuestros usuarios con lista simple de la charlas de la conferencia.

source: We add lightning talks as a new type of talk. Users will be able to submit lightning talks e.g. using their mobile phone.
es: Nosotros añadimos charlas relámpago como un nuevo tipo de talk. Los usuarios tendrán la posibilidad de enviar charlas ligeras ej. usando su teléfono móvil.

source: We have the following tasks:
es: Tenemos las siguientes tareas:

source: create a talk list view
es: crear una vista de lista de talk

source: create a login screen and use JWT for authentication/authorization of requests
es: crear una pantalla de inicio de sesión y usar JWT para autenticación/autorización de solicitudes

source: let authenticated users submit lightning talks
es: permitir que los usuarios autenticados envíen charlas relámpago

source: Installing plone.restapi
es: Instalando plone.restapi

source: We install :py:mod:`plone.restapi` like any other add-on package by adding it to :file:`buildout.cfg` and then activating it in the :guilabel:`Add-ons` panel. This will automatically add and configure a new PAS plugin named `jwt_auth` used for JSON web token authentication.
es: Nosotros instalamos :py:mod:`plone.restapi` como cualquier otro paquete complemento agregándolo al archivo :file:`buildout.cfg` y luego activándolo en el panel :guilabel:`Complementos`. Esto añadirá y configurará automáticamente un nuevo plugin PAS llamado `jwt_auth` utilizado para la autenticación de token web JSON.

source: Explore the API
es: Explorar la API

source: Make sure you add some talks to the talks folder and then start exploring the API. We recommend using `Postman <https://www.getpostman.com>`_ or a similar tool, but you can also use `requests <https://pypi.org/project/requests>`_ in a Python virtual env.
es: Asegúrese que usted agrego algunos tipos de contenidos talks a la carpeta talks y luego comience a explorar la API. Recomendamos usar `Postman <https://www.getpostman.com>`_ o una herramienta similar, pero usted puede también usar el paquete `requests <https://pypi.org/project/requests>`_ en un entorno virtual Python.

source: :py:mod:`plone.restapi` uses 'content negotiation' to determine whether a client wants a REST API response - if you set the ``Accept`` HTTP header to ``application/json``, Plone will provide responses in JSON format. Some requests you could try:
es: :py:mod:`plone.restapi` utiliza 'content negotiation' para determinar si un cliente desea una respuesta REST API - si usted define el encabezado HTTP ``Accept`` con el valor ``application/json``, Plone proveerá respuestas en formato JSON. Algunos requests que podrías probar:

source: REST APIs use HTTP verbs for manipulating content. ``PATCH`` is used to update an existing resource.
es: Las API REST usan verbos HTTP para manipular contenido. El verbo ``PATCH`` se usa para actualizar un recurso existente.

source: Add a new talk in Plone and then update it's title to match 'Foo 42' using the REST API (from Postman or requests).
es: Añada un nuevo tipo de contenido talk en Plone y luego actualice su título para que coincida con 'Foo 42' usando el API REST (desde el cliente Postman o el paquete requests).

source: We need to login to change content. Using JWT, we do so by POSTing credentials to the ``@login`` resource to obtain a JSON web token that we can subsequently use to authorize requests.
es: Necesitamos iniciar sesión para cambiar el contenido. Al usar JWT, lo hacemos al colocar las credenciales en el recurso ``@login`` para obtener un token web JSON que luego podemos utilizar subsecuentemente para autorizar las requests.

source: The response will look like this:
es: La respuesta lucirá como este:

source: Using the :py:mod:`requests` library from Python, you would do:
es: Usando la librería :py:mod:`requests` desde Python, usted harías:

source: Now we can change the talk title:
es: Ahora podemos cambiar el título del tipo de contenido talk:

source: Using :py:mod:`requests` again:
es: Usando :py:mod:`requests` otra vez:

source: Implementing the talklist
es: Implementando la vista talklist

source: We will use `Mobile Angular UI <http://mobileangularui.com/>`_ to develop our app. This is a relatively lightweight JavaScript framework for developing hybrid web apps built on top of `AngularJS <https://angularjs.org/>`_. There are a lot of other frameworks available (e.g. Ionic, OnsenUI, Sencha, ...), but most of them have more dependencies than `Mobile Angular UI`.
es: Utilizaremos `Mobile Angular UI <http://mobileangularui.com/>`_ para desarrollar nuestra aplicación. Este es un marco de JavaScript relativamente ligero para desarrollar aplicaciones web híbridas construidas sobre `AngularJS <https://angularjs.org/>`_. Hay muchos otros marcos disponibles (por ejemplo, Ionic, OnsenUI, Sencha, ...), pero la mayoría de ellos tienen más dependencias que `Mobile Angular UI`.

source: For example, most of them require NodeJS as a development web server.
es: Por ejemplo, mucho de ellos requieren NodeJS como un servidor web de desarrollo.

source: Our focus is Plone and interacting with :py:mod:`plone.restapi`, and `Mobile Angular UI` perfectly suits our needs because it simply lets us use Plone as our development webserver.
es: Nuestro enfoque es Plone e interactuar con :py:mod:`plone.restapi`, y `Mobile Angular UI` se adapta perfectamente a nuestras necesidades porque simplemente nos permite usar Plone como nuestro servidor web de desarrollo.

source: To get started, we download the current `master branch of Mobile Angular UI <https://codeload.github.com/mcasimir/mobile-angular-ui/zip/master>`_ from GitHub, extract it and copy the :file:`dist` folder into a new subdirectory of :file:`browser` named :file:`talklist`.
es: Para iniciarse, nosotros descargamos la actual `rama de git master de Mobile Angular UI <https://codeload.github.com/mcasimir/mobile-angular-ui/zip/master>`_ desde GitHub, lo extraemos y copiamos la carpeta :file:`dist` como un nuevo subdirectorio dentro de la carpeta :file:`browser` llamado :file:`talklist`.

source: Assuming the current working directory is the buildout directory:
es: Asumiendo que el directorio actual de trabajo es el directorio buildout:

source: Then we add a new resource directory to :file:`browser/configure.zcml`:
es: Entonces nosotros añadimos un nuevo directorio de recurso al archivo :file:`browser/configure.zcml`:

source: In the :file:`browser/talklist` directory, we add an HTML page called :file:`index.html`:
es: En el directorio :file:`browser/talklist`, nosotros añadimos una nueva página HTML llamada :file:`index.html`:

source: Now you can point your browser to http://localhost:8080/Plone/++resource++talklist/index.html to see the result.
es: Ahora puede apuntar en su navegador a la dirección URL http://localhost:8080/Plone/++resource++talklist/index.html para ver el resultado.

source: The page will display a list of published talks.
es: La página mostrará una lista de tipo de contenido talks publicadas.

source: We also need some JavaScript that we put into a file named :file:`talklist.js` in the same folder:
es: Nosotros también necesitamos algún JavaScript que nosotros ponemos dentro de un archivo llamado :file:`talklist.js` en la misma carpeta:

source: Submit lightning talks
es: Enviando charlas relámpago

source: We add a new type of talk: lightning talk. A lightning talk is a short presentation of up to 5 minutes duration that can cover just about any topic.
es: Nosotros añadimos un nuevo tipo de charla. Una charla relámpago es una breve presentación de hasta 5 minutos de duración que puede cubrir casi cualquier tema.

source: The information we need to provide for lightning talks is far less than for the more formal types of talk.
es: La información que necesitamos proporcionar para las charlas relámpago es mucho menor que para los tipos más formales de charla.

source: Often the information provided for lightning talks is restricted to the talk subject or title and the speaker name, but we allow for a short summary.
es: A menudo, la información provista para las charlas relámpago está restringida al tema o título de la conversación y al nombre del speaker, pero permitimos un breve resumen.

source: Before they can submit a lightning talk, potential speakers will need to login and we will use their previously registered login name as the speaker's name to display in the talk list.
es: Antes de que puedan enviar una charla relámpago, los posibles speakers deberán iniciar sesión y usaremos su nombre de usuario previamente registrado como el nombre del speaker para mostrar en la lista de charlas.

source: Before we can start to submit lightning talks using REST calls from our single page app, we have to adapt the talk schema:
es: Antes de que podamos comenzar a enviar charlas relámpago utilizando llamadas REST desde nuestra single page app, tenemos que adaptar el esquema talk:

source: Next, in our JavaScript code, we provide a method for logging in a user and another one to check whether the user has a valid JSON web token. We use the ``localStorage`` facility of the browser to store the token on the client.
es: A continuación, en nuestro código JavaScript, proporcionamos un método para iniciar sesión en un usuario y otro para verificar si el usuario tiene un token web JSON válido. Usamos la instalación ``localStorage`` del navegador web para almacenar el token en el cliente web.

source: We continue with changes to :file:`index.html` so that it uses the new methods. We provide a login form if the user doesn't have a valid JSON web token.
es: Continuamos con los cambios al archivo :file:`index.html` para que use los nuevos métodos. Proporcionamos un formulario de inicio de sesión si el usuario no tiene un token web JSON válido.

source: Only authenticated users can see the rest of the page.
es: Solo los usuarios autenticados pueden ver el resto de la página.

source: Last we have to add some code that allows authenticated users to submit a lightning talk. We add another JavaScript method first:
es: Por último, tenemos que añadir un código que permita a los usuarios autenticados enviar una charla relámpago. Añadimos otro método de JavaScript primero:

source: Rewrite the ``load_talks()`` JavaScript method that it uses the portal search instead of ``/Plone/talks``. Sort the list by date.
es: Reescribir el método JavaScript ``load_talks()`` que utiliza la búsqueda del portal en lugar de ``/Plone/talks``. Ordena la lista por fecha.

source: Making Our Package Reusable
es: Haciendo nuestro paquete reusable

source: Add Permissions
es: Añadiendo permisos

source: The package contains some problems.
es: Esta paquete contiene algunos problemas.

source: No permission settings, Users can't customize who and when users can vote
es: Sin configuración de permisos, los usuarios no pueden personalizar quién y cuándo los usuarios pueden votar

source: We do things, but don't trigger events. Events allow others to react.
es: Hacemos cosas, pero no provocamos eventos. Los eventos permiten que otros reaccionen.

source: Adding permissions
es: Añadiendo permisos

source: Zope 2 Permissions
es: Permisos de Zope 2

source: Zope 3 Permissions
es: Permisos de Zope 3

source: Permissions have a long history, there are two types of permissions.
es: Los permisos tienen una larga historia, hay dos tipos de permisos.

source: In Zope2, a permission was just a string.
es: En Zope2, un permiso era sólo una cadena.

source: In ZTK, a permission is an object that gets registered as a Utility.
es: En el ZTK, un permiso es un objeto que se registra como una Utilidad.

source: We must support both, in some cases we have to reference the permission by their Zope2 version, in some by their ZTK Version.
es: Debemos apoyar a ambos, en algunos casos tenemos que referenciar el permiso por su versión Zope2, en algunos por su versión ZTK.

source: Luckily, there is a zcml statement to register a permission both ways in one step.
es: Por suerte, hay una declaración zcml para registrar un permiso de ambas maneras en un solo paso.

source: The configuration registry was meant to solve a problem, but we will now stumble over a problem that did not get resolved properly.
es: El registro de configuración estaba destinado a resolver un problema, pero ahora tropezaremos con un problema que no se resolvió correctamente.

source: Our permission is a utility. Our browser views declare this permission as a requirement for viewing them.
es: Nuestro permiso es una utilidad. Nuestras browser views declaran este permiso como un requisito para verlos.

source: When our browser views get registered, the permissions must exist already. If you try to register the permissions after the views, Zope won't start because it doesn't know about the permissions.
es: Cuando nuestras browser views se registren, los permisos deben existir ya. Si intenta registrar los permisos después de las vistas, Zope no se iniciará porque no sabe acerca de los permisos.

source: Let's modify the file :file:`configure.zcml`
es: Modifiquemos el archivo :file:`configure.zcml`

source: In some places we have to reference the Zope 2 permission strings. It is best practice to provide a static variable for this.
es: En algunos lugares tenemos que hacer referencia a las cadenas de permisos de Zope 2. Es la mejor práctica proporcionar una variable estática para esto.

source: We provide this in :file:`__init__.py`
es: Proporcionamos esto en el archivo :file:`__init__.py`

source: Using our permissions
es: Usando nuestros permisos
