Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: ``view`` is always the BrowserView for which the template is registered. In our case this is either :py:class:`plone.app.contenttypes.browser.collection.CollectionView` if you called that view on a collection, or :py:class:`plone.app.contenttypes.browser.folder.FolderView` for folders.
es: ``view`` es siempre el BrowserView para el cual está registrada la plantilla. En nuestro caso, esto es :py:class:`plone.app.contenttypes.browser.collection.CollectionView` si llamó a esa vista en una colección, o :py:class:`plone.app.contenttypes.browser.folder.FolderView` para las carpetas.

source: You might remember that both are defined in :file:`configure.zcml`
es: Puede recordar que ambos están definidos en el archivo :file:`configure.zcml`

source: Luckily the first is a class that inherits from the second:
es: Afortunadamente, el primero es una clase que hereda del segundo:

source: :py:meth:`batch` is a method in :py:class:`FolderView` that turns :py:obj:`results` into batches. :py:obj:`results` exists in both classes. This means, in case the item we are looking at is a collection, the method :py:meth:`results` of :py:class:`CollectionView`, will be used; and in case it's a folder, the one in :py:class:`FolderView`.
es: :py:meth:`batch` es un método en la clase :py:class:`FolderView` eso convierte :py:obj:`results` en lotes. El objeto :py:obj:`results` existe en ambas clases. Esto significa que, en caso de que el artículo que estamos viendo sea una colección, el método :py:meth:`results` de la clase :py:class:`CollectionView`, se utilizará; y en caso de que sea una carpeta, la de la clase :py:class:`FolderView`.

source: `batch` is a list of items.
es: `batch` es una lista de elementos.

source: The way it is created is actually pretty complicated and makes use of a couple of packages to create a filtered (through :py:mod:`plone.app.querystring`) list of optimized representations (through :py:mod:`plone.app.contentlisting`) of items.
es: La forma en que se crea es realmente bastante complicada y hace uso de un par de paquetes para crear una lista filtrada (a través de :py:mod:`plone.app.querystring`) de representaciones optimizadas (a través de :py:mod:`plone.app.contentlisting`) de elementos.

source: For now it is enough to know that `item` represents one of the items in the list of News Items.
es: Por ahora, es suficiente saber que `item` representa uno de los elementos de la lista de Noticias.

source: The template :file:`listing_summary.pt` is extraordinary in its heavy use of nested macros.
es: La plantilla :file:`listing_summary.pt` es extraordinaria en su uso intensivo de macros anidados.

source: Most of the templates you will write are much simpler and easier to read.
es: La mayoría de las plantillas que escribirá son mucho más simples y fáciles de leer.

source: It can be hard to understand templates as complicated as these, but there is help to be found if you know Python: use :py:mod:`pdb` to debug templates line by line.
es: Puede ser difícil entender plantillas tan complicadas como estas, pero puede encontrar ayuda si conoce Python: use :py:mod:`pdb` para depurar las plantillas línea por línea.

source: Add the following to line 29 just before our additions::
es: Añada lo siguiente a la línea 29 justo antes de nuestras adiciones::

source: When you reload the page and look at the terminal you see you have the pdb console and can inspect the template at its current state by looking at the variable `econtext`.
es: Cuando recarga la página y mire en la terminal, ve que tiene la consola pdb y puede inspeccionar la plantilla en su estado actual mirando la variable `econtext`.

source: You can now simply look up what `item ` and `PortalType` are:
es: Ahora puede simplemente buscar qué `item` y `PortalType` son:

source: As discovered above, `item` is a instance of :py:class:`plone.app.contentlisting.catalog.CatalogContentListingObject`.
es: Como se descubrió anteriormente, `item` es una instancia de clase de :py:class:`plone.app.contentlisting.catalog.CatalogContentListingObject`.

source: It has several methods and properties:
es: Tiene varios métodos y propiedades:

source: `PortalType` is a method that returns the name of the items content-type.
es: `PortalType` es un método que devuelve el nombre del tipo de contenido de los elementos.

source: Finding the right template
es: Buscando la correcta plantilla

source: We changed the display of the listing of news items at http://localhost:8080/Plone/news.
es: Cambiamos la visualización de la lista de noticias en http://localhost:8080/Plone/news.

source: How do we know which template to customize?
es: ¿Cómo sabemos qué plantilla personalizar?

source: If you don't know which template is used by the page you're looking at, you can:
es: Si no sabe qué plantilla utiliza la página que está mirando, puede:

source: make an educated guess
es: hacer una conjetura educada

source: use :py:mod:`plone.app.debugtoolbar`
es: use el paquete :py:mod:`plone.app.debugtoolbar`

source: or start a debug session
es: o inicie una sesión en depuración

source: We could check the HTML with Firebug and look for a structure in the content area that looks unique.
es: Podríamos verificar el HTML con Firebug y buscar una estructura en el área de contenido que se vea única.

source: We could also look for the CSS class of the body
es: También podríamos buscar la clase CSS del cuerpo

source: The class ``template-summary_view`` tells us that the name of the view (but not necessarily the name of the template) is ``summary_view``. So we could search all :file:`*.zcml`-Files for ``name="summary_view"`` or search all templates called :file:`summary_view.pt` and probably find the view and also the corresponding template. But only probably because it would not tell us if the template is already being overridden.
es: La clase ``template-summary_view`` nos dice que el nombre de la vista (pero no necesariamente el nombre de la plantilla) el cual es ``summary_view``. Así que podríamos buscar en todos los archivos :file:`*.zcml` la cadena ``name="summary_view"`` o buscar todas las plantillas llama :file:`summary_view.pt` y probablemente encontrar la vista y también la plantilla correspondiente. Pero probablemente sólo porque esa no nos diría si ya está siendo sobrescrita la plantilla.

source: A foolproof way to verify your guess is to modify the template and reload the page. If your modification shows up you obviously found the correct file.
es: Una forma infalible de verificar su conjetura es modificar la plantilla y volver a cargar la página. Si aparece su modificación, obviamente encontró el archivo correcto.

source: The safest method is using :py:mod:`plone.app.debugtoolbar`. We already have it in our buildout and only need to install it. It adds a "Debug" dropdown menu on top of the page.
es: El método más seguro es usar :py:mod:`plone.app.debugtoolbar`. Ya lo tenemos en nuestro buildout y solo necesitamos instalarlo. Añada un menú desplegable "Depurar" en la parte superior de la página.

source: The section "Published" shows the complete path to the template that is used to render the page you are seeing.
es: La sección "Publicado" muestra la ruta completa a la plantilla que se utiliza para representar la página que está viendo.

source: Install it now and find information about the current template in the section **Published**.
es: Instálelo ahora y encuentre información sobre la plantilla actual en la sección **Publicado**.

source: The debug session to find the template is a little more complicated. Since we have :py:mod:`Products.PDBDebugMode` in our buildout we can call the Browser View ``pdb`` on our page by appending ``/pdb`` to the url. We cannot put a `pdb` in the templates since we do not know (yet) which template to put the `pdb` in.
es: La sesión de depuración para encontrar la plantilla es un poco más complicada. Como tenemos el módulo :py:mod:`Products.PDBDebugMode` en nuestro buildout, podemos llamar a la vista del navegador ``pdb`` en nuestra página al añadir ``/pdb`` a la dirección url. No podemos poner un `pdb` en las plantillas, ya que no sabemos (todavía) en qué plantilla colocar el `pdb`.

source: The object that the URL points to is by default :py:obj:`self.context`. But the first problem is that the URL we're seeing is not the URL of the collection we want to modify. This is because the collection is the default page of the folder ``news``.
es: El objeto al que apunta la dirección URL es por defecto :py:obj:`self.context`. Pero el primer problema es que la dirección URL que estamos viendo no es la dirección URL de la colección que queremos modificar. Esto se debe a que la colección es la página por defecto de la carpeta ``news``.

source: Now we see that we already customized the template.
es: Ahora puede ver que nosotros personalizamos la plantilla.

source: Here is a small method that could be used in a view or viewlet to display that path:
es: Aquí hay un pequeño método que podría usarse en una vista o viewlet para mostrar esa ruta:

source: skin templates
es: plantillas skins

source: Why don't we always only use templates? Because we might want to do something more complicated than get an attribute from the context and render its value in some HTML tag.
es: ¿Por qué no siempre usamos plantillas? Porque es posible que deseemos hacer algo más complicado que obtener un atributo del contexto y representar su valor en alguna etiqueta HTML.

source: There is a deprecated technology called 'skin templates' that allows you to simply add some page template (e.g. 'old_style_template.pt') to a certain folder in the ZMI or your egg and you can access it in the browser by opening a URL like http://localhost:8080/Plone/old_style_template and it will be rendered.
es: Hay una tecnología obsoleta llamada 'plantillas skin' que le permite simplemente añadir una plantilla de página (por ejemplo, 'old_style_template.pt') a una determinada carpeta en la ZMI o su paquete egg y puede acceder a ella en el navegador abriendo una dirección URL como http://localhost:8080/Plone/old_style_template y se representará.

source: But we don't use it and you too should not, even though these skin templates are still all over Plone.
es: Pero no lo usamos y usted tampoco debería, a pesar de que estas plantillas skin todavía están en todo Plone.

source: Since we use :py:mod:`plone.app.contenttypes` we do not encounter many skin templates when dealing with content any more. But more often than not you'll have to customize an old site that still uses skin templates.
es: Desde que usamos :py:mod:`plone.app.contenttypes` no encontramos nunca más muchas plantillas skin cuando se trata de contenidos. Pero más a menudo que usted no tendrás que personalizar un sitio antiguo que aún utiliza la plantillas skin.

source: Skin templates and Python scripts in ``portal_skins`` are deprecated because:
es: Skin templates y Python scripts en ``portal_skins`` son obsoletos porque:

source: they use restricted Python
es: ellos son Python restringido

source: they have no nice way to attach Python code to them
es: no tienen buena manera de adjuntar código Python a ellos

source: they are always callable for everything (they can't easily be bound to an interface)
es: siempre se pueden llamar para todo (no pueden vincularse fácilmente a una interfaz)

source: Overriding templates with :py:mod:`z3c.jbot` is easy.
es: Sobreescribir plantillas con :py:mod:`z3c.jbot` es facil.

source: Understanding templates can be hard.
es: Entendiendo plantillas puede ser duro.

source: Use plone.app.debugtoolbar and pdb; they are there to help you.
es: Usar plone.app.debugtoolbar y pdb; le de mucha ayuda a usted.

source: Skin templates are deprecated; you will probably only encounter them when you work on Plone 4 or older add-ons and client code.
es: Las Skin templates están en desuso probablemente solo los encontrará cuando trabaje con complementos de Plone 4 o versiones anteriores y código de cliente.
