Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Go to *Sharing* and grant the role *Can add* to the group logged-in users. Now every user can add content in this folder (and only this folder).
es: Valla a la pestaña *Compartir* y otorgar el rol *Puede añadir* al grupo Usuarios conectados. Ahora cualquier usuario puede añadir contenido en esta carpeta (y solamente en esta carpeta).

source: Now all logged-in users can create and submit talks in this folder with the permission of the default workflow.
es: Ahora todos los usuarios que han iniciado sesión pueden crear y enviar charlas en esta carpeta con el permiso del flujo de trabajo predeterminado.

source: A custom workflow for talks
es: Un flujo de trabajo personalizado para las charlas

source: We still need to fix a problem: Authenticated users can see all talks, even the ones of other users in the private state. Since we don't want this we will create a modified workflow for talks. The new workflow will only let them see and edit talks they created themselves and not the ones of other users.
es: Todavía tenemos que solucionar un problema: los usuarios autenticados pueden ver todas las conversaciones, incluso los de otros usuarios en el estado privado. Ya que no queremos que esto vamos a crear un flujo de trabajo modificado para las charlas. El nuevo flujo de trabajo sólo les permitirá ver y editar las conversaciones que han creado ellos mismos y no los de otros usuarios.

source: Go to the :menuselection:`ZMI --> portal_workflow`
es: Valla al :menuselection:`ZMI --> portal_workflow`

source: See how talks have the same workflow as most content, namely :guilabel:`(Default)`
es: Vea cómo las conversaciones tienen el mismo flujo de trabajo que la mayoría del contenido, a saber `:guilabel:`(Predeterminado)`

source: Go to the tab :guilabel:`Contents`, check the box next to :guilabel:`simple_publication_workflow`, click :guilabel:`copy` and :guilabel:`paste`.
es: Vaya a la pestaña :guilabel:`Contenidos`, marque la casilla al lado de :guilabel:`simple_publication_workflow`, haga clic :guilabel:`copiar` y :guilabel:`pegar`.

source: Rename the new workflow from *copy_of_simple_publication_workflow* to *talks_workflow*.
es: Renombrar el nuevo flujo de trabajo desde *copy_of_simple_publication_workflow* a *talks_workflow*.

source: Edit the workflow by clicking on it: Change the Title to *Talks Workflow*.
es: Edite el flujo de trabajo haciendo clic en: Change the Title to *Flujo de trabajo de Charla*.

source: Click on the tab :guilabel:`States` and click on :guilabel:`private` to edit this state. In the next view select the tab :guilabel:`Permissions`.
es: Haga clic en la pestaña :guilabel:`States` y haga clic en :guilabel:`private` para editar este estado. En la vista siguiente, seleccione la pestaña :guilabel:`Permissions`.

source: Find the table column for the role :guilabel:`Contributor` and remove the permissions for :guilabel:`Access contents information` and :guilabel:`View`. Note that the :guilabel:`Owner` (i.e. the Creator) still has some permissions.
es: Busque la columna de la tabla para el rol :guilabel:`Contributor` y elimine los permisos para :guilabel:`Access contents information` y :guilabel:`View`. Tenga en cuenta que :guilabel:`Owner` (es decir, el creador) todavía tiene algunos permisos.

source: Do the same for the state :guilabel:`pending`
es: Haz lo mismo con el estado :guilabel:`pending`

source: Go back to :file:`portal_workflow` and set the new workflow :file:`talks_workflow` for talks. Click :file:`Change` and then :file:`Update security settings`.
es: Vuelva a ir a la herramienta :file:`portal_workflow` y establecer el nuevo flujo de trabajo :file:`talks_workflow` para las talks. Haga clic :file:`Change` y entonces :file:`Update security settings`.

source: The add-on `plone.app.workflowmanager <https://pypi.org/project/plone.app.workflowmanager>`_ provides a much nicer user-interface for this. The problem is you need a big screen for it and it can be pretty confusing as well.
es: El complemento `plone.app.workflowmanager <https://pypi.org/project/plone.app.workflowmanager>`_ proporciona una interfaz de usuario mucho más agradable para esto. El problema es que necesitas una pantalla grande y puede ser bastante confuso también.

source: Done.
es: Hecho.

source: Move the changes to the file system
es: Mueva los cambios al sistema de archivos

source: We don't want to do these steps for every new conference by hand so we move the changes into our package.
es: No queremos hacer estos pasos para cada nueva conferencia manualmente para que nos movemos los cambios en nuestro paquete.

source: Import/Export the Workflow
es: Importar/Exportar el Flujo de trabajo

source: export the GenericSetup step *Workflow Tool* in http://localhost:8080/Plone/portal_setup/manage_exportSteps.
es: exporte el paso GenericSetup *Workflow Tool* en http://localhost:8080/Plone/portal_setup/manage_exportSteps.

source: drop the file :file:`workflows.xml` into :file:`profiles/default` an clean out everything that is not related to talks.
es: suelte el archivo :file:`workflows.xml` dentro de la carpeta :file:`profiles/default` y limpie todo lo que no esté relacionado con los tipos de contenidos talks.

source: drop :file:`workflows/talks_workflow/definition.xml` in :file:`profiles/default/workflows/talks_workflow/definition.xml`. The other files are just definitions of the default-workflows and we only want things in our package that changes Plone.
es: suelte el archivo :file:`workflows/talks_workflow/definition.xml` en el archivo :file:`profiles/default/workflows/talks_workflow/definition.xml`. Los otros archivos son solo definiciones de los flujos de trabajo predeterminados y solo queremos elementos en nuestro paquete que cambien a Plone.

source: Enable self-registration
es: Habilitar autoregistro

source: To enable self-registration you need to change the global setting that controls this option. Most global setting are stored in the registry. You can modify it by adding following to :file:`profiles/default/registry.xml`:
es: Para habilitar el auto-registro, debe cambiar la configuración global que controla esta opción. La mayoría de las configuraciones globales se almacenan en el registro. Puede modificarlo añadiendo lo siguiente al archivo :file:`profiles/default/registry.xml`:

source: Since the granting of local roles applies only to a certain folder in the site we would not always write code for it but do it by hand. But for testability and repeatability (there is a conference every year!) we should create the initial content structure automatically.
es: Dado que la concesión de roles locales se aplica solo a una determinada carpeta en el sitio, no siempre escribiremos el código para ello, sino que lo haremos a mano. Pero para la capacidad de prueba y la repetibilidad (¡hay una conferencia todos los años!) Debemos crear la estructura de contenido inicial automáticamente.

source: So let's make sure some initial content is created and configured on installing the package.
es: Así que asegurémonos de que se cree y configure algún contenido inicial al instalar el paquete.

source: To run arbitrary code during the installation of a package we use a `post_handler <https://docs.plone.org/develop/addons/components/genericsetup.html#custom-installer-code-setuphandlers-py>`_
es: Para ejecutar código arbitrario durante la instalación de un paquete nosotros usamos un `post_handler <https://docs.plone.org/develop/addons/components/genericsetup.html#custom-installer-code-setuphandlers-py>`_

source: Our package already has such an method registered in :file:`configure.zcml`. It will be automatically run when (re-)installing the add-on.
es: Nuestro paquete ya tiene un método registrado en el archivo :file:`configure.zcml`. Se ejecutará automáticamente al (re)instalar el complemento.

source: This makes sure the method :py:meth:`post_install` in :file:`setuphandlers.py` is executed after the installation. The method already exists doing nothing. You need to extend it to do what we want.
es: Esto asegura que el método :py:meth:`post_install` en el archivo :file:`setuphandlers.py` se ejecuta después de la instalación. El método ya existe sin hacer nada. Necesitas extenderlo para hacer lo que queremos.

source: Once we reinstall our package a folder :file:`talks` is created with the appropriate local roles and constraints.
es: Una vez que reinstalemos nuestro paquete, una carpeta :file:`talks` se crea con los roles y restricciones locales apropiados.

source: We wrote similar code to create the folder *The Event* in :ref:`dexterity2-upgrades-label`. We need it to make sure a sane structure gets created when we create a new site by hand or in tests.
es: Escribimos un código similar para crear la carpeta *The Event* en :ref:`dexterity2-upgrades-label`. Lo necesitamos para asegurarnos de que se cree una estructura sana cuando creamos un nuevo sitio a mano o en pruebas.

source: You would usually create a list of dictionaries containing the type, parent and title plus optionally layout, workflow state etc. to create an initial structure. In some projects it could also make sense to have a separate profile besides ``default`` which might be called ``demo`` or ``content`` that creates an initial structure and maybe another ``testing`` that creates dummy content (talks, speakers etc) for tests.
es: Por lo general, creará una lista de diccionarios que contengan el tipo, el padre y el título más el diseño opcional, el estado del flujo de trabajo, etc. para crear una estructura inicial. En algunos proyectos, también podría tener sentido tener un perfil separado además del ``default`` que podría llamarse ``demo`` o ``content`` eso crea una estructura inicial y quizás otra ``testing`` que crea contenido falso (talks, speakers, etc) para las pruebas.

source: Create a profile ``content`` that runs its own post_handler in :file:`setuphandlers.py`.
es: Cree un perfil ``content`` que ejecute su propio post_handler en el archivo :file:`setuphandlers.py`.

source: Register the profile and the upgrade step in :file:`configure.zcml`
es: Registre el perfil y el paso de actualización en el archivo :file:`configure.zcml`

source: Also add a :file:`profiles/content/metadata.xml` so the default profile gets automatically installed when installing the content profile.
es: También añada un :file:`profiles/content/metadata.xml` para que el perfil por defecto se instale automáticamente al instalar el perfil de contenido.

source: Add the structure you wish to create as a list of dictionaries in :file:`setuphandlers.py`:
es: Añada la estructura que desea crear como una lista de diccionarios en el archivo :file:`setuphandlers.py`:

source: Add the method :py:meth:`content` to :file:`setuphandlers.py`. We pointed to that when registering the import step. And add some fancy logic to create the content from ``STRUCTURE``.
es: Añada el método :py:meth:`content` al archivo :file:`setuphandlers.py`. Señalamos eso al registrar el paso de importación. Y añada una lógica elegante para crear el contenido desde ``STRUCTURE``.

source: A huge benefit of this implementation is that you can add any object-attribute as a new item to :py:data:`item_dict`. :py:meth:`plone.api.content.create` will then set these on the new objects. This way you can also populate fields like :py:attr:`text` (using :py:class:`plone.app.textfield.RichTextValue`) or :py:attr:`image` (using :py:class:`plone.namedfile.file.NamedBlobImage`).
es: Un gran beneficio de esta implementación es que puede añadir cualquier atributo de objeto como un nuevo elemento para :py:data:`item_dict`. :py:meth:`plone.api.content.create` luego los establecerá en los objetos nuevos. De esta forma también puedes poblar campos como :py:attr:`text` (usando :py:class:`plone.app.textfield.RichTextValue`) o :py:attr:`image` (usando :py:class:`plone.namedfile.file.NamedBlobImage`).

source: Writing Viewlets
es: Escribiendo Viewlets

source: Display data from a behavior in a viewlet
es: Mostrar datos de un comportamiento en un viewlet

source: A viewlet for the social behavior
es: Un viewlet para el comportamiento social

source: A viewlet is not a view but a snippet of HTML and logic that can be put in various places in the site. These places are called ``viewletmanager``.
es: Un viewlet no es una vista, sino un fragmento de HTML y lógica que puede colocarse en varios lugares del sitio. Estos lugares se llaman ``viewletmanager``.

source: Inspect existing viewlets and their managers by going to http://localhost:8080/Plone/@@manage-viewlets.
es: Inspeccione y administre los viewlets existentes yendo a la dirección URL http://localhost:8080/Plone/@@manage-viewlets.

source: We already customized a viewlet (:file:`colophon.pt`). Now we add a new one.
es: Ya hemos personalizado un viewlet (:file:`colophon.pt`). Ahora añadimos uno nuevo.

source: Viewlets don't save data (portlets do)
es: Las viewlets no guardan datos (los portlets sí)

source: Viewlets have no user interface (portlets do)
es: Las viewlets no tienen interfaz de usuario (los portlets sí)

source: Social viewlet
es: Viewlet social

source: Let's add a link to the site that uses the information that we collected using the social behavior.
es: Añada un enlace al sitio que usa la información que recopilamos utilizando el comportamiento social.

source: We register the viewlet in :file:`browser/configure.zcml`.
es: Registramos el viewlet en el archivo :file:`browser/configure.zcml`.

source: ``for``, ``manager``, ``layer`` and ``permission`` are constraints that limit the contexts in which the viewlet is loaded and rendered, by filtering out all the contexts that do not match those constraints.
es: ``for``, ``manager``, ``layer`` y ``permission`` son restricciones que limitan los contextos en los que se carga y renderiza el viewlet, al filtrar todos los contextos que no coinciden con esas restricciones.

source: This registers a viewlet called ``social``. It is visible on all content that implements the interface :py:class:`ISocial` from our behavior. It is also good practice to bind it to a specific ``layer``, so it only shows up if our add-on is actually installed. We will return to this in a later chapter.
es: Esto registra un viewlet llamado ``social``. Es visible en todo el contenido que implementa la interfaz :py:class:`ISocial` de nuestro comportamiento. También es una buena práctica vincularlo a una ``layer`` específica, por lo que solo aparece si nuestro complemento está realmente instalado. Volveremos sobre esto en un capítulo posterior.

source: The viewlet class :py:class:`SocialViewlet` is expected in a file :file:`browser/viewlets.py`.
es: La clase viewlet :py:class:`SocialViewlet` se espera en un archivo :file:`browser/viewlets.py`.

source: This class does nothing except rendering the associated template (That we have yet to write)
es: Esta clase no hace más que representar la plantilla asociada (Que aún tenemos que escribir)

source: Let's add the missing template :file:`templates/social_viewlet.pt`.
es: Vamos a añadir el archivo de la plantilla restante :file:`templates/social_viewlet.pt`.

source: As you can see this is not a valid HTML document. That is not needed, because we don't want a complete view here, a HTML snippet is enough.
es: Como puede ver, este no es un documento HTML válido. Eso no es necesario, porque no queremos una vista completa aquí, un fragmento de HTML es suficiente.

source: There is a :samp:`tal:define` statement, querying for :samp:`view/lanyrd_link`. Same as for views, viewlets have access to their class in page templates, as well.
es: Hay una instrucción :samp:`tal:define`, que consulta por :samp:`view/lanyrd_link`. Igual que para las vistas, los viewlets también tienen acceso a su clase en las plantillas de página.

source: We have to extend the Social Viewlet now to add the missing attribute:
es: Tenemos que ampliar el Viewlet Social ahora para añadir el atributo que le falta:

source: In this example, :samp:`ISocial(self.context)` does return the context directly. It is still good to use this idiom for two reasons:
es: En este ejemplo, :samp:`ISocial(self.context)` devuelve el contexto directamente. Todavía es bueno utilizar este idioma por dos razones:

source: It makes it clear that we only want to use the ISocial aspect of the object
es: Deja en claro que solo queremos usar el aspecto ISocial del objeto

source: If we decide to use a factory, for example to store our attributes in an annotation, we would `not` get back our context, but the adapter.
es: Si decidimos utilizar una fábrica, por ejemplo, para almacenar nuestros atributos en una anotación, nosotros deberíamos `no` conseguir nuestro contexto, pero si el adaptador.

source: Therefore in this example you could simply write :samp:`return self.context.lanyrd`.
es: Por lo tanto, en este ejemplo, simplemente puedes escribir :samp:`return self.context.lanyrd`.

source: So far, we
es: Hasta ahora, hemos hecho:

source: register the viewlet to content that has the ISocial Interface.
es: registrar el viewlet al contenido que tiene la interfaz iSocial.

source: adapt the object to its behavior to be able to access the fields of the behavior
es: adaptar el objeto a su comportamiento para poder acceder a los campos del comportamiento

source: return the link
es: devolver el enlace

source: Register a viewlet 'number_of_talks' in the footer that is only visible to admins (the permission you are looking for is :py:class:`cmf.ManagePortal`). Use only a template (no class) to display the number of talks already submitted.
es: Registre un viewlet 'number_of_talks' en el pie de página que solo sea visible para los administradores (el permiso que está buscando es :py:class:`cmf.ManagePortal`). Use solo una plantilla (sin clase) para mostrar la cantidad de talks ya enviadas.

source: Hint: Use Acquisition to get the catalog (You know, you should not do this but there is plenty of code out there that does it...)
es: Sugerencia: utilice Acquisition para obtener el catálogo (ya sabe, no debe hacer esto, pero hay muchos códigos que lo hacen ...)

source: For the ``for`` and ``layer``-parameters ``*`` is shorthand for :py:class:`zope.interface.Interface` and the same effect as omitting them: The viewlet will be shown for all types of pages and for all Plone sites within your Zope instance.
es: Para los parámetros ``for``, ``layer`` y `` * `` es una abreviatura de :py:class:`zope.interface.Interface` y el mismo efecto que omitirlos: el viewlet se mostrará para todos tipos de páginas y para todos los sitios Plone dentro de su instancia Zope.

source: Add the template :file:`browser/templates/number_of_talks.pt`:
es: Añadir el archivo de la plantilla :file:`browser/templates/number_of_talks.pt`:

source: :samp:`python:context.portal_catalog` will return the catalog through Acquisition. Be careful if you want to use path expressions: :samp:`content/portal_catalog` calls the catalog (and returns all brains). You need to prevent this by using :samp:`nocall:content/portal_catalog`.
es: :samp:`python:context.portal_catalog` devolverá el catálogo a través de Acquisition. Tenga cuidado si desea usar expresiones de ruta: :samp:`content/portal_catalog` llama al catálogo (y devuelve todos los cerebros). Debe evitar esto usando :samp:`nocall:content/portal_catalog`.

source: Relying on Acquisition is a bad idea. It would be much better to use the helper view ``plone_tools`` from :file:`plone/app/layout/globals/tools.py` to get the catalog.
es: Confiar en la acquisition es una mala idea. Sería mucho mejor utilizar la vista de ayuda ``plone_tools`` de :file:`plone/app/layout/globals/tools.py` para obtener el catálogo.

source: :samp:`context/@@plone_tools/catalog` traverses to the view ``plone_tools`` and calls its method :py:meth:`catalog`. In python it would look like this:
es: :samp:`context/@@plone_tools/catalog` atraviesa la vista ``plone_tools`` y llama a su método :py:meth:`catalog`. En python se vería así:

source: It is not a good practice to query the catalog within a template since even simple logic like this should live in Python. But it is very powerful if you are debugging or need a quick and dirty solution.
es: No es una buena práctica consultar el catálogo dentro de una plantilla, ya que incluso la simple lógica como este debería vivir en Python. Pero es muy poderoso si está depurando o necesita una solución rápida y sucia.

source: In Plone 5 you could even write it like this:
es: En Plone 5 incluso podrías escribirlo así:

source: Register a viewlet 'days_to_conference' in the header. Use a class and a template to display the number of days until the conference.
es: Registre un viewlet 'days_to_conference' en el encabezado. Use una clase y una plantilla para mostrar la cantidad de días hasta la conferencia.

source: You get bonus points if you display it in a nice format (think "In 2 days" and "Last Month") by using either JavaScript or a Python library.
es: Obtendrá puntos de bonificación si lo muestra en un formato agradable (piense en "En 2 días" y "Último mes") utilizando JavaScript o una biblioteca de Python.

source: In :file:`configure.zcml`:
es: En el archivo :file:`configure.zcml`:

source: In :file:`viewlets.py`:
es: En el archivo :file:`viewlets.py`:

source: Setting the date in python is not very user-friendly. In the chapter :ref:`registry-label` you learn how store global configuration and easily create controlpanels.
es: Establecer la fecha en python no es muy fácil de usar. En el capítulo :ref:`registry-label` aprende cómo almacenar la configuración global y crear fácilmente paneles de control.

source: And in :file:`templates/days_to_conference.pt`:
es: Y en el archivo :file:`templates/days_to_conference.pt`:

source: Or using the moment pattern in Plone 5:
es: O usando el patrón moment en Plone 5:

source: A Viewlet for the Votable Behavior
es: Un viewlet para el comportamiento voteable

source: Voting Viewlet
es: Viewlet Voting

source: Write the viewlet template
es: Escribir la plantilla de viewlet

source: Add jQuery include statements
es: Añadir jQuery incluyen declaraciones

source: Saving the vote on the object using annotations
es: Guardando el voto en el objeto usando anotaciones

source: JavaScript inclusion
es: Inclusión de JavaScript

source: Earlier we added the logic that saves votes on the objects. We now create the user interface for it.
es: Anteriormente hemos añadido la lógica que salva los votos en los objetos. Nosotros ahora podemos crear la interfaz de usuario para esto.

source: Since we want to use the UI on more than one page (not only the talk view but also the talk listing) we need to put it somewhere.
es: Como queremos usar la IU en más de una página (no solo la vista de talk sino también la lista de talk) debemos ubicarla en algún lugar.

source: To handle the user input we don't use a form but links and ajax.
es: Para manejar la entrada del usuario no usamos un formulario sino enlaces y ajax.

source: The voting itself is a fact handled by another view
es: La votación en si, es en su efecto manejada por otra vista

source: We extend the file :file:`browser/viewlets.py`
es: Nosotros extendemos en el archivo :file:`browser/viewlets.py`

source: This will add a viewlet to a slot below the title and expect a template :file:`voting_viewlet.pt` in a folder :file:`browser/templates`.
es: Esto añadirá un viewlet a una ranura debajo del título y esperará una plantilla :file:`voting_viewlet.pt` en una carpeta :file:`browser/templates`.

source: Let's create the file :file:`browser/templates/voting_viewlet.pt` without any logic
es: Vamos a añadir el archivo de la plantilla :file:`templates/social_viewlet.pt` sin ninguna lógica

source: restart Plone
es: reiniciar Plone

source: show the viewlet
es: mostrar el viewlet
