Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: The operations for indexing, reindexing and unindexing are queued, optimized and only processed at the end of the transaction. This change can have big performance benefits.
es: Las operaciones de indexación, reindexación y desindexación se ponen en cola, se optimizan y solo se procesan al final de la transacción. Este cambio puede tener grandes beneficios de rendimiento.

source: Actions now have a user-interface in the Plone control panel. You no longer need to use the ZMI to manage them by hand.
es: Los objetos Actions ahora tienen una interfaz de usuario en el panel de control de Plone. Ya no es necesario usar la ZMI para administrarlos a mano.

source: "Retina" Image scales: Plone now has scales for high pixel density images.
es: Escalas de imagen "Retina": Plone ahora tiene escalas para imágenes de alta densidad de píxeles.

source: For a longer list of changes see the `upgrade-guide <https://docs.plone.org/manage/upgrading/version_specific_migration/index.html>`_ (once 5.1 is released).
es: Para obtener una lista más larga de cambios, consulte la `guía de actualización <https://docs.plone.org/manage/upgrading/version_specific_migration/index.html>`_ (una vez que se publique 5.1).

source: Manage Settings with Registry, Controlpanels and Vocabularies
es: Administrar configuraciones con el Registro, Paneles de Control y Vocabularios

source: Store a custom setting in a registry
es: Almacenar una configuración personalizada en un registro

source: Create a controlpanel using z3c.form to allow setting that value
es: Crea un panel de control usando z3c.form para permitir establecer ese valor

source: controlpanels
es: paneles de control

source: The Registry
es: El Registro

source: The registry is used to get and set values stored in records. Each record contains the actual value, as well as a field that describes the record in more detail. It has a nice dict-like API.
es: El registro se usa para obtener y establecer valores almacenados en registros. Cada registro contiene el valor real, así como un campo que describe el registro con más detalle. Tiene un buen diccionario como API.

source: All global settings in Plone 5 are stored in the registry.
es: Todas las configuraciones globales en Plone 5 se almacenan en el registro.

source: The registry itself is provided by `plone.registry <https://pypi.org/project/plone.registry>`_ and the UI to interact with it by `plone.app.registry <https://pypi.org/project/plone.app.registry>`_
es: El registro en si mismo es proveído por `plone.registry <https://pypi.org/project/plone.registry>`_ y la interfaz de usuario - UI para interactuar con eso es `plone.app.registry <https://pypi.org/project/plone.app.registry>`_

source: Almost all settings in ``/plone_control_panel`` are actually stored in the registry and can be modified using its UI directly.
es: La mayoría de todas las configuraciones en ``/plone_control_panel`` son actualmente almacenadas en el registro y puede ser modificada usando directameente esta UI.

source: Open http://localhost:8080/Plone/portal_registry and filter for ``displayed_types``. You see can modify the content types that should be shown in the navigation and site map. The values are the same as in http://localhost:8080/Plone/@@navigation-controlpanel but the later form is customized for usability.
es: Abra http://localhost:8080/Plone/portal_registry y filtro para ``displayed_types``. Verá puede modificar los tipos de contenido que deberían mostrarse en la navegación y en el mapa del sitio. Los valores son los mismos que en http://localhost:8080/Plone/@@navigation-controlpanel pero la forma posterior está personalizada para la usabilidad.

source: A setting
es: Un ajuste

source: Let's store two values in the registry:
es: Guardemos dos valores en el registro:

source: The date of the conference
es: La fecha de la conferencia

source: Is talk submission open or closed
es: Esta la presentación de la charla abierta o cerrada

source: You cannot create values ttw, instead they need to be registered using Generic Setup.
es: No puede crear valores a través de la Web; en su lugar, deben registrarse utilizando la Configuración genérica.

source: Open the file :file:`profiles/default/registry.xml`. You already registered several new settings in there:
es: Abra el archivo :file:`profiles/default/registry.xml`. Ya ha registrado varias configuraciones nuevas allí:

source: You enabled self registration
es: Usted habilito el autoregistro

source: You stored a site-logo
es: Usted almacenó un logotipo del sitio

source: You registered additional criteria useable for Collections
es: Ha registrado criterios adicionales utilizables para Colecciones

source: Adding the following code to :file:`registry.xml`. This creates a new value in the registry upon installation of the package.
es: Añadiendo el siguiente código a :file:`registry.xml`. Este crea un nuevo valor en el registro de instalación del paquete.

source: When creating a new site a lot of settings are created in the same way. See https://github.com/plone/Products.CMFPlone/blob/master/Products/CMFPlone/profiles/dependencies/registry.xml to see how :py:mod:`Products.CMFPlone` registers values.
es: Al crear un nuevo sitio, se crean muchas configuraciones de la misma manera. Consulte https://github.com/plone/Products.CMFPlone/blob/master/Products/CMFPlone/profiles/dependencies/registry.xml para ver cómo el paquete :py:mod:`Products.CMFPlone` registra los valores.

source: Accessing and modifying values in the registry
es: Accediendo y modificando valores en el registro

source: In python you can access the registry like this:
es: En python usted puede acceder al registro de esta forma:

source: :py:mod:`plone.api` holds methods to make this even easier:
es: :py:mod:`plone.api` tiene métodos para hacer esto incluso más fácil:

source: Add a custom controlpanel
es: Añadir un panel de control personalizado

source: When you want to add a custom controlpanel it is usually more convenient to register the fields not manually like above but as field in a schema, similar to a content-types schema.
es: Cuando desee añadir un panel de control personalizado, generalmente es más conveniente registrar los campos no manualmente como en el ejemplo anterior, sino como un campo en un esquema, similar a un esquema de tipos de contenido.

source: For this you define a interface for the schema and a view that auto-generates a form from the schema. In :file:`browser/configure.zcml` add:
es: Para esto usted define una interfaz para el esquema y una vista que auto-generar un formulario desde el esquema. En el archivo :file:`browser/configure.zcml` agregue:

source: Add a file :file:`browser/controlpanel.py`:
es: Añadir un archivo :file:`browser/controlpanel.py`:

source: With this way of using fields you don't have to register the values in :file:`registry.xml`, instead you have to register the interface:
es: Con esta forma de usar los campos, no tiene que registrar los valores en el archivo :file:`registry.xml`, sino que debe registrar la interfaz:

source: After reinstalling the package (to load the registry-entry) you can access the controlpanel at http://localhost:8080/Plone/@@ploneconf-controlpanel.
es: Después de reinstalar el paquete (para cargar la entrada de registro) puede acceder al panel de control en http://localhost:8080/Plone/@@ploneconf-controlpanel.

source: To make it show up in the general controlpanel at http://localhost:8080/Plone/@@overview-controlpanel you have to register it with GenericSetup. Add a file :file:`profiles/default/controlpanel.xml`:
es: Para que aparezca en el panel de control general en http://localhost:8080/Plone/@@overview-controlpanel tienes que registrarlo con GenericSetup. Añada un archivo :file:`profiles/default/controlpanel.xml`:

source: Again, after applying the profile (reinstall the package or write a upgrade-step) your controlpanel shows up in http://localhost:8080/Plone/@@overview-controlpanel.
es: Nuevamente, después de aplicar el perfil (reinstalar el paquete o escribir un paso de actualización) su panel de control aparece en http://localhost:8080/Plone/@@overview-controlpanel.

source: Vocabularies
es: Vocabularios

source: Do you remember the field `rooms`? We provided several options to chose from. But who says that the next conference will have the same rooms? These values should be configurable by the admin. The admin could go to the dexterity-controlpanel and change the values but we will use a different approach. We will allow the rooms to be added in the controlpanel and use these values in the talk-schema by registering a vocabulary.
es: ¿Recuerdas el campo `rooms`? Proporcionamos varias opciones para elegir. ¿Pero quién dice que la próxima conferencia tendrá las mismas salas? Estos valores deben ser configurables por el administrador. El administrador podría ir al panel de control de la dexterity y cambiar los valores, pero utilizaremos un enfoque diferente. Permitiremos que las salas se agreguen en el panel de control y usaremos estos valores en el esquema de objeto talk registrándolos en un vocabulario.

source: Add a new field to :py:class:`IPloneconfControlPanel`:
es: Añada un nuevo campo a la interfaz :py:class:`IPloneconfControlPanel`:

source: Create a file :file:`vocabularies.py` and write the vocabulary:
es: Crear un archivo :file:`vocabularies.py` y escribir el vocabulario:

source: You can now register this vocabulary as a named utility in :file:`configure.zcml` as `ploneconf.site.vocabularies.Rooms`:
es: Usted puede ahora registrar este vocabulario como una utilidad named en el archivo :file:`configure.zcml` como `ploneconf.site.vocabularies.Rooms`:

source: From now on you can use this vocabulary by only referring to its name `ploneconf.site.vocabularies.Rooms`.
es: De ahora en adelante, puedes usar este vocabulario solo haciendo referencia a su nombre `ploneconf.site.vocabularies.Rooms`.

source: Plone comes with many useful vocabularies that you can use in your own projects. See https://github.com/plone/plone.app.vocabularies/ for a list of them.
es: Plone viene con muchos vocabularios útiles que puedes usar en tus propios proyectos. Consulte https://github.com/plone/plone.app.vocabularies/ para obtener una lista de ellos.

source: We turn the values from the registry into a dynamic `SimpleVocabulary` that can be used in the schema.
es: Convertimos los valores del registro en un `SimpleVocabulary` dinámico que se puede usar en el esquema.

source: You could use the context with which the vocabulary is called or the request (using `getRequest` from `from zope.globalrequest import getRequest`) to constrain the values in the vocabulary.
es: Puedes usar el contexto con el que se llama el vocabulario o el request (usando `getRequest` desde `from zope.globalrequest import getRequest`) para restringir los valores en el vocabulario.

source: We use the handy helper-method `safe_simplevocabulary_from_values` to create the vocabulary since the `token` of a `SimpleTerm` in a `SimpleVocabulary` needs to be bytes, not unicode.
es: Usamos el práctico método de ayuda `safe_simplevocabulary_from_values` para crear el vocabulario, ya que el `token` de un `SimpleTerm` en un `SimpleVocabulary` necesita ser bytes, no unicode.

source: You can write your own helper to further control the creation of the vocabulary terms. The `value` is stored on the object, the `token` used to communicate with the widget during editing and `title` is what is displayed in the widget. This example allows you to translate the displayed title while keeping the value stored on the object the same in all languages:
es: Puede escribir su propio helper para controlar aún más la creación de los términos del vocabulario. El `value` se almacena en el objeto, el `token` utilizado para comunicarse con el widget durante la edición y `title` es lo que se muestra en el widget. Este ejemplo le permite traducir el título mostrado manteniendo el valor almacenado en el objeto igual en todos los idiomas:

source: Use the new vocabulary in the talk-schema. Edit :file:`content/talk.xml`
es: Use el nuevo vocabulario en el esquema de conversación. Editar el archivo :file:`content/talk.xml`

source: In a python-schema that would look like this:
es: En un esquema python que se vería así:

source: A admin can now configure the rooms available for the conference.
es: Un administrador ahora puede configurar las salas disponibles para la conferencia.

source: We could use the same pattern for the fields `type_of_talk` and `audience`.
es: Podríamos usar el mismo patrón para los campos `type_of_talk` y `audience`.

source: Relations
es: Relaciones

source: You can model relationships between content items by placing them in a hierarchy (a folder *speakers* containing the (folderish) speakers and within each speaker the talks) or by linking them to each other in Richtext-Fields. But where would you store a talk that two speakers give together?
es: Puede modelar las relaciones entre elementos de contenido colocándolos en una jerarquía (una carpeta *speakers* que contiene los speakers (de carpeta) y dentro de cada speakers las talks) o uniéndolos entre sí en los campos de texto enriquecido. Pero, ¿dónde almacenarías una charla que dos speakers dan juntos?

source: Relations allow developers to model relationships between objects without a links or a hierarchy. The behavior :py:class:`plone.app.relationfield.behavior.IRelatedItems` provides the field :guilabel:`Related Items` in the tab :guilabel:`Categorization`. That field simply says ``a`` is somehow related to ``b``.
es: Las relaciones permiten a los desarrolladores modelar relaciones entre objetos sin un enlace o una jerarquía. El comportamiento :py:class:`plone.app.relationfield.behavior.IRelatedItems` proporciona el campo :guilabel:`Related Items` en la pestaña :guilabel:`Categorization`. Ese campo simplemente dice ``a`` de alguna manera está relacionado con ``b``.

source: By using custom relations you can model your data in a much more meaningful way.
es: Mediante el uso de relaciones personalizadas puede modelar sus datos de una manera mucho más significativa.

source: Creating relations in a schema
es: Creando relaciones en un esquema

source: Relate to one item only.
es: Relacionar con un solo elemento.

source: Relate to multiple items.
es: Relacionar con miltiples elementos.

source: We can see that the `code for the behavior IRelatedItems <https://github.com/plone/plone.app.relationfield/blob/master/plone/app/relationfield/behavior.py>`_ does exactly the same.
es: Podemos ver que el `código para el comportamiento IRelatedItems <https://github.com/plone/plone.app.relationfield/blob/master/plone/app/relationfield/behavior.py>`_ hace exactamente lo mismo.

source: Instead of using a named vocabulary we can also use ``source``:
es: En lugar de usar un vocabulario nombrado también podemos usar ``source``:

source: To ``CatalogSource`` you can pass the same argument that you use for catalog-queries. This makes it very flexible to limit relateable items by type, path, date etc.
es: Para ``CatalogSource`` puedes pasar el mismo argumento que usas para consultas de catálogo. Esto lo hace muy flexible para limitar elementos relacionados por tipo, ruta, fecha, etc.

source: For even more flexibility you can create your own `dynamic vocabularies <https://docs.plone.org/external/plone.app.dexterity/docs/advanced/vocabularies.html#dynamic-sources>`_.
es: Para una mayor flexibilidad, puedes crear tus propios `vocabularios dinámicos <https://docs.plone.org/external/plone.app.dexterity/docs/advanced/vocabularies.html#dynamic-sources>`_.

source: Accessing and displaying related items
es: Accediendo y exhibiendo elementos relacionados

source: One would think that it would be the easiest approach to simply use the render-method of the default-widget like we did in the chapter "Views II: A Default View for 'Talk'". Sadly that is wrong. Adding the approriate code to te template:
es: Uno pensaría que sería el enfoque más fácil para simplificar el usar el método de representación del widget por defecto como lo hicimos en el capítulo "Views - Parte II: Una vista por defecto para 'Talk'". Lamentablemente eso está mal. Entonces hay que añadir el código apropiado a la plantilla:

source: would only render the UIDs of the related items:
es: solo mostraría los UIDs de los elementos relacionados:

source: This is not very useful but anyway it is very likely that you want to control closely how to render these items.
es: Esto no es muy útil, pero de todos modos es muy probable que desee controlar de cerca cómo renderizar estos elementos.

source: So we add a method to the view to return the related items so that we're able to render anyway we like.
es: Así que añadimos un método a la vista para devolver los elementos relacionados, de modo que podamos representar de todos modos lo que nos gusta.

source: We use :py:meth:`rel.to_path` and use the items path to query the catalog for its catalog-entry. This is much more efficient than using :py:meth:`rel.to_object` since we don't have to wake up any objects. Setting ``depth`` to ``0`` will only return items with exactly this path, so it will always return a list with one item.
es: Nosotros usamos :py:meth:`rel.to_path` y también usamos la ruta de elementos para consultar el catálogo para su entrada de catálogo. Esto es mucho más eficiente que usar :py:meth:`rel.to_object` ya que no tenemos que despertar ningún objeto. Configurando ``depth`` a ``0`` solo devolverá elementos con exactamente esta ruta, por lo que siempre devolverá una lista con un elemento.

source: Using the path sounds a little complicated and it would indeed be more convenient if a :py:class:`RelationItem` would contain the ``UID`` (so we can query the catalog for that) or if the ``portal_catalog`` would index the ``IntId``. But that's the way it is for now.
es: Usando la ruta suena un poco más complicado y de hecho sería más conveniente si :py:class:`RelationItem` podría contener el ``UID`` (para que podamos consultar el catálogo para ese) o si el ``portal_catalog`` podría indexar el ``IntId``. Pero eso es la forma por ahora.

source: For reference look at how the default viewlet displays the information for related items stored by the behavior :py:class:`IRelatedItems`. See how it does exactly the same in ``related2brains``. This is the Python-path for the viewlet: :py:class:`plone.app.layout.viewlets.content.ContentRelatedItems` This is the file-path for the template: :file:`plone/app/layout/viewlets/document_relateditems.pt`
es: Para referencia, observe cómo el viewlet por defecto muestra la información para los elementos relacionados almacenados por el comportamiento :py:class:`IRelatedItems`. Vea cómo hace exactamente lo mismo en ``related2brains``. Esta es la ruta de Python para el viewlet: :py:class:`plone.app.layout.viewlets.content.ContentRelatedItems`. Esta es la ruta de archivo para la plantilla: :file:`plone/app/layout/viewlets/document_relateditems.pt`

source: Creating Relationfields through the web
es: Creando campos de relación a través de la web

source: It is surprisingly easy to create RelationFields through the web
es: Es sorprendentemente fácil crear RelationFields a través de la web

source: In the dexterity schema-editor add a new field and select *Relation List* or *Relation Choice*, depending on wether you want to relate to multiple items or not.
es: En el editor de esquemas de dexterity, añada un nuevo campo y seleccione *Lista de relaciones* o *Seleccione relación*, dependiendo de si desea relacionarse con varios elementos o no.

source: When configuring the field you can even select the content-type the relation should be limited to.
es: Al configurar el campo, incluso puede seleccionar el tipo de contenido al que debe estar limitada la relación.

source: When you click on ``Edit xml field model`` you will see the fields in the xml-schema:
es: Al hacer clic en ``Editar modelo de campo xml``, verá los campos en el esquema xml:

source: The stack
es: El stack

source: Relations are based on `zc.relation <https://pypi.org/project/zc.relation/>`_. This package allows to store transitive and intransitive relationships. It allows for complex relationships and searches along them. Because of this functionality, the package is a bit complicated.
es: Las relaciones se basan en el paquete `zc.relation <https://pypi.org/project/zc.relation/>`_. Este paquete permite almacenar relaciones transitivas e intransitivas. Permite relaciones complejas y búsquedas a lo largo de ellos. Debido a esta funcionalidad, el paquete es un poco complicado.

source: The package `zc.relation` provides its own catalog, a relation catalog. This is a storage optimized for the queries needed. `zc.relation` is sort of an outlier with regards to zope documentation. It has extensive documentation, with a good level of doctests for explaining things.
es: El paquete `zc.relation` proporciona su propio catálogo, un catálogo de relaciones. Este es un almacenamiento optimizado para las consultas necesarias. `zc.relation` es una especie de outlier con respecto a la documentación de zope. Tiene una documentación extensa, con un buen nivel de doctests para explicar cosas.

source: You can use `zc.relation` to store the objects and its relations directly into the catalog. But the additional packages that make up the relation functionality don't use the catalog this way.
es: Usted puede usar `zc.relation` para almacenar los objetos y sus relaciones directamente en el catálogo. Pero los paquetes adicionales que componen la funcionalidad de relación no usan el catálogo de esta manera.

source: We want to work with schemas to get auto generated forms. The logic for this is provided by the package `z3c.relationfield <https://pypi.org/project/z3c.relationfield/>`_. This package contains the RelationValue object and everything needed to define a relation schema, and all the code that is necessary to automatically update the catalog.
es: Nosotros queremos trabajar con esquemas para obtener formularios generados automáticamente. La lógica para esto viene dada por el paquete `z3c.relationfield <https://pypi.org/project/z3c.relationfield/>`_. Este paquete contiene el objeto RelationValue y todo lo que se necesita para definir un esquema de relación y todos el código que es necesario para actualizar automáticamente el catálogo.

source: A RelationValue Object does not reference all objects directly. For the target, it uses an id it gets from the `IntId` Utility. This id allows direct recovery of the object. The source object stores it directly.
es: Un objeto RelationValue no hace referencia a todos los objetos directamente. Para el objeto destino, utiliza un id que obtiene de la utilidad `IntId`. Este id le permite la recuperación directa del objeto.

source: Widgets are provided by `plone.app.z3cform` and some converters are provided by `plone.app.relationfield`. The widget that Plone uses can also store objects directly. Because of this, the following happens when saving a relation via a form:
es: Los widgets son proporcionados por el paquete `plone.app.z3cform` y algunos convertidores son proporcionados por el paquete `plone.app.relationfield`. El widget que utiliza Plone también puede almacenar objetos directamente. Debido a esto, sucede lo siguiente al guardar una relación a través de un formulario:

source: The html shows some nice representation of selectable objects.
es: El html muestra una buena representación de objetos seleccionables.

source: When the user submits the form, selected items are submitted by their UUIDs.
es: Cuando el usuario envía el formulario, los elementos seleccionados son enviados por sus UUIDs.
