Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Writing the Viewlet code
es: Escribiendo el código fuente del Viewlet

source: Now that we have the everything in place, we can add the Logic
es: Ahora que tenemos todo en su lugar, podemos añadir la Lógica

source: Update the viewlet to contain the necessary logic in :file:`browser/viewlets`
es: Actualizar en la clase viewlet que contiene la lógica necesaria en el archivo :file:`browser/viewlets`

source: And extend the template in :file:`browser/templates/voting_viewlet.pt`
es: Y extiende la plantilla en el archivo :file:`browser/templates/voting_viewlet.pt`

source: We have many small parts, most of which will be hidden by JavaScript unless needed. By providing all this status information in HTML, we can use standard translation tools to translate.
es: Tenemos muchas piezas pequeñas, la mayoría de las cuales estarán ocultas por JavaScript a menos que sea necesario. Al proporcionar toda esta información de estado en HTML, podemos usar herramientas de traducción estándar para traducir.

source: Translating strings in JavaScript requires extra work.
es: Traducir cadenas en JavaScript requiere trabajo adicional.

source: We need some css that we store in :file:`static/starzel_votablebehavior.css`
es: Nosotros necesitamos algún css que nosotros almacenamos en el archivo :file:`static/starzel_votablebehavior.css`

source: JavaScript code
es: Código JavaScript

source: To make it work in the browser, some JavaScript :file:`static/starzel_votablebehavior.js`
es: Para que funcione en el navegador, algunos javascript en el archivo :file:`static/starzel_votablebehavior.js`

source: This js code adheres to crockfort jshint rules, so all variables are declared at the beginning of the method. We show and hide quite a few small HTML elements here.
es: Este código js se adhiere a las reglas de crockfort jshint, por lo que todas las variables se declaran al comienzo del método. Mostramos y escondemos bastantes pequeños elementos HTML aquí.

source: Writing 2 simple view helpers
es: Escribiendo 2 ejemplo de view helpers

source: Our JavaScript code communicates with our site by calling views that don't exist yet. These Views do not need to render HTML, but should return a valid status. Exceptions set the right status and aren't being shown by JavaScript, so this will suit us fine.
es: Nuestro código JavaScript se comunica con nuestro sitio llamando a las vistas que aún no existen. Estas vistas no necesitan mostrar código HTML, pero deben devolver un estatus válido. Las excepciones establecen el estado correcto y no están siendo mostradas por JavaScript, por lo que nos conviene bien.

source: As you might remember, the :samp:`vote` method might return an exception, if somebody votes twice. We do not catch this exception. The user will never see this exception.
es: Como puede recordar, el método :samp:`vote` puede devolver una excepción, si alguien vota dos veces. No capturamos esta excepción. El usuario nunca verá esta excepción.

source: Catching exceptions contain a gotcha for new developers.
es: La captura de excepciones contiene un comportamiento contra-intuitivo para los nuevos desarrolladores.

source: Zope claims some exceptions for itself. It needs them to work correctly.
es: Zope reclama algunas excepciones por sí mismo. Los necesita para que funcionen correctamente.

source: For example, if two requests try to modify something at the same time, one request will throw an exception, a :samp:`ConflictError`.
es: Por ejemplo, si dos solicitudes intentan modificar algo al mismo tiempo, una solicitud lanzará una excepción, a :samp:`ConflictError`.

source: Zope catches the exception, waits for a random amount of time, and tries to process the request again, up to three times. If you catch that exception, you are in trouble, so don't do that. Ever.
es: Zope captura la excepción, espera una cantidad de tiempo aleatoria e intenta procesar la solicitud nuevamente, hasta tres veces. Si capturas esa excepción, estás en problemas, así que no lo hagas. Nunca.

source: As so often, we must extend :file:`browser/configure.zcml`:
es: Como tantas veces, debemos extender en el archivo :file:`browser/configure.zcml`:

source: Then we add our simple views into the file :file:`browser/vote.py`
es: A continuación, añadimos nuestras vistas simples en el archivo :file:`browser/vote.py`

source: A lot of moving parts have been created. Here is a small overview:
es: Se han creado muchas partes móviles. Aquí hay un pequeño resumen:

source: Views I
es: Views - Parte I

source: Register a view that can be opened in the browser
es: Registrar una vista que puede ser abierta en el navegador

source: Create and use a template for the view
es: Crear y usar una plantilla para la vista

source: A simple browser view
es: Una simple browser view

source: Before writing the talk view itself we step back and talk *a little* about views and templates.
es: Antes de escribir la vista de tipo de contenido talk en sí, retrocedemos y hablamos *un poco* sobre las vistas y las plantillas.

source: A view in Plone is usually a :py:class:`BrowserView`. It can hold a lot of cool python code but we will first focus on the template.
es: Una vista en Plone suele ser un ``BrowserView``. Puede contener mucho código de python, pero primero nos centraremos en la plantilla.

source: Edit the file ``browser/configure.zcml`` and register a new view called *training*:
es: Edite el archivo ``browser/configure.zcml`` y registre una nueva vista llamada *training*:

source: Add a file ``browser/templates/training.pt``
es: Añada un archivo ``browser/templates/training.pt``

source: Restart Plone and open http://localhost:8080/Plone/@@training.
es: Reiniciar Plone y abra en la dirección http://localhost:8080/Plone/@@training.

source: You should now see "Hello World".
es: Usted deberia ver "Hello World".

source: You now have everything in place to learn about page templates.
es: Ahora tenemos todo en su lugar para aprender sobre las page templates.

source: The view ``training`` has no python class registered for it but only a template. It acts as if it had an empty python class inheriting from ``Products.Five.browser.BrowserView`` but the way that happens is actually quite a bit of magic...
es: La vista ``training`` no tiene ninguna clase python registrada para ella pero sólo una plantilla. Actúa como si tuviera una clase vacía python heredando de ``Products.Five.browser.BrowserView``, pero la forma en que sucede es realmente es un poco de magia...

source: Views II: A Default View for "Talk"
es: Views - Parte II: Una vista por defecto para la "charla"

source: Register a view with a python class
es: Registrar una vista con una clase python

source: Write a template used in the default view for talks
es: Escribir una plantilla usada en la vista por defecto para el tipo de contenido talks

source: View classes
es: Vista de clases

source: BrowserView and DefaultView
es: BrowserView y DefaultView

source: displaying data from fields
es: mostrando data desde campos

source: View Classes
es: Vista de clases

source: Earlier we wrote a demo view which we also used to experiment with page templates. Now we are going to enhance that view so that it will have some python code, in addition to a template. Let us have a look at the ZCML and the code.
es: Anteriormente, escribimos una vista de demostración que también usamos para experimentar con plantillas de página. Ahora vamos a mejorar esa vista para que tenga algún código python, además de una plantilla. Echemos un vistazo a la ZCML y el código.

source: ``browser/configure.zcml``
es: El archivo ``browser/configure.zcml``

source: We are adding a file called :file:`views.py` in the :file:`browser` folder.
es: Estamos añadiendo un archivo llamado :file:`views.py` en la carpeta :file:`browser`.

source: :file:`browser/views.py`
es: El archivo :file:`browser/views.py`

source: In the template :file:`training.pt` we can now use this view as `view` and access all its methods and properties:
es: En la plantilla :file:`training.pt` ahora podemos usar esta vista como `view` y acceder a todos sus métodos y propiedades:

source: The logic contained in the template can now be moved to the class:
es: La lógica contenida en la plantilla ahora se puede mover a la clase:

source: And the template will now be much simpler.
es: Y la plantilla ahora será mucho más simple.

source: The default view
es: La vista predeterminada

source: Now you know everything to create a nice view for talks in :file:`views.py`.
es: Ahora sabes todo para crear una buena vista para las talks en el archivo :file:`views.py`.

source: First we will not write any methods for `view` but access the fields from the talk-schema as `context.<fieldname>`.
es: Primero no escribiremos ningún método para `view` pero acceda a los campos desde el esquema talk como `context.<fieldname>`.

source: Register a view `talkview` in :file:`browser/configure.zcml`:
es: Registrar una view `talkview` en el archivo :file:`browser/configure.zcml`:

source: Add the template :file:`templates/talkview.pt`:
es: Añadir la plantilla :file:`templates/talkview.pt`:

source: After a restart, we can test our view by going to a talk and adding */talkview* to the url.
es: Después de reiniciar, podemos probar nuestra vista yendo a una charla y añadiendo */talkview* a la url.

source: Using helper-methods from :py:class:`DefaultView`
es: Usando métodos auxiliares desde :py:class:`DefaultView`

source: In the previous section we used :py:class:`BrowserView` as the base-class for :py:class:`TalkView`.
es: En la sección anterior utilizamos :py:class:`BrowserView` como la clase base para :py:class:`TalkView`.

source: Dexterity comes with a nice helper-class suited for views of content-types: The :py:class:`DefaultView` base class in :py:mod:`plone.dexterity`. It has some very useful properties available to use in the template:
es: Dexterity viene con una buena clase auxiliar adecuada para vistas de tipos de contenido: La clase base :py:class:`DefaultView` en el módulo :py:mod:`plone.dexterity`. Tiene algunas propiedades muy útiles disponibles para usar en la plantilla:

source: :py:attr:`view.w` is a dictionary of all the display widgets, keyed by field names. This includes widgets from alternative fieldsets.
es: :py:attr:`view.w` es un diccionario de todos los widgets de visualización, codificados por nombres de campo. Esto incluye widgets de conjuntos de campos alternativos.

source: :py:attr:`view.widgets` contains a list of widgets in schema order for the default fieldset.
es: :py:attr:`view.widgets` contiene una lista de widgets en orden de esquema para el conjunto de campos predeterminado.

source: :py:attr:`view.groups` contains a list of fieldsets in fieldset order.
es: :py:attr:`view.groups` contiene una lista de conjuntos de campos en orden de conjunto de campos.

source: :py:attr:`view.fieldsets` contains a dict mapping fieldset name to fieldset
es: :py:attr:`view.fieldsets` contiene un nombre de conjunto de campos de mapeo del diccionario al conjunto de campos

source: On a fieldset (group), you can access a widget list to get widgets in that fieldset
es: En un fieldset (group), puede acceder a una lista de widgets para obtener widgets en ese fieldset

source: You can now change the :py:class:`TalkView` to use it
es: Ahora puede cambiar el :py:class:`TalkView` para usarlo

source: The template :file:`templates/talkview.pt` still works but now you can modify it to use the pattern :samp:`view/w/<fieldname>/render` to render the widgets:
es: La plantilla :file:`templates/talkview.pt` todavía funciona pero ahora puedes modificarlo para usar el patrón :samp:`view/w/<fieldname>/render` para renderizar los widgets:

source: After a restart, we can test the modified view by going to a talk and adding */talkview* to the url.
es: Después de reiniciar, podemos probar la vista modificada yendo a una charla y añadiendo */talkview* a la url.

source: We should tell Plone that the talkview should be used as the default view for talks instead of the built-in view.
es: Esta es una configuración que puede cambiar en tiempo de ejecución y se almacena en la base de datos, como tal, también es gestionado por perfiles GenericSetup.

source: This is a configuration that you can change during runtime and is stored in the database, as such it is also managed by GenericSetup profiles.
es: Esta es una configuración que puede cambiar en tiempo de ejecución y se almacena en la base de datos, como tal, también es gestionado por perfiles GenericSetup.

source: open :file:`profiles/default/types/talk.xml`:
es: abra el archivo :file:`profiles/default/types/talk.xml`:

source: We will have to either reinstall our add-on or run the GenericSetup import step ``typeinfo`` so Plone learns about the change.
es: Tendremos que reinstalar nuestro complemento o ejecutar el paso de importación de GenericSetup ``typeinfo`` entonces Plone se entera del cambio.

source: To change it ttw go to the ZMI (http://localhost:8080/Plone/manage), go to ``portal_types`` and select the type for which the new view should be selectable (*talk*).
es: Para cambiar a través de la Web valla a la ZMI (http://localhost:8080/Plone/manage), luego valla a ``portal_types`` y seleccione el tipo para el cual la nueva vista debería ser seleccionable (tipo de contenido *talk*).

source: Now add ``talkview`` to the list *Available view methods*. Now the new view is available in the menu *Display*. To make it the default view enter it in ``Default view method``.
es: Ahora añada ``talkview`` a la lista *Available view methods*. Ahora la nueva vista está disponible en el menú *Mostrar*. Para que sea la vista predeterminada, ingrésela en ``Default view method``.

source: Now you can improve the talkview to show all the info:
es: Ahora puedes mejorar la talkview para mostrar toda la información:

source: :file:`templates/talkview.pt`:
es: El archivo :file:`templates/talkview.pt`:

source: Add the new choice field "room" to the Talk type (TTW) and display it below Audience in the browser view, it should contain the following data:
es: Añada el nuevo campo de selección "room" al tipo de Talk (A través de la Web) y muéstrelo debajo de Audiencia en la browser view, debe contener los siguientes datos:

source: Title: Room
es: Título: Room

source: Possible values: Room 101, Room 102, Auditorium
es: Posible valores: Room 101, Room 102, Auditorium

source: Go to http://localhost:8080/Plone/dexterity-types/talk/@@fields and add the new field
es: Valla a http://localhost:8080/Plone/dexterity-types/talk/@@fields y añada el nuevo campo

source: Add the new HTML below the audience part:
es: Añadir el nuevo HTML siguiente en la parte de audiencia:

source: Behind the scenes
es: De tras bambalinas

source: Do you remember the term :py:class:`MultiAdapter`?
es: ¿Recuerdas el término :py:class:`MultiAdapter`?

source: The browser page is just a MultiAdapter. The ZCML statement :samp:`browser:page` registers a :py:class:`MultiAdapter` and adds additional things needed for a browser view.
es: La browser page es solo un MultiAdapter. La instrucción ZCML :samp:`browser:page` registra una clase :py:class:`MultiAdapter` y añada cosas adicionales necesarias para una browser view.

source: An adapter adapts things, a :py:class:`MultiAdapter` adapts multiple things.
es: Un adaptador adapta cosas, a :py:class:`MultiAdapter` adapta múltiples cosas.

source: When you enter a URL, Zope tries to find an object for it. At the end, when Zope does not find any more objects but there is still a path item left, or there are no more path items, Zope looks for an adapter that will reply to the request.
es: Cuando ingresa una dirección URL, Zope intenta encontrar un objeto para ella. Al final, cuando Zope no encuentra más objetos pero aún le queda un elemento de ruta, o no hay más elementos de ruta, Zope busca un adaptador que responda a la solicitud.

source: The adapter adapts the request and the object that Zope found with the URL. The adapter class gets instantiated with the objects to be adapted, then it gets called.
es: El adaptador se adapta la solicitud y el objeto que Zope ha encontrado con la dirección URL. La clase de adaptador se crea instanciada con los objetos que han de adaptarse, entonces se llama.

source: The code above does the same thing that the standard implementation would do. It makes :py:attr:`context` and :py:attr:`request` available as variables on the object.
es: El código anterior hace lo mismo que la implementación estándar. Hace :py:attr:`context` y :py:attr:`request` disponibles como variables en el objeto.

source: I have written down these methods because it is important to understand some important concepts.
es: He escrito estos métodos porque es importante entender algunos conceptos importantes.

source: The :py:meth:`__init__` method gets called while Zope is still *trying* to find a view. At that phase, the security has not been resolved. Your code is not security checked.
es: El método :py:meth:`__init__` llama mientras Zope aún *intenta* encontrar una vista. En esa fase, la seguridad no se ha resuelto. Su código no está verificado de seguridad.

source: For historical reasons, many errors that happen in the :py:meth:`__init__` method can result in a page not found error instead of an exception.
es: Por razones históricas, muchos errores que ocurren en el método :py:meth:`__init__` pueden dar como resultado un error de página no encontrada en lugar de una excepción.

source: Use the :py:meth:`__init__` method to do as little as possible, if at all. Instead, you have the guarantee that the :py:meth:`__call__` method is called before anything else (but after the :py:meth:`__init__` method).
es: Use el método :py:meth:`__init__` para hacer lo menos posible, si es que lo hace. En cambio, usted tiene la garantía de que el método :py:meth:`__call__` se llame antes que cualquier otra cosa (pero después del método :py:meth:`__init__`).

source: It has the security checks in place and so on.
es: Tiene los controles de seguridad en su lugar y así sucesivamente.

source: From a practical standpoint, consider the :py:meth:`__call__` method your :py:meth:`__init__` method, the biggest difference is that this method is supposed to return the HTML already.
es: Desde un punto de vista práctico, considere el método :py:meth:`__call__` en su método :py:meth:`__init__`, la mayor diferencia es que se supone que este método ya devuelve el código HTML.

source: Let your base class handle the HTML generation.
es: Deje que su clase base maneje la generación de HTML.

source: Views III: A Talk List
es: Views - Parte III: Una lista de Charlas

source: Write a python class to get all talks from the catalog
es: Escribe una clase python para obtener todas las charlas del catálogo

source: Write a template to display the talks
es: Escribe una plantilla para mostrar las talks

source: Improve the table
es: Mejora la tabla

source: brains and objects
es: cerebros y objetos

source: Now we don't want to provide information about one specific item but on several items. What now? We can't look at several items at the same time as context.
es: Ahora no queremos proporcionar información sobre un elemento específico, sino en varios elementos. ¿Y ahora qué? No podemos mirar a varios elementos al mismo tiempo que el contexto.

source: Using portal_catalog
es: Usando portal_catalog

source: Let's say we want to show a list of all the talks that were submitted for our conference. We can just go to the folder and select a display method that suits us. But none does because we want to show the target audience in our listing.
es: Digamos que queremos mostrar una lista de todas las charlas que se enviaron para nuestra conferencia. Podemos ir a la carpeta y seleccionar un método de visualización que nos convenga. Pero ninguno lo hace porque queremos mostrar al público objetivo en nuestra lista.

source: So we need to get all the talks. For this we use the python class of the view to query the catalog for the talks.
es: Entonces tenemos que tener todas las charlas. Para esto usamos la clase python de la vista para consultar el catálogo de las charlas.

source: The catalog is like a search engine for the content on our site. It holds information about all the objects as well as some of their attributes like title, description, workflow_state, keywords that they were tagged with, author, content_type, its path in the site etc. But it does not hold the content of "heavy" fields like images or files, richtext fields and fields that we just defined ourselves.
es: El catálogo es como un motor de búsqueda para el contenido de nuestro sitio. Contiene información sobre todos los objetos, así como algunos de sus atributos como título, descripción, workflow_state, palabras clave con las que fueron etiquetados, author, content_type, su ruta en el sitio, etc. Pero no contiene el contenido de "heavy" campos como imágenes o archivos, campos de texto enriquecido y campos que acabamos de definir.

source: It is the fast way to get content that exists in the site and do something with it. From the results of the catalog we can get the objects themselves but often we don't need them, but only the properties that the results already have.
es: Es la forma más rápida de obtener el contenido que existe en el sitio y hacer algo con él. A partir de los resultados del catálogo podemos conseguir los mismos objetos, pero a menudo no lo necesita, pero sólo las propiedades que los resultados ya tienen.

source: ``browser/views.py``
es: El archivo ``browser/views.py``

source: We query the catalog with two parameters. The catalog returns only items for which **both** apply:
es: Consultamos el catálogo con dos parámetros. El catálogo devuelve solo los elementos para los cuales **ambos** se aplican:

source: We pass a object as `context` to query only for content in the current path. Otherwise we'd get all talks in the whole site. If we moved some talks to a different part of the site (e.g. a sub-conference for universities with a special talk list) we might not want so see them in our listing. We also query for the `portal_type` so we only find talks.
es: Pasamos un objeto como `context` para consultar solo el contenido en la ruta actual. De lo contrario, obtendríamos todas las charlas en todo el sitio. Si trasladamos algunas charlas a una parte diferente del sitio (por ejemplo, una subconferencia para universidades con una lista de charla especial), es posible que no deseemos verlas en nuestra lista. También consultamos por `portal_type` para que solo encontremos charlas.

source: We use the method :py:meth:`find` in :py:mod:`plone.api` to query the catalog. It is one of many convenience-methods provided as a wrapper around otherwise more complex api's. If you query the catalog directly you'd have to first get the catalog, and pass it the path for which you want to find items:
es: Usamos el método :py:meth:`find` en :py:mod:`plone.api` para consultar el catálogo. Es uno de los muchos métodos de conveniencia proporcionados como un envoltorio alrededor de aplicaciones que de otro modo serían más complejas. Si consulta el catálogo directamente, primero debe obtener el catálogo y pasarle la ruta para la que desea buscar elementos:

source: We iterate over the list of results that the catalog returns us.
es: Nosotros iteramos sobre la lista de resultados que el catálogo nos devuelve.

source: We create a dictionary that holds all the information we want to show in the template. This way we don't have to put any complex logic into the template.
es: Creamos un diccionario que contiene toda la información que queremos mostrar en la plantilla. De esta manera no tiene que poner ninguna lógica compleja en la plantilla.
