Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Some parts of Buildout interpret egg names case sensitively, others don't. This can result in funny problems.
es: Algunas partes de Buildout interpretan nombres de paquete egg entre mayúsculas y minúsculas, otros no. Esto puede dar lugar a problemas de divertidos.

source: Always check out the ordering of your extends, always use the :samp:`annotate` command of Buildout to see if it interprets your configuration differently than you. Restrict yourself to simple Buildout files. You can reference variables from other sections, you can even use a whole section as a template. We learned that this does not work well with complex hierarchies and had to abandon that feature.
es: Verifique siempre el orden de su configuraciones extendidas, utilice siempre el comando :samp:`annotate` de Buildout para ver si se interpreta la configuración diferente a la que usted definió. Restringirse a los archivos de despliegue simples. Puede hacer referencia a variables de otras secciones, incluso se puede utilizar toda una sección como plantilla. Hemos aprendido que esto no funciona bien con jerarquías complejas y se tuvo que abandonar esa característica.

source: In the chapter :doc:`deployment_sites` we will have a look at a production-ready buildout for Plone that has many useful features.
es: En el capítulo :doc:`deployment_sites` veremos una configuración de despliegue lista para entornos de producción de Plone que tiene muchas características útiles.

source: Buildout-Documentation
es: Documentación de Buildout

source: Troubleshooting
es: Solución de problemas

source: A minimal buildout for Plone 5
es: Un buildout mínimo para Plone 5

source: A minimal buildout for Plone 4
es: Un buildout mínimo para Plone 4

source: The buildout of the unified installer has some valuable documentation as inline-comment
es: El archivo buildout del instalador unificado tiene documentación valiosa como comentarios entre linea

source: The Case Study
es: El caso de estudio

source: For this training we will build a website for a fictional Plone conference.
es: Para este entrenamiento construiremos un Sitio Web para una conferencia ficticia de Plone.

source: Background
es: Detalle

source: The Plone conference takes place every year and all Plone developers at least try to go there.
es: La conferencia de Plone toma lugar cada año y todos los desarrolladores al menos intentan ir.

source: Requirements
es: Requerimientos

source: Here are some requirements that we want to meet when the site is done:
es: Aquí hay algunos requisitos que queremos cumplir cuando el sitio esté listo:

source: As a visitor I want to find current information on the conference.
es: Como un visitante del sitio, yo quiero encontrar información actualizada en la conferencia.

source: As a visitor I want to register for the conference.
es: Como un visitante del sitio, yo quiero registrarme para la conferencia.

source: As a visitor I want to see the talks and sort them by my preferences.
es: Como un visitante del sitio, yo quiero ver las charlas y ordenarlas por mis preferencias.

source: As a speaker I want to be able to submit talks.
es: Como un ponente prospecto, yo quiero ser capaz de enviar charlas.

source: As a speaker I want to see and edit my submitted talks.
es: Como un ponente prospecto, yo quiero ver y editar mis charlas enviadas.

source: As an organizer I want to see a list of all proposed talks.
es: Como un organizador de la conferencia, yo quiero ver una lista de todas las charlas propuestas.

source: As an organizer I want to have an overview about how many people registered.
es: Como un organizador de la conferencia, yo quiero tener un resumen acerca de cuantas personas están registradas.

source: As a jury member I want to vote on talks.
es: Como un miembro del jurado de la conferencia, yo quiero votar por las charlas enviadas.

source: As a jury member I want to decide which talks to accept, and which not.
es: Como un miembro del jurado de la conferencia, yo quiero decidir, cuales charlas aceptar, y cuales no.

source: Note that all of our requirements connect roles with capabilities. This is important because we'll want to limit the capabilities to those to whom we assign particular roles.
es: Tenga en cuenta que todos nuestros requisitos conecta los roles con sus capacidades. Esto es importante porque vamos a querer limitar las capacidades de aquellos a los que asignamos roles particulares.

source: Using the code for the training
es: Usando el código para un entrenamiento

source: You can get the complete code for this training from `GitHub <https://github.com/collective/ploneconf.site>`_.
es: Puede obtener el código completo de este entrenamiento en `GitHub <https://github.com/collective/ploneconf.site>`_.

source: The code-package
es: El código fuente de paquete

source: The package
es: El paquete

source: If you want to do it by hand do the following:
es: Si quieres hacerlo a mano haz lo siguiente:

source: Getting the code for a certain chapter
es: Para obtener el código para cierto capítulo

source: To use the code for a certain chapter you need to checkout the appropriate tag for the chapter. The package will then contain the complete code for that chapter (excluding exercises).
es: Para usar el código para cierto capítulo usted necesita hacer checkout del apropiado tag para el capítulo. El paquete entonces contendrán el código completo para ese capítulo (excluyendo ejercicios).

source: If you want to add the code for the chapter yourself you have to checkout the tag for the previous chapter.
es: Si usted quiere añadir el código para el capítulo usted mismo tiene que hacer checkout a la tag de git para el capítulo previo.

source: Here is a example:
es: Aquí hay un ejemplo:

source: The names of the tags are the same as the URL of the chapter. The tag for the chapter https://training.plone.org/5/mastering-plone/registry.html is ``registry`` and you can get it with :command:`git checkout registry`.
es: El nombre de las tags son el mismo como la dirección URL del capítulo. El nombre del tag para el capítulo https://training.plone.org/5/mastering-plone/registry.html es ``registry`` y usted puede obtenerla ejecutando el comando :command:`git checkout registry`.

source: Moving from chapter to chapter
es: Pasar de un capítulo a otro capítulo

source: To change the code to the state of the next chapter checkout the tag for the next chapter:
es: Para cambiar el código al estado del próximo capítulo, revise la etiqueta para el próximo capítulo:

source: If you made any changes to the code you have to get them out of the way first:
es: Si realizó algún cambio en el código, primero debe sacarlos del camino:

source: This will stash away your changes but not delete them. You can get them back later. You should learn about the command :command:`git stash` before you try reapply stashed changes.
es: Esto almacenará sus cambios pero no los eliminará. Puedes recuperarlos más tarde. Debes aprender sobre el comando :command:`git stash` antes de intentar volver a aplicar los cambios escondidos.

source: If you want to remove any changes you made locally you can delete them with this command:
es: Si desea eliminar cualquier cambio que haya realizado localmente, puede eliminarlos con este comando:

source: Telling Plone about ploneconf.site
es: Diciéndole a Plone acerca de ploneconf.site

source: If you did not yet do this (it is covered in chapter :ref:`eggs1-label`) you will have to modify :file:`buildout.cfg` to have Plone expect the egg :py:mod:`ploneconf.site` to be in :file:`src`.
es: Si usted aun no ha hecho esto (eso es cubierto en el capítulo :ref:`eggs1-label`) usted tendrá que modificar el archivo :file:`buildout.cfg` tener a Plone esperando el paquete egg :py:mod:`ploneconf.site` para estar en el directorio :file:`src`.

source: Tags
es: Etiquetas

source: These are the tags for which there is code:
es: Estos son las etiquetas para el cual dispone código fuente:

source: Chapter
es: Capítulo

source: Tag-Name
es: Etiqueta-Nombre

source: Updating the code-package
es: Actualizando el código del paquete

source: This section if for training who want to update the code in :py:mod:`ploneconf.site` wfter changing something in the training documentation.
es: Esta sección si para el entrenamiento que quiere actualizar el código en el paquete :py:mod:`ploneconf.site` después de cambiar algo en la documentación de entrenamiento.

source: The current model uses only one branch of commits and maintains the integrity through rebases.
es: El modelo actual usa solo una rama de commits y mantiene la integridad a través de rebases.

source: It goes like this:
es: Eso va como esto:

source: Only one one branch (master)
es: Solamente una rama (master)

source: Write the code for chapter 1 and commit
es: Escribir el código para el capítulo 1 y hacer commit

source: Write the code for chapter 2 and commit
es: Escribir el código para el capítulo 2 y hacer commit

source: Add the code for chapter 3 and commit
es: Escribir el código para el capítulo 3 y hacer commit

source: You realize that something or wrong in chapter 1
es: Te das cuenta de que algo o mal en el capítulo 1

source: You branch off at the commit id for chapter 1 `git checkout -b temp 123456`
es: Se bifurca en el id del commit para capítulo 1 `git checkout -b temp 123456`

source: You change the code and do a commit. `git commit -am 'Changed foo to also do bar'`
es: Usted cambias el código y haces un commit. Con el comando `git commit -am 'Cambió foo para también hacer bar'`

source: Switch to master and rebase on the branch holding the fix which will inject your new commit into master at the right place: `git checkout master` `git rebase temp` That inserts the changes into master in the right place. You only maintain a master branch that is a sequence of commits.
es: Cambia a master y haga el rebase en la rama que contiene el fix que inyectará tu nueva commit en master en el lugar correcto: `git checkout master` `git rebase temp` Que inserta los cambios en master en el lugar correcto. Solo mantienes una rama master que es una secuencia de commits.

source: You then can update your chapter-docs to point to the corresponding commit ids: chapter one: `git checkout 121431243` chapter two: `git checkout 498102980`
es: Usted entonces puede actualizar su documentación del capítulo para puntar al correspondiente ids del commit: capítulo uno: `git checkout 121431243` capítulo dos: `git checkout 498102980`

source: Additionally you can
es: Adicionalmente usted puede

source: set tags on the respective commits and move the tags. This way the docs do not need to change
es: defina tags en los respectivos commits y mueva las tags. Esta forma la documentación no necesita cambiar

source: squash the commits between the chapters to every chapter is one commit.
es: aplastar los commits entre los capítulos de cada capítulo es un commit.

source: To move tags after changes you do:
es: Para mover tags después de los cambios que haces:

source: Move a to another commit: `git tag -a <tagname> <commithash> -f`
es: Mover a otro commit: `git tag -a <nombretag> <hashcommit> -f`

source: Move the tag on the server `git push --tags -f`
es: Mover la tag en el servidor `git push --tags -f`

source: The final result should look like this:
es: El resultado final debería lucir como este:

source: I earlier versions we used a folder-based such as in https://github.com/collective/ploneconf.site_sneak. It proved to be a lot a lot of work to maintain that.
es: En versiones anteriores utilizamos una carpeta basada en https://github.com/collective/ploneconf.site_sneak. Resultó ser mucho trabajo mantener eso.

source: Configuring and Customizing Plone "Through The Web"
es: Configurando y personalizando Plone "a través de la Web"

source: This chapter has not yet been updated for Plone 5!
es: ¡Este capítulo aún no se ha actualizado para Plone 5!

source: The Control Panel
es: El panel de control

source: The most important parts of Plone can be configured in the control panel.
es: Las partes más importantes de Plone pueden ser configuradas en el panel de control.

source: Click on the portrait/username in the toolbar
es: Haga clic en el retrato/nombre de usuario en la barra de herramientas

source: Click :guilabel:`Site Setup`
es: Haga clic en :guilabel:`Configuración del sitio`

source: We'll explain every page and mention some of the actions you can perform here.
es: Nosotros explicaremos cada página y mencionaremos algunas cosas que puedes hacer aquí.

source: Date and Time
es: Fecha y Hora

source: Language
es: Idioma

source: Mail
es: Correo

source: Navigation
es: Navegación

source: Site
es: Sitio

source: Add-ons
es: Complementos

source: Search
es: Buscar

source: Discussion
es: Discusión

source: Theming
es: Temas

source: Social Media
es: Redes Sociales

source: Syndication
es: Sindicación

source: Content
es: Contenido

source: Content Rules
es: Reglas de Contenido

source: Editing
es: Edición

source: Image Handling
es: Manejo de Imágenes

source: Markup
es: Etiquetado

source: Content Settings
es: Configuración de Contenido

source: Dexterity Content Types
es: Tipos de contenido Dexterity

source: Users
es: Usuarios

source: Users and Groups
es: Usuarios y Grupos

source: Security
es: Seguridad

source: HTML Filtering
es: Filtrado HTML

source: Errors
es: Errores

source: Advanced
es: Avanzado

source: Maintenance
es: Mantenimiento

source: Management Interface
es: Interfaz de Administración

source: Caching
es: Caché

source: Configuration Registry
es: Registro de Configuración

source: Resource Registries
es: Registros de Recursos

source: Below the links you will find information on your Plone, Zope and Python Versions and an indicator as to whether you're running in production or development mode.
es: Por debajo en los paneles de enlaces de configuración encontraras la sección llamada **Visión Global de Versiones** con información de las versiones en tu Plone, Zope y Python y un indicador de cualquier cosa que usted está funcionando en el modo de **producción** o **desarrollo**.

source: Change the logo
es: Cambia el logotipo

source: Let's change the logo.
es: Cambiemos el logotipo.

source: Download a ploneconf logo: https://www.starzel.de/plone-tutorial/ploneconf-logo-2014
es: Descarga un logotipo de la ploneconf: https://www.starzel.de/plone-tutorial/ploneconf-logo-2014

source: Go to http://localhost:8080/Plone/@@site-controlpanel
es: Valla a la dirección URL http://localhost:8080/Plone/@@site-controlpanel

source: Upload the Logo.
es: Cargue el Logotipo.

source: The view of the homepage with the customized logo.
es: La vista de la página de inicio con el logotipo personalizado.

source: In the toolbar under :guilabel:`More options` you can open the configuration for the different places where you can have portlets.
es: En la barra de herramientas bajo :guilabel:`Administrar portlets` usted puede abrir la configuración para los diferente lugares donde usted puede tener los portlets.

source: UI fit for smart content editors
es: Interfaz de Usuario - UI apta para editores de contenido inteligente

source: Various types
es: Varios tipos

source: Portlet configuration is inherited
es: La configuración de portlet es heredada

source: Managing
es: Administrando

source: Ordering/weighting
es: Ordenando/ponderación

source: The future: may be replaced by tiles
es: En el futuro: será reemplazado por tiles

source: ``@@manage-portlets``
es: La vista ``@@manage-portlets``

source: Example:
es: Ejemplo:

source: Go to http://localhost:8080/Plone/@@manage-portlets
es: Valla a la dirección URL http://localhost:8080/Plone/@@manage-portlets

source: Add a static portlet "Sponsors" on the right side.
es: Añada un portlet "Patrocinadores" en el lado derecho.

source: Remove the news portlet and add a new one on the left side.
es: Retire el portlet de noticias y añada uno nuevo en el lado izquierdo.

source: Go to the training folder: http://localhost:8080/Plone/the-event/training and click :guilabel:`Manage portlets`
es: Valla a la carpeta de training: http://localhost:8080/Plone/the-event/training y has clic ``Administrar portlets``

source: Add a static portlet. "Featured training: Become a Plone-Rockstar at Mastering Plone!"
es: Añada un portlet estático. "Entrenamiento destacado: Conviértete en un Rockstar de Plone en la ¡Maestría en Plone!"

source: Use the toolbar to configure the portlets of the footer:
es: Use la barra de herramientas para configurar los portlets del pie de página:

source: Hide the portlets "Footer" and "Colophon".
es: Ocultar los portlets "Pie de página" y "Colofón".

source: Add a :guilabel:`Static text portlet` and enter "Copyright 2015 by Plone Community".
es: Añada un :guilabel:`Portlet de texto estático`, ingrese "Copyright 2015 by Plone Community".

source: Use :menuselection:`Insert --> Special Character` to add a real © sign.
es: Use :menuselection:`Insertar --> Carácter especial` para añadir un signo real ©.

source: You could turn that into a link to a copyright page later.
es: Podría convertirlo en un enlace a una página de derechos de autor más adelante.

source: Portlets save data, Viewlets usually don't. Viewlets are often used for UI-Elements and have no nice UI to customize them.
es: Los Portlets guardan datos, los Viewlets usualmente no. Los Viewlets se usan a menudo para elementos de interfaz de usuario - UI y no tienen una UI agradable para personalizarlos.

source: ``@@manage-viewlets``
es: La vista ``@@manage-viewlets``

source: Viewlets have no nice UI
es: Las Viewlets no tienen una interfaz de usuario - UI agradable

source: Not aimed at content editors
es: No está dirigido a editores de contenido

source: Not locally addable, no configurable inheritance.
es: No se puede añadir localmente, no hay herencia configurable.

source: Usually global (depends on code)
es: Usualmente son globales (depende del código)

source: Will be replaced by tiles?
es: ¿Será reemplazado por tiles?

source: The code is much simpler (we'll create one tomorrow).
es: El código es mucho más simple (crearemos un ejemplo mañana).

source: Live in viewlet managers, can be nested (by adding a viewlet that contains a viewlet manager).
es: En vivo en los administradores de viewlets, se puede anidar (añadiendo un viewlet que contiene un administrador de viewlets).

source: TTW reordering only within the same viewlet manager.
es: Reordenación a través de la web solo dentro del mismo administrador de viewlets.

source: The code decides when it is shown and what it shows.
es: El código fuente decide cuándo se muestra y qué muestra.

source: ZMI (Zope Management Interface)
es: Interfaz de Administración de Zope (ZMI)

source: Go to http://localhost:8080/Plone/manage
es: Valla a dirección URL http://localhost:8080/Plone/manage

source: Zope is the foundation of Plone. Here you can access the inner workings of Zope and Plone alike.
es: Zope es la base de Plone. Aquí puede acceder al funcionamiento interno de Zope y Plone por igual.

source: Here you can easily break your site so you should know what you are doing!
es: ¡Aquí puede romper fácilmente su sitio así que sepa lo que está haciendo!

source: We only cover three parts of customization in the ZMI now. Later on when we added our own code we'll come back to the ZMI and will look for it.
es: Nosotros sólo cubrimos las tres partes de la personalización en el ZMI ahora. Más tarde, cuando agreguemos nuestro propio código fuente vamos a volver a la ZMI y lo buscaremos.

source: At some point you'll have to learn what all those objects are about. But not today.
es: En algún momento, tendrás que aprender de qué se tratan todos esos objetos. Pero no hoy.

source: Actions are mostly links. But **really flexible** links.
es: Las actions son principalmente enlaces. Pero enlaces **realmente flexibles**.

source: Actions are configurable TTW (Through-The-Web) and through code.
es: Las actions son configurable a través de la Web y a través de código fuente.

source: These actions are usually iterated over in viewlets and displayed.
es: Estas actions son usualmente iteradas sobre viewlets y mostradas.

source: Examples:
es: Ejemplos:

source: Links in the Footer (``site_actions``)
es: Enlaces en el pie de página (``site_actions``)

source: Actions Dropdown (``folder_buttons``)
es: Actions del menú desplegable (``folder_buttons``)

source: Actions have properties like:
es: Las actions tienen propiedades como:

source: ``site_actions``
es: Los actions ``site_actions``

source: These are the links at the bottom of the page:
es: Estos son los enlaces al fondo de la página:

source: :guilabel:`Site Map`
es: :guilabel:`Mapa del sitio`

source: :guilabel:`Accessibility`
es: :guilabel:`Accesibilidad`

source: :guilabel:`Contact`
es: :guilabel:`Contacto`

source: :guilabel:`Site Setup`
es: :guilabel:`Configuración del sitio`

source: We want a new link to legal information, called "Imprint".
es: Queremos un nuevo enlace a la información legal, llamado "Aviso Legal".

source: Go to ``site_actions`` (we know that because we checked in ``@@manage-viewlets``)
es: Valla a ``site_actions`` (lo sabemos porque lo chequeamos en ``@@manage-viewlets``)

source: Add a CMF Action ``imprint``
es: Añadir una CMF Action con el ID ``imprint``, luego haga clic en el para editarlo y asignando a ``title`` el valor "Aviso Legal".

source: Set URL to ``string:${portal_url}/imprint``
es: Asigna a URL (Expression) el valor ``string:${portal_url}/imprint``

source: Leave *condition* empty
es: Deje *condition* en blanco

source: Set permission to ``View``
es: Asigne a Permissions el permiso ``View``

source: Save
es: Guardar

source: explain
es: explicar

source: Check if the link is on the page
es: Verifique si el enlace de esta en la página funciona

source: Create new Document "Imprint" and publish
es: Cree un nuevo Documento llamado "Aviso legal" y publíquelo

source: Global navigation
es: Navegación global

source: The horizontal navigation is called ``portal_tabs``
es: La navegación horizontal es llamada ``portal_tabs``

source: Go to :menuselection:`portal_actions --> portal_tabs` `Link <http://localhost:8080/Plone/portal_actions/portal_tabs/manage_main>`_
es: Valla a :menuselection:`portal_actions --> portal_tabs`, aquí esta el `enlace <http://localhost:8080/Plone/portal_actions/portal_tabs/manage_main>`_

source: Edit ``index_html``
es: Edite el objeto ``index_html``

source: Where is the navigation?
es: ¿Donde es la navegación?

source: The navigation shows content-objects, which are in Plone's root. Plus all actions in ``portal_tabs``.
es: La navegación muestra objetos de contenido, que están en la raíz de Plone. Además de todas las acciones en ``portal_tabs``.

source: Explain & edit ``index_html``
es: Explicar y editar el objeto ``index_html``

source: Configuring the navigation itself is done elsewhere: http://localhost:8080/Plone/@@navigation-controlpanel
es: Configurando la navegación por si mismo es hecha en cualquier parte: http://localhost:8080/Plone/@@navigation-controlpanel

source: If time explain:
es: Si hay tiempo explique:

source: user > undo (cool!)
es: Menú ``usuario`` > deshacer (¡chevere!)

source: user > login/logout
es: Menú ``usuario`` > vista ``login`` / vista ``logout``

source: In ``portal_skins`` we can change certain images, CSS-files and templates.
es: En ``portal_skins`` podemos cambiar ciertas imágenes, archivos CSS y plantillas.

source: ``portal_skins`` is deprecated technology
es: ``portal_skins`` es una tecnología obsoleta

source: Plone 5 got rid of most files that lived in ``portal_skins``.
es: Plone 5 tendrá una gran cantidad de archivos que aún vive en ``portal_skins``.

source: Change some CSS
es: Cambie algunos archivos CSS

source: Go to ZMI
es: Valla al ZMI
