Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/mastering-plone.po
Languages: es

source: Dexterity has a solution for it, with special adapters that are called and registered by the name behavior.
es: Dexterity tiene una solución para ello, con adaptadores especiales los cuales se llaman y registran por el nombre del comportamiento.

source: A behavior can be added to any content type through the web and at runtime.
es: Un comportamiento puede ser añadido a cualquier tipo de contenido a través de la Web y durante el tiempo de ejecución.

source: All default views (e.g. the add- and edit-forms) know about the concept of behaviors and when rendering forms, the views also check whether there are behaviors referenced with the current context and if these behaviors have a schema of their own, these fields get shown in addition.
es: Todas las vistas predeterminadas (e.j. el formulario añadir y editar) deben conocer el concepto de comportamientos y cuando renderizar los formularios, las vistas también comprueban si hay comportamientos referenciados con el contexto actual y si estos comportamientos tienen un esquema propio, esos campos se mostraran adicionalmente.

source: Names and Theory
es: Nombres y Teoría

source: The name behavior is not a standard term in software development. But it is a good idea to think of a behavior as an aspect. You are adding an aspect to your content type and you want to write your aspect in such a way that it works independently of the content type on which the aspect is applied. You should not have dependencies to specific fields of your object or to other behaviors.
es: El nombre del comportamiento no es un término estándar en el desarrollo de software. Pero es una buena idea pensar en un comportamiento como un aspecto. Usted está añadiendo un aspecto a tu tipo de contenido y usted quiere escribir su aspecto de tal manera, que funciona independientemente del tipo de contenido en el que se aplica el aspecto. Usted no debe tener dependencias a campos específicos de su objeto o de otros comportamientos.

source: Such an object allows you to apply the `Open/closed principle`_ to your dexterity objects.
es: Como un objeto le permite aplicar el `principio Abierto/cerrado`_ a los objetos de Dexterity.

source: `Open/closed principle`_
es: `Principio abierto/cerrado`_

source: Practical example
es: Ejemplo práctico

source: So, let us write our own small behavior.
es: Así que, vamos a escribir nuestro propio pequeño comportamiento.

source: In the future, we want our presentation to be represented in Lanyrd (a Social Conference Directory - Lanyrd.com) too. For now we will just provide a link so that visitors can collaborate easily with the Lanyrd site.
es: En el futuro, queremos que nuestra presentación este representada también en Lanyrd (un Directorio Conferencia Social - Lanyrd.com). Por ahora nos limitaremos a ofrecer un enlace para que los visitantes puedan colaborar fácilmente con el sitio Lanyrd.

source: So for now, our behavior just adds a new field for storing the url to Lanyrd.
es: Así que por ahora, nuestro comportamiento sólo añade un nuevo campo para almacenar la dirección URL del servicio Lanyrd.

source: We want to keep a clean structure, so we create a :file:`behaviors` directory first, and include it into the zcml declarations of our :file:`configure.zcml`.
es: Queremos mantener una estructura limpia, así que creamos primero un directorio :file:`behaviors` y, luego lo incluimos dentro de las declaraciones zcml de nuestro archivo :file:`configure.zcml`.

source: Then, we add an empty :file:`behaviors/__init__.py` and a :file:`behaviors/configure.zcml` containing
es: Entonces, añadimos un archivo vacío :file:`behaviors/__init__.py` y un archivo :file:`behaviors/configure.zcml` conteniendo el siguiente código

source: It can be a bit confusing when to use factories or marker interfaces and when not to.
es: Puede ser un poco confuso cuándo se utilizar las factories, o las interfaces marker y cuando no.

source: If you do not define a factory, your attributes will be stored directly on the object. This can result in clashes with other behaviors.
es: Si usted no define un factory, sus atributos se almacenan directamente en el objeto. Esto puede dar lugar a resultar en comportamientos no deseados.

source: You can avoid this by using the :py:class:`plone.behavior.AnnotationStorage` factory. This stores your attributes in an `Annotation <https://docs.plone.org/develop/plone/misc/annotations.html>`_. But then you *must* use a marker interface if you want to have custom viewlets, browser views or portlets.
es: Esto se puede evitar mediante el uso de la fábrica :py:class:`plone.behavior.AnnotationStorage`. Éste almacena sus atributos en una :ref:`Annotation <https://docs.plone.org/develop/plone/misc/annotations.html>`_. Pero entonces usted *debe* utilizar una interfaz marcador si usted quiere tener viewlets personalizados, browser views o portlets.

source: Without it, you would have no interface against which you could register your views.
es: Sin ella, no tendrías interfaz contra el cual podría registrar sus vistas.

source: And a :file:`behaviors/social.py` containing:
es: Y un archivo :file:`behaviors/social.py` conteniendo el siguiente código:

source: Let's go through this step by step.
es: Vamos a llevarlo a través de este paso a paso.

source: We register a behavior in :ref:`behaviors/configure.zcml <social-behavior-zcml-label>`. We do not say for which content type this behavior is valid. You do this through the web or in the GenericSetup profile.
es: Registramos un comportamiento en el archivo :ref:`behaviors/configure.zcml <social-behavior-zcml-label>`. Nosotros decimos para qué tipo de contenido este comportamiento es válido. Para hacer esto, a través de la Web o en el perfil GenericSetup.

source: We create a marker interface in :ref:`behaviors/social.py <social-behavior-python-label>` for our behavior and make it also a schema containing the fields we want to declare. We could just define schema fields on a zope.interface class, but we use an extended form from `plone.supermodel`_, else we could not use the fieldset features.
es: Creamos una interfaz marcador en el archivo :ref:`behaviors/social.py <social-behavior-python-label>` para nuestro comportamiento y hacer que sea también un esquema el cual contiene los campos que queremos declarar. Podríamos simplemente utilizar definiciones de campos de esquema en una clase ``zope.interface``, pero utilizar un formulario extendido desde el paquete `plone.supermodel`_, de lo contrario nosotros podríamos no usar las características del conjunto de campos.

source: We also add a `fieldset`_ so that our fields are not mixed with the normal fields of the object.
es: También añadimos un `fieldset`_ para que nuestros campos no se mezclen con los campos normales del objeto.

source: We add a normal `URI`_ schema field to store the URI to lanyrd.
es: Añadimos un campo de esquema `URI`_ normal para almacenar la dirección URI del servicio Lanyrd.

source: We mark our schema as a class that also implements the `IFormFieldProvider`_ interface. This is a marker interface, we do not need to implement anything to provide the interface.
es: Nosotros marcamos nuestro esquema como una clase que también implementa la interfaz `IFormFieldProvider`_. Se trata de una interfaz marcador, nosotros no necesitamos implementar nada para proporcionar la interfaz.

source: Adding it to our talk
es: Añadiendo a nuestra charla

source: We could add this behavior now via the plone control panel. But instead, we will do it directly and properly in our GenericSetup profile
es: Podríamos añadir este comportamiento ahora a través del panel de control de Plone. Pero en cambio, lo haremos directamente adecuadamente en nuestro perfil GenericSetup

source: We must add the behavior to :file:`profiles/default/types/talk.xml`:
es: Debemos añadir el comportamiento al archivo :file:`profiles/default/types/talk.xml`:

source: More Complex Behaviors
es: Más comportamientos complejos

source: Write an annotation
es: Escribir una anotación

source: Annotation Marker Interfaces
es: Anotación de Interfaces Marcador

source: Using Annotations
es: Usando Anotaciones

source: We are going to store the information in an annotation. Not because it is needed but because you will find code that uses annotations and need to understand the implications.
es: Vamos a almacenar la información en una anotación. No porque se necesita, sino porque se encuentra el código que utiliza anotaciones y la necesidad de entender las implicaciones.

source: `Annotations`_ in Zope/Plone mean that data won't be stored directly on an object but in an indirect way and with namespaces so that multiple packages can store information under the same attribute, without colliding.
es: `Annotations`_ en Zope/Plone significa que los datos no serán almacenados directamente en un objeto, sino de una manera indirecta y con múltiple espacios de nombres para que varios paquetes pueden almacenar información bajo el mismo atributo, sin colisionar.

source: So using annotations avoids namespace conflicts. The cost is an indirection. The dictionary is persistent so it has to be stored separately. Also, one could give attributes a name containing a namespace prefix to avoid naming collisions.
es: Así que usando anotaciones evita los conflictos de nombres. El costo es una indirección. El diccionario es persistente por lo que tiene que ser almacenado por separado. Además, se podría dar atributos un nombre que contiene un prefijo de espacio de nombres para evitar colisiones de nombres.

source: What are annotations
es: Que son las annotations

source: When to use them
es: Cuando usarlas entonces

source: Using Schema
es: Usando Esquema

source: The attribute where we store our data will be declared as a schema field. We mark the field as an omitted field (using schema directive similar to ``read_permission`` or ``widget``), because we are not going to create :py:mod:`z3c.form` widgets for entering or displaying them. We do provide a schema, because many other packages use the schema information to get knowledge of the relevant fields.
es: El atributo donde almacenamos nuestros datos será declarado como un campo de esquema. Marcamos el campo como un campo omitido (usando una directiva de esquema similar a ``read_permission`` o ``widget``), porque no vamos a crear widgets :py:mod:`z3c.form` para introducirlos o mostrarlos. Nosotros ofrecemos un esquema, porque muchos otros paquetes utilizan la información de esquema para obtener el conocimiento de los campos pertinentes.

source: For example, when files were migrated to blobs, new objects had to be created and every schema field was copied. The code can't know about our field, except if we provide schema information.
es: Por ejemplo, cuando los archivos se han migrado a formato blobs, los nuevos objetos tuvieron que ser creados y cada campo de esquema fue copiado. El código no puede saber acerca de nuestro campo, excepto si proporcionamos información de esquema.

source: Why to use schemas always
es: Por que usar siempre los esquemas

source: Writing Code
es: Escribiendo código

source: To start, we create a directory :file:`behavior` with an empty :file:`behavior/__init__.py` file.
es: Para iniciar, creamos un directorio :file:`behavior` con un archivo vació :file:`behavior/__init__.py`.

source: Next we must, as always, register our ZCML.
es: Luego debemos, como siempre, registrar nuestro ZCML.

source: First, add the information that there will be another ZCML file in :file:`configure.zcml`
es: Primero, añada la información de que habrá otro archivo ZCML en :file:`configure.zcml`

source: Next, create :file:`behavior/configure.zcml`
es: Luego, cree el archivo :file:`behavior/configure.zcml`

source: There are some important differences to our first behavior:
es: Hay algunas diferencias importantes de nuestro primer comportamiento:

source: There is a marker interface
es: Hay una interfaz marcador

source: There is a factory
es: Hay una fabrica

source: The factory is a class that provides the behavior logic and gives access to the attributes we provide. Factories in Plone/Zope land are retrieved by adapting an object to an interface. If you want your behavior, you would write :samp:`IVoting(object)`
es: La factory es una clase que proporciona la lógica de comportamiento y da acceso a los atributos que ofrecemos. Las factories en la tierra de Plone/Zope se recuperan mediante la adaptación de un objeto con una interfaz. Si usted quiere su comportamiento, usted escribiría :samp:`IVoting(object)`

source: But in order for this to work, your object may *not* be implementing the IVoting interface, because if it did, :samp:`IVoting(object)` would return the object itself! If I need a marker interface for objects providing my behavior, I must provide one, for this we use the marker attribute. My object implements :samp:`IVotable` and because of this, we can write views and viewlets just for this content type.
es: Pero para que esto funcione, el objeto *no* puede estar implementando la interfaz IVoting, porque si lo haría, ¡:samp:`IVoting(object)` devolvería el objeto en sí mismo!. Si yo necesito una interfaz marcador de los objetos proporcionando mi comportamiento, yo debo proporcionar uno, para esto usamos el atributo marcador. Mi objeto implementa :samp:`IVotable` y debido a esto, podemos escribir vistas y viewlets sólo para este tipo de contenido.

source: The interfaces need to be written, in our case into a file :file:`interfaces.py`:
es: Las interfaces necesitan ser escritas, en nuestro caso en un archivo :file:`interfaces.py`:

source: This is a lot of code. The IVotableLayer we will need later for viewlets and browser views. Let's add it right here. The IVotable interface is the simple marker interface. It will only be used to bind browser views and viewlets to contenttypes that provide our behavior, so no code needed.
es: Se trata de una gran cantidad de código. El IVotableLayer nosotros lo necesitaremos más tarde para viewlets y browser views. Permite añadir aquí mismo. La interfaz IVotable es la interfaz marcador simple. Sólo se utiliza para enlazar las browser views y viewlets a tipos de contenido que proporcionan nuestro comportamiento, por lo que no hay código necesario.

source: The IVoting class is more complex, as you can see. While IVoting is just an interface, we use :samp:`plone.supermodel.model.Schema` for advanced dexterity features. Zope.schema provides no means for hiding fields. The directives :samp:`form.omitted` from :samp:`plone.autoform` allow us to annotate this additional information so that the autoform renderers for forms can use the additional information.
es: La clase IVoting es más compleja, como se puede ver. Mientras IVoting es sólo una interfaz, utilizamos :samp:`plone.supermodel.model.Schema` para las características avanzadas Dexterity. El paquete zope.schema no proporciona medios para ocultar campos. La directivas :samp:`form.omitted` de :samp:`plone.autoform` nos permite nosotros anotar esta información adicional para que los auto-formularios renderizados pueden utilizar la información adicional.

source: We make this omit conditional. If we run Plone in debug mode, we will be able to see the internal data in the edit form.
es: Hacemos esta omitir condicional. Si ejecutamos Plone en modo de depuración, seremos capaces de ver los datos internos en el formulario de edición.

source: We create minimal schema fields for our internal data structures. For a small test, I removed the form omitted directives and opened the edit view of a talk that uses the behavior. After seeing the ugliness, I decided that I should provide at least minimum of information. Titles and required are purely optional, but very helpful if the fields won't be omitted, something that can be helpful when debugging the behavior. Later, when we implement the behavior, the :samp:`votes` and :samp:`voted` attributes are implemented in such a way that you can't just modify these fields, they are read only.
es: Creamos los campos mínimos esquema para nuestras estructuras de datos internas. Por una pequeña prueba, yo le quité las directivas omitida de formulario y abrí la vista de edición de un tipo de contenido charla que utiliza el comportamiento. Después de ver la fealdad, yo decidí que debía proporcionar al menos mínimo de información. Los títulos y requerido son puramente opcional, pero muy útil si no se omitirán los campos, algo que puede ser útil al depurar el comportamiento. Más tarde, cuando ponemos en práctica el comportamiento, los atributos :samp:`votes` y :samp:`voted` se apliquen de tal manera que no se puede simplemente modificar estos campos, que son de sólo lectura.

source: Then we define the API that we are going to use in browser views and viewlets.
es: Luego definimos la API que vamos a usar en los browser views y viewlets.

source: The last line ensures that the schema fields are known to other packages. Whenever some code wants all schemas from an object, it receives the schema defined directly on the object and the additional schemata. Additional schemata are compiled by looking for behaviors and whether they provide the :samp:`IFormFieldProvider` functionality. Only then the fields are known as schema fields.
es: La última línea se asegura de que los campos de esquema son conocidos por otros paquetes. Siempre que algún código quiere que todos los esquemas de un objeto, que recibe el esquema definido directamente sobre el objeto y los esquemas adicional. Los esquemas adicionales se compilan mediante la búsqueda de comportamientos y si ofrecen la funcionalidad :samp:`IFormFieldProvider`. Sólo entonces nuestros campos son conocidos como campos de esquema.

source: Now the only thing that is missing is the behavior, which we must put into :file:`behavior/voting.py`
es: Ahora la única cosa que falta es el comportamiento, la cual debemos colocar en el archivo :file:`behavior/voting.py`

source: In our :samp:`__init__` method we get *annotations* from the object. We look for data with a specific key.
es: En nuestro método :samp:`__init__` obtenemos las *anotaciones* del objeto. Buscamos los datos con una clave específica.

source: The key in this example is the same as what I would get with :samp:`__name__+Vote.__name__`. But we won't create a dynamic name, this would be very clever and clever is bad.
es: La clave en este ejemplo es el mismo que lo que obtendría con :samp:`__name__+Vote.__name__`. Pero no vamos a crear un nombre dinámico, esto sería muy inteligente y hábil, es malo.

source: By declaring a static name, we won't run into problems if we restructure the code.
es: Al declarar un nombre estático, no vamos a tener problemas si reestructuramos el código.

source: You can see that we initialize the data if it doesn't exist. We work with PersistentDict and PersistentList. To understand why we do this, it is important to understand how the ZODB works.
es: Usted puede ver, que inicializamos los datos si no existe. Trabajamos con PersistentDict y PersistentList. Para entender por qué hacemos esto, es importante entender cómo funciona el ZODB.

source: The ZODB can store objects. It has a special root object that you will never touch. Whatever you store there, will be part of the root object, except if it is an object subclassing :samp:`persistent.Persistent` Then it will be stored independently.
es: El ZODB puede almacenar objetos. Tiene un objeto raíz especial que usted nunca toca. Cualquier cosa que usted almacena donde, formará parte del objeto raíz, excepto si se trata de un sublclassing objeto :samp:`persistent.Persistent` entonces se almacenará de forma independiente.

source: Zope/ZODB Persistent objects note when you change an attribute on it and mark itself as changed. Changed objects will be saved to the database. This happens automatically. Each request begins a transaction and after our code runs and the Zope Server is preparing to send back the response we generated, the transaction will be committed and everything we changed will be saved.
es: Tenga cuenta que los objetos persistentes Zope/ZODB cuando se cambia un atributo en él y marcar como cambiado. Los objetos modificados se guardarán en la base de datos. Esto sucede automáticamente. Cada request inicia una transacción y después de nuestro código corrió y el servidor Zope está preparando para enviar de nuevo la respuesta que nosotros generamos, la transacción será enviada y todo lo cambiamos, será salvo.

source: Now, if have a normal dictionary on a persistent object, and you will only change the dictionary, the persistent object has no way to know if the dictionary has been changed. This `happens`_ from time to time.
es: Ahora, si tienen un diccionario normal sobre un objeto persistente, y usted sólo va a cambiar el diccionario, el objeto persistente no tiene manera de saber, si el diccionario se ha cambiado. Esto `sucede`_ de vez en cuando.

source: So one solution is to change the special attribute :samp:`_p_changed` to :samp:`True` on the persistent object, or to use a PersistentDict. That is what we are doing here.
es: Así que una solución es cambiar el atributo especial :samp:`_p_changed` a :samp:`True` en el objeto persistente, o utilizar un PersistentDict. Eso es lo que estamos haciendo aquí.

source: An important thing to note about PersistentDict and PersistentList is that they cannot handle write conflicts. What happens if two users rate the same content independently at the same time? In this case, a database conflict will occur because there is no way for Plone to know how to handle the concurrent write access. Although this is rather unlikely during this training, it is a very common problem on high traffic websites.
es: Una cosa importante a tener en cuenta sobre PersistentDict y PersistentList es que no pueden manejar conflictos de escritura. ¿Qué sucede si dos usuarios califican el mismo contenido de forma independiente al mismo tiempo? En este caso, se producirá un conflicto en la base de datos porque no hay forma de que Plone sepa cómo manejar el acceso de escritura simultáneo. Aunque esto es bastante improbable durante esta entrenamiento, es un problema muy común en los sitios web con mucho tráfico.

source: You can find more information in the documentation of the ZODB, in particular `Rules for Persistent Classes <http://www.zodb.org/en/latest/guide/writing-persistent-objects.html>`_
es: Puede encontrar más información en la documentación de la ZODB, en particular, `Reglas para Clases Persistentes <http://www.zodb.org/en/latest/guide/writing-persistent-objects.html>`_

source: Next we provide the internal fields via properties. Using this form of property makes them read only properties, as we did not define write handlers. We don't need them so we won't add them.
es: A continuación ofrecemos los campos internos a través de propiedades. El uso de este formulario de propiedad, hace que lean solamente propiedades, ya que no nos definimos manipuladores de escritura. Nosotros no los necesitamos para que no nos añadirlos.

source: As you have seen in the Schema declaration, if you run your site in debug mode, you will see an edit field for these fields. But trying to change these fields will throw an exception.
es: Como se ha visto en la declaración de esquema, si ejecuta su sitio en modo de depuración, verá un campo de edición para estos campos. Pero si tratar de cambiar estos campos abra una excepción.

source: Explain ZODB and Persistent Classes
es: Explicar ZODB y Clases persistentes

source: Let's continue with this file:
es: Continuemos con este archivo:
