Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/plone_training_config.po
Languages: es

source: Puppet is a configuration management tool (others you might have heard of are Chef, Ansible and SaltStack) and helps system admnistrators to automatically manage servers (real and virtual). We won't get into Puppet in detail, but it builds on top of our base Vagrant image to further set up our environment.
es: Puppet es una herramienta de gestión de la configuración (otros de los que habrás oído hablar son Chef, Ansible y SaltStack) y ayuda a los administradores de sistemas a gestionar automáticamente servidores (reales y virtuales). No vamos a entrar en detalle en Puppet, sino que se basa en la parte superior de nuestra imagen Vagrant base para configurar aún más nuestro medio ambiente.

source: Vagrant detects when you set up a new machine and runs Puppet or other Provisioners by default only once, although it also can be used to keep machines up to date, which is a bit harder. See the :file:`Vagrantfile` and `Vagrant Documentation <https://www.vagrantup.com/docs>`_, especially the *Provisioning* chapter.
es: Vagrant detecta cuando se configura una nueva máquina y se ejecuta Puppet u otros Aprovisionadores por defecto sólo una vez, aunque también se puede utilizar para mantener las máquinas al día, lo que es un poco más difícil. Consulte la documentación del archivo :file:`Vagrantfile` y de `Vagrant <https://www.vagrantup.com/docs>`_, en si mismo, especialmente el capítulo *Provisioning*.

source: This is basically what Puppet does if we were to configure our system by hand:
es: Esto es básicamente lo que hace Puppet si configuráramos nuestro sistema a mano:

source: First we update Ubuntu and install some packages.
es: Primero nosotros actualizamos Ubuntu e instalamos algunos paquetes.

source: Then we create a virtual python environment using virtualenv. This is always a good practice since that way we get a clean isolated copy of our system python, so that we do not break the system python by installing eggs that might collide with other eggs. Python is nowadays used a lot by your operating system as well for all kinds of system tools and scripting.
es: Entonces creamos un entorno virtual de python usando el paquete virtualenv. Esta es siempre una buena práctica ya que de esa manera conseguimos una copia limpia y aislada de nuestro sistema python, para que no rompamos el sistema python mediante la instalación de paquete egg python que podrían colisionar con otros paquete egg. Python se utiliza hoy en día mucho por su sistema operativo, así como para todo tipo de herramientas de sistema y secuencias de comandos.

source: Now we download and unpack a buildout-cache that holds all the python packages that make up Plone. This is an optimisation: We could skip this step and have buildout download all packages individually from the `python packaging index PyPi <https://pypi.org>`_ but that takes much longer on a first install.
es: Ahora descargamos y descomprimimos el directorio buildout-cache que contiene todos los paquetes python que componen Plone. Esta es una optimización: Podríamos saltar este paso y tener buildout descargar todos los paquetes individualmente del `python packaging index PyPi <https://pypi.python.org/pypi>`_ pero eso toma mucho más tiempo en una primera instalación.

source: Then we check out our tutorial buildout from https://github.com/collective/training_buildout and build it.
es: Entonces nosotros hacemos un check out de nuestro buildout del tutorial de https://github.com/collective/training_buildout y los construimos.

source: This will download additional eggs that are not yet part of the buildout-cache and configure Plone to be ready to run.
es: Esto descargará adicionales de paquetes eggs que aún no forman parte del directorio buildout-cache y configurará Plone para que esté listo para ejecutarse.

source: At this point Vagrant and Puppet have finished their job to set up your virtual training environment on your local machine.
es: En este punto Vagrant y Puppet han terminado su trabajo para configurar su entorno de entrenamiento virtual en su máquina local.

source: You can now connect to the machine and start Plone.
es: Ahora puede conectarse a la máquina y iniciar Plone.

source: Now we have a fresh Buildout-based Zope application server, ready to add a Plone site. Go to http://localhost:8080 and create a Plone site.
es: Ahora tenemos un servidor de aplicación Zope basado en Buildout, dispuesto para añadir un sitio Plone. Ir a http://localhost:8080 y cree un sitio Plone.
