Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/plone_training_config.po
Languages: es

source: Installing Plone for the Training
es: Instalando Plone para el entrenamiento

source: Keep in mind that you need a fast Internet connection during installation since you'll have to download a lot of data!
es: Tenga en cuenta que necesita una conexión rápida a Internet durante la instalación, ¡ya que tendrá que descargar una gran cantidad de datos!

source: If you feel the desire to try out both methods below (with Vagrant and without), make sure you use different :file:`training` directories!
es: Si siente el deseo de probar ambos métodos a continuación (con y sin Vagrant), ¡asegúrese de usar copias distintas de la carpeta :file:`training`!

source: The two installations do not coexist well.
es: Las dos instalaciones no conviven bien.

source: Installing Plone without vagrant
es: Instalando Plone sin Vagrant

source: If you are **not** used to running Plone on your laptop skip this part and continue with :ref:`install-virtualbox`.
es: Si usted **no** está acostumbrado a ejecutar Plone en su computadora portátil omitir esta parte y continuar con :ref:`install-virtualbox`.

source: To run Plone 5.1 you at least need Python 2.7.9!
es: Para ejecutar Plone 5.1, ¡al menos requiere instalado Python 2.7.9!

source: If you **are** experienced with running Plone on your own laptop, we encourage you to do so because you will have certain benefits:
es: Si usted **esta** experimentado con ejecutar Plone en su propio ordenador portátil, te animamos a hacerlo, ya que tendrá ciertos beneficios:

source: You can use the editor you are used to.
es: Usted puede usar el editor, que usted usa.

source: You can use *omelette* to have all the code of Plone at your fingertips.
es: Puede utilizar la receta Buildout llamada *omelette* tener todo el código de Plone a su alcance.

source: You do not have to switch between different operating systems during the training.
es: Usted no tiene que cambiar entre diferentes del sistema operativo durante el entrenamiento.

source: If you feel comfortable, please work on your own machine with your own Python.
es: Si se siente cómodo, trabaje en su propia máquina con su propio Python.

source: **Please** make sure that you have a system that will work, since we don't want you to lose valuable time!
es: **Por favor**, asegúrese de tener un sistema que funcione, ¡ya que no queremos que pierda un tiempo valioso!

source: If you also want to follow the JavaScript training and install the JavaScript development tools, you need `NodeJS <https://nodejs.org/en/download/>`_ installed on your development computer.
es: Si también desea seguir el entrenamiento de JavaScript e instalar las herramientas de desarrollo de JavaScript, necesita `NodeJS <https://nodejs.org/en/download/>`_ instalado en su computadora de desarrollo.

source: Please make sure you have your system properly prepared and installed all necessary prerequisites.
es: Asegúrese de que su sistema esté bien preparado e instalado todos los requisitos previos necesarios.

source: The following instructions are based on Ubuntu and macOS, if you use a different operating system (OS), please adjust them to fit your OS.
es: Las siguientes instrucciones están basadas en Ubuntu y macOS, si usa un sistema operativo (SO) diferente, ajústele para que se adapte a su sistema operativo.

source: On Ubuntu/Debian, you need to install the following:
es: En Ubuntu/Debian, debe instalar lo siguiente:

source: On macOS you at least need to install some dependencies with `Homebrew <https://brew.sh/>`_
es: En macOS, al menos necesita instalar algunas dependencias con `Homebrew <https://brew.sh/>`_

source: For more information or in case of problems see the `official installation instructions <https://docs.plone.org/manage/installing/installation.html>`_.
es: Para obtener más información o en caso de problemas, consulte las `instrucciones de instalación oficiales <https://docs.plone.org/manage/installing/installation.html>`_.

source: Set up Plone for the training like this if you use your own OS (Linux or Mac):
es: Si usted utiliza su propio sistema operativo (Linux o Mac) la instalación de Plone para el entrenamiento debe ser de esta forma:

source: This creates a virtualenv with Python 2.7 in the folder :file:`buildout` and installs some requirements in it.
es: Esto crea un virtualenv con Python 2.7 en la carpeta :file:`buildout` e instala algunos requisitos en él.

source: Now you can run the buildout for the first time:
es: Ahora puede ejecutar el buildout por primera vez:

source: This will take a very lot of time and produce a lot of output because it downloads and configures more than 260 Python packages. Once it is done you can start your Plone instance with
es: Esto tomará algún tiempo y producir una gran cantidad de mensaje en consola de comando debido a que descarga y configura más de 260 paquetes de Python. Una vez hecho esto usted puede comenzar a instancia con el siguiente comando:

source: The output should be similar to:
es: La salida por la consola de comando es similar a la siguiente:

source: If the output says ``INFO Zope Ready to handle requests`` then you are in business.
es: La salida por consola debe decir ``INFO Zope Ready to handle requests`` entonces usted está ejecutando correctamente el servidor.

source: If you point your browser at http://localhost:8080 you see that Plone is running.
es: Si abre su navegador al dirección URL http://localhost:8080 verá que Plone se está ejecutando.

source: A running plone instance.
es: Una instancia en ejecución plone.

source: There is no Plone site yet - we will create one in chapter 6.
es: Todavía no hay un sitio de Plone: crearemos uno sitio en el capítulo 6.

source: Now you have a working Plone site up and running and can continue with the next chapter.
es: Ahora tiene un sitio Plone en funcionamiento y puede continuar con el siguiente capítulo.

source: You can stop the running instance anytime using :kbd:`ctrl + c`.
es: Puede detener la instancia en ejecución en cualquier momento utilizando la combinación de teclas :kbd:`ctrl + c`.

source: If there is an error message you should either try to fix it or use vagrant and continue in this chapter.
es: Si hay un mensaje de error, usted debe bien intenta arreglarlo o utiliza la instalación vagrant y continuar en este capítulo.

source: Installing Plone with Vagrant
es: Instalando Plone con Vagrant

source: We use a virtual machine (Ubuntu 16.04) to run Plone during the training.
es: Usamos una máquina virtual (Ubuntu 16.04) para ejecutar Plone durante el entrenamiento.

source: We rely on `Vagrant <https://www.vagrantup.com>`_ and `VirtualBox <https://www.virtualbox.org>`_ to give the same development environment to everyone.
es: Nosotros confiamos en `Vagrant <https://www.vagrantup.com>`_ y `VirtualBox <https://www.virtualbox.org>`_ para dar el mismo entorno de desarrollo a todos.

source: `Vagrant <https://www.vagrantup.com>`_ is a tool for building complete development environments.
es: `Vagrant <https://www.vagrantup.com>`_ es una herramienta para construir entornos de desarrollo completos.

source: We use it together with Oracle’s `VirtualBox <https://www.virtualbox.org>`_ to create and manage a virtual environment.
es: Lo utilizamos junto con `VirtualBox <https://www.virtualbox.org>`_ de Oracle para crear y administrar un entorno virtual.

source: Install VirtualBox
es: Instalar VirtualBox

source: Vagrant uses Oracle’s VirtualBox to create virtual environments.
es: Vagrant utiliza VirtualBox de Oracle para crear entornos virtuales.

source: Here is a link directly to the download page: https://www.virtualbox.org/wiki/Downloads.
es: Aquí hay un enlace directamente a la página de descarga: https://www.virtualbox.org/wiki/Downloads.

source: We use VirtualBox 5.0.x
es: Usamos VirtualBox en su versión 5.0.x

source: Install and configure Vagrant
es: Instalar y configurar Vagrant

source: Get the latest version from https://www.vagrantup.com/downloads.html for your operating system and install it.
es: Obtenga la última versión de https://www.vagrantup.com/downloads.html para su sistema operativo y proceda a instalarlo.

source: Now your system has a command :command:`vagrant` that you can run in the terminal.
es: Ahora su sistema tiene un comando :command:`vagrant` que puede ejecutar en la terminal de comando.

source: First, create a directory in which you want to do the training.
es: En primer lugar, crear un directorio en el que desea hacer el entrenamiento.

source: If you already have a :file:`training` directory because you followed the **Installing Plone without vagrant** instructions above, you should either delete it, rename it, or use a different name below.
es: Si ya tiene un directorio llamado :file:`training` porque ha seguido las instrucciones de **Instalación de Plone sin vagrant**, debe eliminarlo, renombrarlo o use un nombre diferente a continuación.

source: Setup Vagrant to automatically install the current guest additions. You can choose to skip this step if you encounter any problems with it.
es: Configure Vagrant para instalar automáticamente los actuales guests adicionales. Usted puede optar por omitir este paso si tiene algún problema con ella.

source: Now download :download:`plone_training_config.zip <../_static/plone_training_config.zip>` and copy its contents into your training directory.
es: Ahora descargue :download:`plone_training_config.zip <../_static/plone_training_config.zip>` y copie su contenido en su directorio de entrenamiento.

source: The training directory should now hold the file :file:`Vagrantfile` and the directory :file:`manifests` which again contains several files.
es: El directorio del entrenamiento ahora debería contener el archivo :file:`Vagrantfile` y el directorio se :file:`manifests` el cual contiene a su vez muchos archivos.

source: Now start setting up the virtual machine (VM) that is configured in :file:`Vagrantfile`:
es: Ahora comience a establecer la máquina virtual (VM) que está configurada en el archivo :file:`Vagrantfile` ejecutando el siguiente comando:

source: This takes a **veeeeery loooong time** (between 10 minutes and 1h depending on your Internet connection and system speed) since it does all the following steps:
es: Esto lleva **mucho, pero mucho tiempo** (entre 10 minutos y 1 h dependiendo de su conexión a Internet y la velocidad del sistema) ya que hace todos los pasos siguientes:

source: downloads a virtual machine (Official Ubuntu Server 16.04 LTS, also called "Xenial Xerus")
es: descarga una máquina virtual (Official Ubuntu Server 16.04 LTS, también llamado "Xenial Xerus")

source: sets up the VM
es: establece la VM

source: updates the VM
es: actualiza la VM

source: installs various system-packages needed for Plone development
es: instala varios paquetes de sistema necesarios para el desarrollo de Plone

source: downloads and unpacks the buildout-cache to get all the eggs for Plone
es: descargas y desempaquetar el directorio buildout-cache del instalador unificado, para obtener todos los paquetes egg para Plone

source: clones the training buildout into /vagrant/buildout
es: clona el directorio buildout ``training`` en el directorio ``/vagrant/buildout``

source: builds Plone using the eggs from the buildout-cache
es: construye Plone usando los paquetes eggs del directorio buildout-cache

source: Sometimes this stops with the message:
es: A veces esto se detiene con el mensaje:

source: If this happens or you have the feeling that something has gone wrong and the installation has not finished correctly for some reason you need to run the following command to repeat the process.
es: Si esto sucede o usted tiene la sensación de que algo ha ido mal y la instalación no ha finalizado correctamente por alguna razón, usted necesita ejecutar el comando siguiente para repetir el proceso.

source: This will only repeat steps that have not finished correctly.
es: Este comando solo repetirá los pasos que no han culminado correctamente.

source: You can do this multiple times to fix problems, e.g. if your network connection was down and steps could not finish because of this.
es: Usted puede hacer esto varias veces para arreglar los problemas, por ejemplo, si su conexión a red es limitada y los pasos de la instalación no se pudieron terminar debido a esto.

source: If while bringing vagrant up you get an error similar to:
es: Si mientras se ejecuta vagrant obtiene un error similar a:

source: The configuration may have stalled out because your computer's BIOS requires virtualization to be enabled. Check with your computer's manufacturer on how to properly enable virtualization.
es: Es posible que la configuración se haya estancado porque el BIOS de su equipo requiere que se habilite la virtualización. Consulte con el fabricante de su computadora sobre cómo habilitar correctamente la virtualización.

source: See: https://teamtreehouse.com/community/vagrant-ssh-sshexchangeidentification-read-connection-reset-by-peer
es: Ver: https://teamtreehouse.com/community/vagrant-ssh-sshexchangeidentification-read-connection-reset-by-peer

source: Once Vagrant finishes the provisioning process, you can login to the now running virtual machine.
es: Una vez Vagrant termina el proceso de aprovisionamiento, se puede acceder a la máquina virtual en ejecución.

source: If you use Windows you'll have to login with `putty <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_. Connect to vagrant@127.0.01 at port 2222. User **and** password are ``vagrant``.
es: Si usted tiene que usar Windows tendrás que iniciar sesión para con `putty <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_. Conecte a vagrant@127.0.01 en el puerto 2222. El usuario **y** la contraseña son ``vagrant``.

source: You are now logged in as the user vagrant in :file:`/home/vagrant`.
es: Ahora está iniciado con el usuario vagrant en el directorio ``/home/vagrant``.

source: We'll do all steps of the training as this user.
es: Vamos a hacer todos los pasos del entrenamiento como este usuario.

source: Instead we use our own Plone instance during the training. It is in :file:`/vagrant/buildout/`. Start it in foreground with :command:`./bin/instance fg`.
es: En cambio usamos nuestra propia instancia de Plone durante el entrenamiento. Está en el directorio ``/vagrant/buildout/``. Inicie en modo foreground con el comando :command:`./bin/instance fg`.

source: In rare cases when you are using macOS with an UTF-8 character set starting Plone might fail with the following error:
es: En raras ocasiones cuando está utilizando macOS con un juego de caracteres UTF-8, al iniciar Plone puede fallar con el siguiente error:

source: In that case you have to put the localized keyboard and language settings in the .bash_profile of the vagrant user to your locale (like ``en_US.UTF-8`` or ``de_DE.UTF-8``)
es: En ese caso, usted tiene que poner la configuración de idioma y del teclado localizados en el archivo ``.bash_profile`` del usuario ``vagrant`` a su entorno local (como ``en_US.UTF-8`` o ``de_DE.UTF-8``)

source: Now the Zope instance we're using is running. You can stop the running instance anytime using :kbd:`ctrl + c`.
es: Ahora la instancia Zope que estamos usando se está ejecutando. Puede detener la instancia en ejecución en cualquier momento utilizando la combinación de teclas :kbd:`ctrl + c`.

source: If it doesn't, don't worry, your shell isn't blocked.
es: Si no es así, no te preocupes, su shell no está bloqueado.

source: Type :kbd:`reset` (even if you can't see the prompt) and press RETURN, and it should become visible again.
es: Escriba el comando :kbd:`reset` (incluso si usted no puede ver el símbolo de sistema) y pulse la tecla RETURN, y debe ser visible otra vez.

source: If you point your local browser at http://localhost:8080 you see that Plone is running in Vagrant.
es: Si abre su navegador a la dirección URL http://localhost:8080 verá que Plone se está ejecutando en Vagrant.

source: This works because VirtualBox forwards the port 8080 from the guest system (the vagrant Ubuntu) to the host system (your normal operating system).
es: Esto funciona porque VirtualBox reenvía el puerto 8080 desde el sistema invitado (el vagrant de Ubuntu) al sistema host (su sistema operativo normal).

source: The Buildout for this Plone is in a shared folder. This means we run it in the vagrant box from :file:`/vagrant/buildout` but we can also access it in our own operating system and use our favorite editor.
es: El Buildout para este Plone está en una carpeta compartida. Esto significa lo ejecutamos en la vagrant box desde el directorio ``/vagrant/buildout`` pero también podemos acceder a este desde fuera del propio sistema operativo y usar de nuestro editor favorito con este.

source: You will find the directory :file:`buildout` in the directory :file:`training` that you created in the beginning next to :file:`Vagrantfile` and :file:`manifests`.
es: Usted encontrará el directorio de :file:`buildout` en el directorio del :file:`training` que creó en el principio junto al archivo :file:`Vagrantfile` y al archivo :file:`manifests`.

source: The database and the python packages are not accessible in your own system since large files cannot make use of symlinks in shared folders. The database lies in ``/home/ubuntu/var``, the python packages are in ``/home/ubuntu/packages``.
es: La base de datos y los paquetes python no son accesibles en su propio sistema, ya que los archivos grandes no se puede utilizar enlaces simbólicos en los directorios compartidos. La base de datos se encuentra en ``/home/vagrant/var``, los paquetes Python están en ``/home/vagrant/packages``.

source: If you have any problems or questions please mail us at team@starzel.de or create a ticket at https://github.com/plone/training/issues.
es: Si usted tiene cualquier problema o pregunta, por favor, envíenos un correo electrónico a team@starzel.de o cree un ticket en el repositorio https://github.com/plone/training/issues.

source: What Vagrant does
es: ¿Qué hace Vagrant?

source: Installation is done automatically by vagrant and puppet. If you want to know which steps are actually done please see the chapter :doc:`what_vagrant_does`.
es: La instalación se realiza automáticamente por las herramientas vagrant y puppet. Si quieres saber qué pasos se hacen realmente, por favor, consulte el capítulo :doc:`what_vagrant_does`.

source: **Vagrant Care and Handling**
es: **Atención y Manejo Vagrant**

source: Keep in mind the following recommendations for using your Vagrant VirtualBoxes:
es: Tenga en cuenta las siguientes recomendaciones para usar sus entornos virtuales de Vagrant y VirtualBox:

source: Use the :command:`vagrant suspend` or :command:`vagrant halt` commands to put the VirtualBox to "sleep" or to "power it off" before attempting to start another Plone instance anywhere else on your machine, if it uses the same port. That's because vagrant "reserves" port 8080, and even if you stopped Plone in vagrant, that port is still in use by the guest OS.
es: Utilice los comando :command:`vagrant suspend` o :command:`vagrant halt` para poner el VirtualBox en "suspensión" o "apagarlo" antes de intentar iniciar otra instancia de Plone en cualquier otro lugar de su máquina, si usa el mismo puerto. Esto se debe a que vagrant "se reserva" el puerto 8080, e incluso si detuvo a Plone en vagrant, ese puerto todavía está siendo utilizado por el sistema operativo invitado.

source: If you are done with a vagrant box, and want to delete it, always remember to run :command:`vagrant destroy` on it before actually deleting the directory containing it. Otherwise you'll leave its "ghost" in the list of boxes managed by vagrant and possibly taking up disk space on your machine.
es: Si ha terminado con una vagrant box, y desea eliminarla, siempre recuerde ejecutar el comando :command:`vagrant destroy` en ella antes de borrar el directorio que la contiene. De lo contrario, dejará ese "fantasma" en la lista de cajas administradas por vagrant y posiblemente ocupar espacio en disco en su máquina.

source: See :command:`vagrant help` for all available commands, including :command:`suspend`, :command:`halt`, :command:`destroy`, :command:`up`, :command:`ssh` and :command:`resume`.
es: Ver :command:`vagrant help` para todos las opciones de comando disponibles, incluyendo :command:`suspend`, :command:`halt`, :command:`destroy`, :command:`up`, :command:`ssh` y :command:`resume`.

source: What Vagrant is and does
es: Lo qué es y lo hace Vagrant

source: These steps are automatically done by Vagrant and Puppet for you. They are only interesting if you want to know what goes on under the hood for preparing your virtual training environment.
es: Estos pasos son realizados automáticamente por Vagrant y Puppet para usted. Ellos son solamente interesantes si quieres saber lo que pasa bajo el capó para la preparación de su entorno de entrenamiento virtual.

source: Vagrant is an automation tool for developers to script the configuration and starting/stopping of virtual machines using applications like VirtualBox or Vmware Fusion/Workstation. The beauty of Vagrant is that it is largely platform independent for Linux, Windows and Apple, so with one 'Vagrantfile' per project you describe a base installation virtual image and all kinds of virtual machine settings you would otherwise have to click and type together in Virtual machine application.
es: Vagrant es una herramienta de automatización para que los desarrolladores puedan programar la configuración y el arranque/detención de máquinas virtuales usando aplicaciones como VirtualBox o Vmware Fusion/Workstation. La belleza de Vagrant es que es una gran plataforma independiente para Linux, Windows y Apple, por lo que con un archivo 'Vagrantfile' por proyecto se describe una imagen virtual de instalación base y todo tipo de configuración de máquina virtual que de lo contrario tendría que hacer clic y escribir juntos la máquina virtual de la Aplicación.

source: What Vagrant for example does is install a port forward so that ``http://localhost:8080`` on your physical computer is automatically forwarded to the port Plone will be listening on in the guest virtual machine. After Vagrant has done its thing to set up your virtual machine we are not finished though. Although Vagrant has the option to prebuild specific images it would be a lot of work and waste of bandwidth to redownload a machine images (300-600Mb) each time we would like to change small things in our virtual training environment.
es: Lo que hace Vagrant, por ejemplo, es instalar un puerto hacia adelante de modo que ``http://localhost:8080`` en su computadora física se reenvíe automáticamente al puerto que Plone escuchará en la máquina virtual invitada. Después de que Vagrant haya hecho lo suyo para configurar su máquina virtual, no hemos terminado. Aunque Vagrant tiene la opción de pre-construir imágenes específicas sería mucho trabajo y desperdicio de ancho de banda descargando de nuevo una máquina de imágenes (los cuales son de 300 a 600 Mb) cada vez que nos gustaría cambiar cosas pequeñas en nuestro entorno de entrenamiento virtual.
