Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/resources.po
Languages: es

source: Resources
es: Recursos

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: We have not yet talked about CSS and Javascript. At the moment these are considered static resources.
es: Todavía no hemos hablado de los archivos CSS y Javascript. Por el momento estos son considerados recursos estáticos.

source: You can declare and access static resources with special urls. The configure.zcml of our package already has a declaration for resources:
es: Puede declarar y acceder a recursos estáticos con direcciones URLs especiales. El archivo ``configure.zcml`` de nuestro paquete ya tiene una declaración de recursos:

source: Now all files we put in the resources-folder can be found via the url http://localhost:8080/Plone/++resource++ploneconf.site/something.js
es: Ahora todos los archivos que ponemos en la carpeta de recursos se pueden encontrar a través de la dirección URL http://localhost:8080/Plone/++resource++ploneconf.site/something.js

source: Let's create a ``ploneconf.css`` and a ``plonconf.js`` in that folder.
es: Vamos a crear un archivo ``ploneconf.css`` y un archivo ``plonconf.js`` en esa carpeta.

source: If we access http://localhost:8080/Plone/++resource++ploneconf.site/ploneconf.css we see our css-file.
es: Si accedemos a la dirección URL http://localhost:8080/Plone/++resource++ploneconf.site/ploneconf.css para ver nuestro archivo CSS.

source: How do our javascript and css files get used when visiting the page? Adding them directly into the html is not a good solution, having many css- and js-files slows page loading down.
es: ¿Cómo hacer que nuestros archivos javascript y css acostumbren cuando visitan la página? Añadiendo directamente en el HTML no es una buena solución, teniendo muchos archivos CSS y JS ralentiza carga de la página.

source: With ``portal_css`` and ``portal_javascript`` Plone has resource managers that are able to merge and compress js and css files. Resources can be added conditionally and Plone automatically stops merging files when you are debugging plone in the foreground.
es: Con las herramientas ``portal_css`` y ``portal_javascript`` Plone tiene administradores de recursos que son capaces de combinar y comprimir los archivos js y css. Los recursos pueden ser añadidos de forma condicional y Plone automáticamente deja de fusión de los archivos cuando se está depurando plone en modo foreground.

source: We need to register our resources with GenericSetup.
es: Tenemos que registrar nuestros recursos con GenericSetup.

source: Add a new file ``profiles/default/cssregistry.xml``
es: Agregar un nuevo archivo ``profiles/default/cssregistry.xml``

source: Add a new file ``profiles/default/jsregistry.xml``
es: Agregar un nuevo archivo ``profiles/default/jsregistry.xml``
