Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/reusable.po
Languages: es

source: The package contains some problems.
es: Esta paquete contiene algunos problemas.

source: No permission settings, Users can't customize who and when users can vote
es: Sin la configuración de permisos, los usuarios no pueden personalizar quién y cuándo los usuarios pueden votar.

source: We do things, but don't trigger events. Events allow others to react.
es: Hacemos cosas, pero no provocamos eventos. Los eventos permiten que otros reaccionen.

source: Adding permissions
es: Agregando permisos

source: Permissions have a long history, there are two types of permissions.
es: Los permisos tienen una larga historia, hay dos tipos de permisos.

source: In Zope2, a permission was just a string.
es: En Zope2, un permiso era sólo una cadena.

source: In ZTK, a permission is an object that gets registered as a Utility.
es: En ZTK, un permiso es un objeto que se obtiene registrado como una Utilidad.

source: We must support both, in some cases we have to reference the permission by their Zope2 version, in some by their ZTK Version.
es: Debemos apoyar a ambos, en algunos casos tenemos que referenciar el permiso por su versión Zope2, en algunos por su versión ZTK.

source: Luckily, there is a zcml statement to register a permission both ways in one step.
es: Por suerte, hay una declaración ZCML para registrar un permiso de ambas maneras en un solo paso.

source: The configuration registry was meant to solve a problem, but we will now stumble over a problem that did not get resolved properly.
es: El registro de configuración quería resolver un problema, pero ahora nos topamos con un problema que no se resolvió correctamente.

source: Our permission is a utility. Our browser views declare this permission as a requirement for viewing them.
es: Nuestro permiso es una utilidad. Nuestras browser views declaran este permiso como un requisito para verlas.

source: When our browser views get registered, the permissions must exist already. If you try to register the permissions after the views, Zope won't start because it doesn't know about the permissions.
es: Cuando nuestras browser views se registren, los permisos deben existir ya. Si intenta registrar los permisos después de las vistas, Zope no se iniciará porque no sabe acerca de los permisos.

source: In some places we have to reference the Zope 2 permission strings. It is best practice to provide a static variable for this.
es: En algunos lugares tenemos que hacer referencia a las cadenas de permisos de Zope 2. Es la mejor práctica proporcionar una variable estática para esto.

source: We provide this in :file:`__init__.py`
es: Proporcionamos esto en el archivo :file:`__init__.py`, con el siguiente código Python:

source: Using our permissions
es: Usando nuestros permisos

source: As you can see, we created two permissions, one for voting, one for viewing the votes.
es: Como puede ver, creamos dos permisos, uno para votar, uno para ver los votos.

source: If a user is not allowed to see the votes, she does not need access to the vote viewlet.
es: Si uno no puede ver las votaciones, no necesita acceso al viewlet de votos.

source: While we are at it, if a user can't vote, she needs no access to the helper view to actually submit a vote.
es: Mientras estamos en ello, si uno no puede votar, no necesita acceso a la helper view para presentar realmente un voto.

source: We can add this restriction to :file:`browser/configure.zcml`
es: Podemos agregar esta restricción al archivo :file:`browser/configure.zcml`, con el siguiente código ZCML:

source: We are configuring components, so we use the component name of the permission, which is the :samp:`id` part of the declaration we added earlier.
es: Estamos configurando componentes, por lo que usamos el nombre de componente del permiso, que es el :samp:`id` parte de la declaración que añadimos anteriormente.

source: The person could still vote, by handcrafting the URL. Browser Views run code without any restriction, it is your job to take care of security.
es: La persona podría votar, mediante la elaboración manual de la URL. Las Browser Views ejecutar código sin ninguna restricción, es su trabajo tener cuidado de la seguridad.

source: But... if a person has no access to the object at all, maybe because the site is configured that Anonymous users cannot access private objects, the unauthorized users will not be able to submit a vote.
es: Pero... si una persona no tiene acceso al objeto en absoluto, tal vez porque el sitio está configurado para que los usuarios anónimos no puedan acceder a objetos privados, los usuarios no autorizados no podrán enviar un voto.

source: That is because Zope checks security permissions when trying to find the right object. If it can't find the object due to security constraints not met, no view ill ever be called, because that would have been the next step.
es: Es decir, porque Zope comprueba los permisos de seguridad al intentar encontrar el objeto correcto. Si no puede encontrar el objeto debido a las restricciones de seguridad no se cumplen, ninguna vista mal, nunca ser llamado, ya que habría sido el siguiente paso.

source: We now protect our views and viewlets. We still show the option to vote though.
es: Ahora protegemos nuestras ``views`` y ``viewlets``. Todavía mostramos la opción de votar.

source: We must add a condition in our page template, and we must provide the condition information in our viewlet class.
es: Debemos agregar una condición en nuestra plantilla de página, y debemos proporcionar la información de la condición en nuestra clase viewlet.

source: Lets move on to :file:`browser/viewlets.py`
es: Mueva al archivo :file:`browser/viewlets.py`, con el siguiente código Python:

source: And the template in :file:`browser/templates/voting_viewlet.pt`
es: Y la plantilla en el archivo :file:`browser/templates/voting_viewlet.pt`, con el siguiente código ZPT:

source: Sometimes subtle bugs come up because of changes. In this case I noticed that I should only prompt people to vote if they are allowed to vote!
es: A veces se producen errores sutiles debido a los cambios, en este caso, me di cuenta de que sólo debería animar a la gente a votar, ¡si a ellos se les permite votar!

source: Provide defaults
es: Proporcionar valores por defecto

source: Are we done yet? Who may vote now?
es: ¿Ya terminamos?, ¿Quién puede votar ahora?

source: We have to tell that someone.
es: Tenemos que decirle a alguien.

source: Who has which permissions is managed in Zope. This is persistent, and persistent configuration is handled by GenericSetup.
es: En el ZTK, un permiso es un objeto que se obtiene registrado como una Utilidad.
