Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/sneak.po
Languages: es

source: Using the code for the training
es: Usando el código para un entrenamiento

source: We provide the code for this training divided in into chapters.
es: Nosotros proveemos el código para este entrenamiento dividido dentro de los capítulos.

source: Telling Plone about ploneconf.site
es: Diciéndole a Plone acerca de ploneconf.site

source: Modify ``buildout.cfg`` to have Plone expect the egg ``ploneconf.site`` to be in ``src``.
es: Modifique el archivo ``buildout.cfg`` por que Plone espera el paquete egg ``ploneconf.site`` este en el directorio ``src``.

source: Gettin the code-package
es: Cómo obtener el paquete de código

source: Download the code into a directory called ``src/ploneconf.site_sneak``.
es: Descargar el código dentro del directorio llamado ``src/ploneconf.site_sneak``.

source: Copy the relevant chapter so that Plone can use into
es: Copie el capítulo correspondiente para que Plone pueda usar dentro

source: To use the code for a certain chapter stop Plone and do this:
es: Para usar el código para cierto capítulo, detenga Plone y haga esto:

source: This will:
es: Esto sera:

source: replace any existing previous chapter with the one you want to copy
es: reemplace cualquier capítulo anterior existente por el que desea copiar

source: run buildout and restart Plone
es: ejecute buildout y reinicie Plone

source: These are the chapters for which there is code::
es: Estos son los capítulos para los que dispone código fuente::
