Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/teachers-training.po
Languages: es

source: Re-iterate the training subject and most important the training goals. If some students applied late or got sneaked in by a manager the previous day, you can 'synchronise' everybody on what the goals are.
es: Repita el tema de la capacitación y, lo que es más importante, los objetivos de la capacitación. Si algunos estudiantes se postularon tarde o fueron colados por un gerente el día anterior, puede 'sincronizar' a todos sobre cuáles son los objetivos.

source: Real life story: I've had a student stand up during the introduction and complain that he expected to learn to theme the Plone site in an end user content management training. Better to get that out of the way before you you're in the middle of a subject and people start to nag or complain.
es: Historia de la vida real: Tuve un estudiante que se puso de pie durante la introducción y se quejó de que esperaba aprender a tematizar el sitio de Plone en una capacitación de administración de contenido para usuarios finales. Es mejor quitarte eso de en medio antes de que estés en medio de un tema y la gente comience a regañar o quejarse.

source: As discussed, plan your breaks beforehand and show some flexibility, when people want to break earlier, ask for them to tell you at that time. It's a group effort.
es: Como se discutió, planifique sus descansos con anticipación y muestre cierta flexibilidad, cuando las personas quieran descansar antes, pídales que se lo digan en ese momento. Es un esfuerzo de grupo.

source: Teachers Training
es: Formación de entrenadores

source: How To Give Technical Training(s)
es: Cómo dar entrenamiento(s) técnico

source: WORK IN PROGRESS
es: TRABAJO EN PROGRESO

source: This chapter will likely only interest you if you want to **give a (Plone)technical training**, it does not contain any material on Plone itself.
es: Es probable que este capítulo solo le interese si desea **dar una capacitación técnica (Plone)**, no contiene ningún material sobre Plone en sí.

source: It's not specifically written for Mastering Plone but could be useful in giving any technical training. Hopefully it will support you for your first Plone educational experience in front of the room.
es: No está escrito específicamente para dominar Plone, pero podría ser útil para dar cualquier formación técnica. Con suerte, lo apoyará en su primera experiencia educativa de Plone frente a la sala.

source: It contains feedback and 'lessons learned' from previous Plone trainings and personal experience.
es: Contiene comentarios y 'lecciones aprendidas' de capacitaciones anteriores de Plone y experiencia personal.

source: Training theory: education, how people learn and process information
es: Teoría de la entrenamiento: educación, cómo las personas aprenden y procesan información

source: This chapter will contain some background on learning, mental models that people use in different ways, how to improve remembering and understanding of knowledge, training rhythm and attention span, etc. etc.
es: Este capítulo contendrá algunos antecedentes sobre el aprendizaje, los modelos mentales que las personas utilizan de diferentes maneras, cómo mejorar la memoria y la comprensión del conocimiento, el ritmo de entrenamiento y la capacidad de atención, etc., etc.

source: These are helpful both before, during and after a training, that's why we have put them in a separate chapter that you should read before you start writing or improving the training material.
es: Estos son útiles tanto antes, como durante y después de una capacitación, es por eso que los hemos puesto en un capítulo separado que debe leer antes de comenzar a escribir o mejorar el material de capacitación.

source: Introduction
es: Introducción

source: The science of learning and how we process information is a huge field of research, this chapter is nowhere near an overview or a complete introduction of learning. There are a number of subjects here that could give you some background and things to consider while you are preparing for, writing or giving a training. If you are a (Plone) trainer and have more subjects or wisdom, please add them here.
es: La ciencia del aprendizaje y la forma en que procesamos la información es un enorme campo de investigación, este capítulo no es ni de lejos una visión general o una introducción completa del aprendizaje. Aquí hay una serie de temas que podrían darte algunos antecedentes y cosas a considerar mientras te preparas, escribes o das una capacitación. Si eres un entrenador (Plone) y tienes más temas o sabiduría, por favor agrégalos aquí.

source: Learning Styles and the Trainer
es: Estilos de aprendizaje y el entrenador

source: If you take a look at `Learning Styles on WikiPedia <https://en.wikipedia.org/wiki/Learning_styles>`__ you will find a huge number of models and theories on how individuals learn.
es: Si echas un vistazo a `Estilos de aprendizaje en Wikipedia <https://en.wikipedia.org/wiki/Learning_styles>`__ encontrarás una gran cantidad de modelos y teorías sobre cómo aprenden los individuos.

source: Some of us are more visually oriented and love diagrams, drawings, schema's and other visual tools to structure and grasp information. Others are more comfortable with a narrative written down that they can follow along. If you're more auditory you'd love to follow along with a screencast or prefer to have a trainer in front of you who talks you through a procedure.
es: Algunos de nosotros estamos más orientados visualmente y amamos los diagramas, dibujos, esquemas y otras herramientas visuales para estructurar y comprender la información. Otros se sienten más cómodos con una narración escrita que puedan seguir. Si eres más auditivo, te encantará seguir un screencast o prefieres tener un entrenador frente a ti que te explique un procedimiento.

source: Other models/modes differentiate in learning by examples, or maybe you prefer to have the theoretical knowledge and background first before you see an example.
es: Otros modelos/modos se diferencian en el aprendizaje por ejemplos, o tal vez prefieras tener el conocimiento teórico y los antecedentes primero antes de ver un ejemplo.

source: A big challenge for a trainer is to recognise his own preference of learning while preparing for and giving a training. So maybe you prefer to have a lot of theory first and then continue to the examples. If you then give a training to a small group of students and you notice they loose focus after half an hour or theory, it might be that they are more pragmatists and would love to see an example first before learning about the reasons why.
es: Un gran reto para un formador es reconocer su propia preferencia de aprendizaje mientras se prepara para impartir una formación. Así que tal vez prefieras tener mucha teoría primero y luego continuar con los ejemplos. Si luego das una capacitación a un pequeño grupo de estudiantes y notas que pierden la concentración después de media hora de teoría, puede ser que sean más pragmáticos y les encantaría ver un ejemplo primero antes de conocer las razones.

source: If you don't like diagrams and figures yourself because they're always an abstraction and incomplete, you could leave them out of any training material, but a significant part of your future training audience will love them.
es: Si no te gustan los diagramas y las figuras porque siempre son una abstracción e incompletos, podrías dejarlos fuera de cualquier material de formación, pero a una parte importante de tu futura audiencia de formación les encantarán.

source: There's not a magic wand or solution because you will always be limited in time and space, but as a guideline, try to balance the visual/written information, balance theory and examples. Also, you can observe your students during the training day and try to figure out on which kind of information they light up on or loose interest. Or even better: just ask them during a break. If you have enough training material you can add a few more examples or exercises, discuss some visual schemes that you have in an appendix, etc. etc.
es: No hay una varita mágica o una solución porque siempre estarás limitado en tiempo y espacio, pero como guía, trata de equilibrar la información visual/escrita, equilibra la teoría y los ejemplos. Además, puede observar a sus estudiantes durante el día de capacitación y tratar de averiguar en qué tipo de información se iluminan o pierden interés. O mejor aún: pregúntales durante un descanso. Si tienes suficiente material de entrenamiento puedes añadir algunos ejemplos o ejercicios más, comentar algunos esquemas visuales que tienes en un apéndice, etc. etc.

source: Try to teach one thing at a time
es: Trata de enseñar una cosa a la vez

source: Especially with Zope/Plone, there are a lot of concepts that students will have to grasp some time. We have CSS, HTML, Python, JavaScript, ZPT, METAL, TALES, ZCML, Generic Setup, Acquisition, component architecture, the Object Database, the ZMI, the Plone UI, etc. etc.
es: Especialmente con Zope/Plone, hay muchos conceptos que los estudiantes tendrán que comprender en algún momento. Tenemos CSS, HTML, Python, JavaScript, ZPT, METAL, TALES, ZCML, configuración genérica, adquisición, arquitectura de componentes, la base de datos de objetos, la ZMI, la interfaz de usuario de Plone, etc. etc.

source: The irritating part with introducing any of these technologies is that when you try to teach one of them, two or three others will creep into the explanation as well. Some options:
es: La parte irritante de la introducción de cualquiera de estas tecnologías es que cuando intentas enseñar una de ellas, otras dos o tres también se deslizarán en la explicación. Algunas opciones:

source: Tell your students that they should ignore this and this and that you'll explain that part later while you're explaining X.
es: Dígales a sus estudiantes que deben ignorar esto y esto y que usted explicará esa parte más tarde mientras explica X.

source: Some students are very capable of learning this way, others will simply lock up inside and get distracted by this nagging thought about the 'other' stuff. If you can avoid parking concepts 'until later', please try:
es: Algunos estudiantes son muy capaces de aprender de esta manera, otros simplemente se encerrarán en sí mismos y se distraerán con este pensamiento persistente sobre las 'otras' cosas. Si puede evitar los conceptos de estacionamiento 'hasta más tarde', intente:

source: Design your training in such a way that you start with concepts that are mostly 'stand alone' and from there build on the knowledge already there. (learning path)
es: Diseña tu formación de tal manera que empieces con conceptos que sean en su mayoría 'independientes' y a partir de ahí construyas sobre el conocimiento que ya existe. (ruta de aprendizaje)

source: An example in the context of Zope is to first introduce the ZMI and object database, talk about objects in there, then continue to Zope Page Templates that are applied to the object in a context, talk about the TALES expressions inside ZPT and end with METAL macros.
es: Un ejemplo en el contexto de Zope es introducir primero el ZMI y la base de datos de objetos, hablar de los objetos que contienen, luego continuar con las plantillas de página de Zope que se aplican al objeto en un contexto, hablar de las expresiones TALES dentro de ZPT y terminar con las macros METAL.

source: It's maybe old school and ugly, but you could explain most of ZPT/TALES/macros with students in the ZMI through the web without ever going to a command line or work in an editor. This is similar to:
es: Tal vez sea de la vieja escuela y feo, pero podría explicar la mayoría de ZPT/TALES/macros con estudiantes en el ZMI a través de la web sin tener que ir a una línea de comandos o trabajar en un editor. Esto es similar a:

source: Design isolated exercises/examples where you don't need multiple concepts at the same time.
es: Diseña ejercicios/ejemplos aislados en los que no necesites varios conceptos al mismo tiempo.

source: These examples are not to promote teaching through the ZMI, but to be aware of stacking too many concepts to quickly in a training. :-)
es: Estos ejemplos no son para promover la enseñanza a través de la ZMI, sino para ser conscientes de acumular demasiados conceptos demasiado rápido en una formación. :-)

source: Attention Span
es: Capacidad de atención

source: Both before and during a training it's vital to monitor the required attention span of the human mind.
es: Tanto antes como durante un entrenamiento, es vital controlar la capacidad de atención requerida de la mente humana.

source: When you prepare and write material, check your chapters or blocks for length, mental weight and structure. Validate that a student can work through a chapter in 20-30 minutes. Provide an introduction, explain some theory, show/discuss examples, provide exercises and wrap up with for example references to more material.
es: Cuando prepares y escribas material, revisa la longitud, el peso mental y la estructura de tus capítulos o bloques. Validar que un estudiante puede trabajar en un capítulo en 20-30 minutos. Proporcione una introducción, explique algo de teoría, muestre/discuta ejemplos, proporcione ejercicios y concluya con, por ejemplo, referencias a más material.

source: Check that you don't try to teach multiple things at the same time and try to repeat your subject a few times so that it will stick more.
es: Verifica que no trates de enseñar varias cosas al mismo tiempo y trata de repetir tu tema unas cuantas veces para que se pegue más.

source: On a large scale, you can also improve the attention span for students during the traing day by keeping a cadence or rhythm.
es: A gran escala, también puede mejorar la capacidad de atención de los estudiantes durante el día de entrenamiento manteniendo una cadencia o ritmo.

source: At the beginning, show an agenda and discuss this with everybody present. In this agenda, plan breaks and lunch beforehand and mutually agree with your students.
es: Al principio, muestre una agenda y discútala con todos los presentes. En esta agenda, planifique los descansos y el almuerzo con anticipación y acuerde mutuamente con sus estudiantes.

source: Design a training day around multiple blocks of maximum 50-55 minutes and put a small break of 5-10 minutes after those blocks. Put a larger break in the middle of the morning with coffee etc. same in the afternoon, and of course the lunch break.
es: Diseña un día de entrenamiento en torno a varios bloques de máximo 50-55 minutos y pon un pequeño descanso de 5-10 minutos después de esos bloques. Ponga un descanso más grande a media mañana con café, etc., lo mismo por la tarde, y por supuesto la pausa para el almuerzo.

source: In each of those blocks, use a rhythm or structure to teach the subject. It's great if your training material already has this structure, then you can just flow along with the material. But if you're comfortable with this, you can also add more material and jump a bit through the material and select those exercises or examples that you think will appeal most to your current group.
es: En cada uno de esos bloques, utiliza un ritmo o estructura para enseñar la materia. Es genial si tu material de entrenamiento ya tiene esta estructura, entonces puedes simplemente fluir junto con el material. Pero si te sientes cómodo con esto, también puedes agregar más material y saltar un poco a través del material y seleccionar aquellos ejercicios o ejemplos que creas que atraerán más a tu grupo actual.

source: The nice thing about teaching grown ups is that if you give them responsibility they will most of the time reward that with commitment. Tell your students when you discuss the agenda in the morning it's the general structure, but if you get to a tough subject and their heads are filled within half an hour: let them request a short break when they need it.
es: Lo bueno de enseñar a los adultos es que si les das responsabilidad, la mayoría de las veces la recompensarán con compromiso. Dígales a sus estudiantes cuando discutan la agenda por la mañana que es la estructura general, pero si llega a un tema difícil y sus cabezas se llenan en media hora: permítales solicitar un breve descanso cuando lo necesiten.

source: The more you know, the less you know
es: Lo más que sabes, lo menos que sabes

source: As a trainer it is not your job or quality to know everything there is about the subject and to be able to answer any question your students have. It's your profesion to identify with your students, figure out how they learn best and provide the tools during that training day so that they will learn with the greatest ease and maximum recollection later on. And also that they'll have a great day or days.
es: Como formador, no es tu trabajo ni tu calidad saber todo lo que hay sobre el tema y ser capaz de responder a cualquier pregunta que tengan tus alumnos. Es tu profesión identificarte con tus alumnos, averiguar cómo aprenden mejor y proporcionar las herramientas durante ese día de formación para que aprendan con la mayor facilidad y el máximo recogimiento más adelante. Y también que pasarán un gran día o días.

source: The funny thing is that the more you know about a technical subject yourself, the more difficult it sometimes is to be emphatic and understand the learning difficulties of students. As long as you know 'a bit more' and you're able to transfer that knowledge, you're a trainer!
es: Lo curioso es que cuanto más sabes sobre un tema técnico tú mismo, más difícil es a veces ser enfático y comprender las dificultades de aprendizaje de los estudiantes. Siempre que sepas "un poco más" y seas capaz de transferir ese conocimiento, ¡eres un formador!

source: If you are nervous about getting 'difficult' technical questions from students during the day, try mentioning this in your introduction in the morning. It helps setting expectations:
es: Si te pone nervioso recibir preguntas técnicas 'difíciles' de los estudiantes durante el día, intenta mencionarlo en tu introducción por la mañana. Ayuda a establecer expectativas:

source: "I don't know a lot about Plone. But I know a bit more than you and I'm quite good at explaining and teaching stuff. So I'll probably not be able to answer all the questions you might have, but I have some very smart colleagues and a Plone community that will be able to answer those questions after the training and we'll figure it out."
es: "No sé mucho sobre Plone. Pero sé un poco más que tú y soy bastante bueno explicando y enseñando cosas. Así que probablemente no podré responder a todas las preguntas que puedan tener, pero tengo algunos colegas muy inteligentes y una comunidad de Plone que podrá responder a esas preguntas después de la capacitación y lo resolveremos".
