Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/teachers-training.po
Languages: es

source: After the training: Aftercare, keep in touch, learn, improve
es: Después de la formación: Cuidados posteriores, mantenerse en contacto, aprender, mejorar

source: This chapter is a work in progress
es: Este capítulo es un trabajo en progreso

source: You're done with your training. Or so you think:
es: Has terminado tu entrenamiento. O eso piensas:

source: Aftercare
es: Cuidado por los convalecientes

source: Keep in Touch
es: Mantenerse en contacto

source: Evaluate
es: Evaluar

source: Improve training material
es: Mejora el material de entrenamiento

source: Get quotes
es: Obtener citas

source: Before the training: Create material, invite trainees, preparation
es: Antes del entrenamiento: Crear material, invitar a los alumnos, preparación

source: This chapter is a first version.
es: Este capítulo es una primera versión.

source: Who do you want to give a training to
es: ¿A quién le quieres dar un entrenamiento?

source: Before any training it's a good idea to think about who the stakeholders are for the training. If a Plone user asks you about a training and they want to learn themselves, they are the main stakeholder and you can tailor to their needs. When they're content, you are.
es: Antes de cualquier capacitación, es una buena idea pensar en quiénes son las partes interesadas para la capacitación. Si un usuario de Plone le pregunta sobre una capacitación y quiere aprender por sí mismo, es la parte interesada principal y puede adaptarlo a sus necesidades. Cuando ellos están contentos, tú lo estás.

source: But if the training is part of building a new Plone site for a large organisation and part of the offer was end user training, the manager of the website presence is an important stake holder as well. You cannot depend on the students that they know what they want to learn, or even that they are motivated to learn anything.
es: Pero si la formación forma parte de la construcción de un nuevo sitio de Plone para una gran organización y parte de la oferta era formación para el usuario final, el gestor de la presencia del sitio web también es una parte interesada importante. No se puede depender de que los estudiantes sepan lo que quieren aprender, o incluso que estén motivados para aprender cualquier cosa.

source: For marketing your training it's vital to describe learning goals. What will a student be able to do independently after following your training (tasks). The manager of a larger organisation will use this to select and value your training.
es: Para comercializar su formación, es vital describir los objetivos de aprendizaje. ¿Qué será capaz de hacer un estudiante de forma independiente después de seguir su formación (tareas)? El gerente de una organización más grande usará esto para seleccionar y valorar su capacitación.

source: And even if a webmaster or staring developer will contact you to ask for a training, there's probably a manager behind this person that has to agree with the training.
es: E incluso si un webmaster o un desarrollador principiante se pone en contacto contigo para pedirte una formación, es probable que haya un responsable detrás de esta persona que tenga que estar de acuerdo con la formación.

source: Training information
es: Información de entrenamiento

source: What information do you need to provide to prospects so that they can evaluate your training offer?
es: ¿Qué información necesita proporcionar a los clientes potenciales para que puedan evaluar su oferta de entrenamiento?

source: The basic What, Where, When.
es: Lo básico Qué, Dónde, Cuándo.

source: What are the subjects of your training.
es: ¿Cuáles son los temas de tu entrenamiento?

source: The learning goals. Describe what will a student be able to do after following your training.
es: Los objetivos de aprendizaje. Describa qué podrá hacer un estudiante después de seguir su entrenamiento.

source: Required knowledge. Which skills does a student need before they can participate in your training
es: Conocimientos requeridos. ¿Qué habilidades necesita un estudiante antes de poder participar en su capacitación?

source: Required materials. Do they need a laptop for this training? Does it need admin permissions to install extra software, change the network configuration, have a minimum amount of RAM.
es: Materiales requeridos. ¿Necesitan un portátil para esta formación? ¿Necesita permisos de administrador para instalar software adicional, cambiar la configuración de la red, tener una cantidad mínima de RAM?

source: Show it all or practice the basics
es: Muéstrelo todo o practique lo básico

source: With 'end user' or 'webmaster' kind of trainings there are distinct modes of training you can do. To write it down black/white
es: Con las capacitaciones del tipo 'usuario final' o 'webmaster', hay distintos modos de capacitación que puede realizar. Para escribirlo en blanco y negro

source: Show as much of Plone as you can, so that the students get a good overview of all the options and possibilities.
es: Muestre todo lo que pueda de Plone, para que los estudiantes tengan una buena visión general de todas las opciones y posibilidades.

source: Define a core set of learning goals and tasks that your students should be able to perform at the end of the training day and teach and practice those hands-on as much as you can.
es: Defina un conjunto básico de objetivos y tareas de aprendizaje que sus estudiantes deberían poder realizar al final del día de capacitación y enseñe y practique esos objetivos prácticos tanto como pueda.

source: Probably you will do something in between to provide a good mix between theory, explaining, examples and exercises. But discuss this with the client (manager) who has asked for the training or if your students are allowed to decide this, ask it before or at the beginning of the training. When you are teaching a content editor that **has** to work with Plone next week, practice and stick to the basics. If you have a few webmaster that has some say in how the site will develop in the next years, show more features, options and tricks. (And have some material with references ready after the training that they can look back to.)
es: Probablemente harás algo intermedio para proporcionar una buena mezcla entre teoría, explicación, ejemplos y ejercicios. Pero discuta esto con el cliente (gerente) que ha solicitado la capacitación o si sus estudiantes pueden decidir esto, pregúntelo antes o al comienzo de la capacitación. Cuando le enseñes a un editor de contenido que **tiene** que trabajar con Plone la próxima semana, practica y apégate a lo básico. Si tiene algunos webmasters que tienen algo que decir sobre cómo se desarrollará el sitio en los próximos años, muestre más características, opciones y trucos. (Y tenga algún material con referencias listo después de la capacitación que puedan mirar hacia atrás).

source: Group size, number of trainers
es: Tamaño del grupo, número de entrenadores

source: Depending on how you organise your training material subjects and agenda you can stick with one trainer for a group or you might need multiple trainers during the day.
es: Dependiendo de cómo organices tu material de formación, tus asignaturas y tu agenda, puedes quedarte con un formador para un grupo o puede que necesites varios formadores durante el día.

source: With more than 4-5 people and more difficult subjects you'll probably have to shift to 'classroom' mode: set up a agenda, and stick to it. This is still doable with 1 trainer for 10-20 people, but when the level of individual students varies a lot and you also have and need to do exercises, you'll get stuck with only one trainer.
es: Con más de 4-5 personas y asignaturas más difíciles, probablemente tendrás que cambiar al modo 'aula': establece una agenda y cúmplela. Esto todavía es factible con 1 entrenador para 10-20 personas, pero cuando el nivel de los estudiantes individuales varía mucho y también tienes y necesitas hacer ejercicios, te quedarás atascado con un solo entrenador.

source: Having two trainers is great for educating a second trainer, to monitor the room during a training, silently help students that have questions while the main trainer can continue discussing a subject. Unfortunately it's not always economically viable for smaller groups to have more than one trainer per group.
es: Tener dos entrenadores es excelente para educar a un segundo entrenador, para monitorear la sala durante una capacitación, ayudar silenciosamente a los estudiantes que tienen preguntas mientras el entrenador principal puede continuar discutiendo un tema. Desafortunadamente, no siempre es económicamente viable para los grupos más pequeños tener más de un entrenador por grupo.

source: If you've mastered your training material and know what's in there, giving a training to 2-3 people can be great because you have the option to personalise the training to their needs. But you'll really need to know the subjects.
es: Si has dominado tu material de formación y sabes lo que contiene, dar una formación a 2 o 3 personas puede ser estupendo porque tienes la opción de personalizar la formación según sus necesidades. Pero realmente necesitarás conocer los temas.

source: Contact your students before the training
es: Contacte a sus estudiantes antes del entrenamiento

source: If you are going to teach a smaller group, try to get the contact details of your students and call them a few weeks in advance of the training. Introduce yourself, ask why they are going to follow the training, what their experience is and what they'd like to get out of the training. This doesn't need to take more than 5 minutes and it:
es: Si vas a enseñar a un grupo más pequeño, intenta conseguir los datos de contacto de tus alumnos y llámalos unas semanas antes de la formación. Preséntate, pregúntale por qué van a seguir la capacitación, cuál es su experiencia y qué les gustaría obtener de la capacitación. Esto no tiene por qué llevar más de 5 minutos y:

source: Will make you a lot less nervous about who you are going to meet.
es: Te pondrá mucho menos nervioso sobre a quién vas a conocer.

source: You can identify beforehand if a student will be overqualified for the training and might not learn that much new skills during the training.
es: Puede identificar de antemano si un estudiante estará sobrecalificado para la capacitación y es posible que no aprenda muchas habilidades nuevas durante la capacitación.

source: It's vital to identify those students and move them to another training or let them skip it. Bored students are a jammer during a training, are in most cases unhappy about your training because they haven't learnt anything new, will start to ask 'advanced questions' that are out of scope and distract other students.
es: Es vital identificar a esos estudiantes y moverlos a otra capacitación o dejar que se la salten. Los estudiantes aburridos son un obstáculo durante un entrenamiento, en la mayoría de los casos están descontentos con su entrenamiento porque no han aprendido nada nuevo, comenzarán a hacer "preguntas avanzadas" que están fuera del alcance y distraerán a otros estudiantes.

source: And the reverse: verify that a student meets the minimum required skill for your training. If you don't want to teach HTML two hours before you can explain Zope Page Templates, that's a big win. If you have multiple of these students, discuss what to do with the client: adjust the training, plan a 'beginners' training before this training...
es: Y al revés: verificar que un alumno cumple con la habilidad mínima requerida para su formación. Si no quieres enseñar HTML dos horas antes de poder explicar las plantillas de página de Zope, esa es una gran victoria. Si tienes varios de estos estudiantes, discute qué hacer con el cliente: ajustar el entrenamiento, planificar un entrenamiento de 'principiantes' antes de este entrenamiento...

source: Ask them what they want to learn during the training, or better: ask which problems they currently have while working with Plone. If you know those before hand you can answer those questions during the training and you will have very happy students.
es: Pregúnteles qué quieren aprender durante la formación, o mejor: pregúnteles qué problemas tienen actualmente mientras trabajan con Plone. Si los conoces de antemano, puedes responder a esas preguntas durante la formación y tendrás alumnos muy felices.

source: Re-use and improve the material that is already available
es: Reutilizar y mejorar el material que ya está disponible

source: You are already reading this text so you have found the training material online created by Plone trainers. Re-use as much as you can, give the training and improve the material.
es: Ya estás leyendo este texto, por lo que has encontrado el material de formación en línea creado por los entrenadores de Plone. Reutiliza todo lo que puedas, imparte la formación y mejora el material.

source: One of the most difficult things in providing a training is creating the training material, one of the biggest helps when giving a training is having good training material.
es: Una de las cosas más difíciles a la hora de impartir una formación es crear el material de formación, una de las mayores ayudas a la hora de impartir una formación es tener un buen material de formación.

source: Creating a (new) training will cost a lot of time and it's almost unfeasable to give trainings for a living or earn enough money with trainings if you have to rewrite every training every single time you have to give it. One of the big obstacles in finding and having more Plone trainers world wide is the availability of current and up to date material.
es: Crear una (nueva) formación costará mucho tiempo y es casi imposible dar formaciones para ganarse la vida o ganar suficiente dinero con las formaciones si tienes que reescribir cada formación cada vez que tienes que darla. Uno de los grandes obstáculos para encontrar y tener más entrenadores Plone en todo el mundo es la disponibilidad de material actual y actualizado.

source: The idea of sharing the Plone training material world wide is that you can focus on finding students and preparing and giving a training in a sustainable way and that we share the burden of keeping the training material up to date.
es: La idea de compartir el material de formación de Plone en todo el mundo es que puedas centrarte en encontrar estudiantes y preparar e impartir una formación de forma sostenible y que compartamos la carga de mantener el material de formación actualizado.

source: Verify the training location and facilities
es: Verificar la ubicación e instalaciones de entrenamiento

source: If you organise your own training location you have control over most variables. If the trainings takes place 'on premise' at customer, there are some extra things to watch out for.
es: Si organizas tu propio lugar de entrenamiento, tienes control sobre la mayoría de las variables. Si las capacitaciones se llevan a cabo 'en las instalaciones' del cliente, hay algunas cosas adicionales a tener en cuenta.

source: The most hideous one is when you verify beforehand that there is an internet connection and you find out on the training day it's heaviliy firewalled and you cannot download any package from PyPI. Good luck!
es: La más horrible es cuando verificas de antemano que hay una conexión a Internet y descubres el día de la formación que está fuertemente cortafuegos y que no puedes descargar ningún paquete de PyPI. ¡Buena suerte!

source: Plenty of power outlets.
es: Un montón de enchufes.

source: Networking equipment and enough bandwidth.
es: Equipo de red y ancho de banda suficiente.

source: Have some drinks and snacks ready for the short breaks.
es: Tenga algunas bebidas y refrigerios listos para los pequeños descansos.

source: Have a location where people can walk during a break and in general refresh their minds.
es: Tenga un lugar donde las personas puedan caminar durante un descanso y, en general, refrescar sus mentes.

source: A beamer/projector set up in a room that you don't have to darken too much to see anything.
es: Un proyector/proyector instalado en una habitación que no tienes que oscurecer demasiado para ver nada.

source: Depending on how you teach and which materials you have, it can be great to have two beamers and laptops: on one beamer you can present the agenda, schedule, excercices or training material. And the other laptop/beamer can be dedicated to showing hands-on demo's of editing content, developing, running, whatever.
es: Dependiendo de cómo enseñes y de los materiales que tengas, puede ser estupendo tener dos proyectores y ordenadores portátiles: en un proyector puedes presentar la agenda, el horario, los ejercicios o el material de formación. Y el otro portátil/proyector se puede dedicar a mostrar demostraciones prácticas de edición de contenido, desarrollo, ejecución, lo que sea.

source: Why: It can be quite confusing for student to follow you if you command/alt-tab through windows every 3 seconds and the sentence they were just reading from the training material disappears from view again. It provides extra context.
es: Por qué: Puede ser bastante confuso para el estudiante seguirte si haces comando/alt-tab a través de las ventanas cada 3 segundos y la frase que acababan de leer del material de formación vuelve a desaparecer de la vista. Proporciona un contexto adicional.

source: Depending on the kind of training you give it can be wise to verify the capabilities of the laptops that students have to bring with them to the training if it is for example a developer oriented training.
es: Dependiendo del tipo de formación que impartas, puede ser prudente verificar las capacidades de los portátiles que los estudiantes tienen que llevar consigo a la formación, si se trata, por ejemplo, de una formación orientada a desarrolladores.

source: We've experimented with virtual machines set-ups in the past at PloneConf trainings and there is a lot of development in this area with complete online environments to teach, but in general: verifiy that students have access on their laptops to install stuff admin permissions, if you're going the virtual machine route check that their laptops are capable of running virtual machines. Minimum amount or RAM, etc. etc.
es: Hemos experimentado con configuraciones de máquinas virtuales en el pasado en las capacitaciones de PloneConf y hay mucho desarrollo en esta área con entornos en línea completos para enseñar, pero en general: verifique que los estudiantes tengan acceso en sus computadoras portátiles para instalar cosas con permisos de administrador, si va a la ruta de la máquina virtual, verifique que sus computadoras portátiles sean capaces de ejecutar máquinas virtuales. Cantidad mínima de RAM, etc. etc.

source: Prepare for the worst
es: Preparate para lo peor

source: If you want to be absolutely sure that you can give a training anywhere/anytime, prepare for the worst:
es: Si quieres estar absolutamente seguro de que puedes dar una formación en cualquier lugar y en cualquier momento, prepárate para lo peor:

source: No internet connection. Set up a local pypi mirror for a developer training where you have all the packages available. Bring material with you to set up a local network with an extra Plone server configured and ready if you're doing an end user/webmaster/integrator kind of training.
es: No hay conexión a internet. Configure un espejo pypi local para una capacitación de desarrolladores donde tenga todos los paquetes disponibles. Lleve consigo material para configurar una red local con un servidor Plone adicional configurado y listo si está realizando una capacitación de tipo usuario final/webmaster/integrador.

source: Prepare virtual machine images beforehand that people can use.
es: Prepara imágenes de máquinas virtuales de antemano que las personas pueden usar.

source: Bring some extra power outlets and cabling and a wifi router/base station.
es: Traiga algunas tomas de corriente y cableado adicionales y un enrutador/estación base wifi.

source: Have at least some outlines of your training material with you printed.
es: Imprime al menos algunos esquemas de tu material de capacitación.

source: Have a backup laptop/machine/NUC if you can afford it.
es: Tenga una computadora portátil/máquina/NUC de respaldo si puede permitírselo.

source: During training day(s): what to expect, do's and don'ts
es: Durante el día o días de entrenamiento: qué esperar, qué hacer y qué no hacer

source: This chapter will touch on subjects like:
es: En este capítulo se abordarán temas como:

source: How to structure your training day
es: Cómo estructurar tu día de entrenamiento

source: Getting your trainees 'in sync'
es: Conseguir que tus aprendices estén 'sincronizados'

source: Correcting students when they stray or get noisy
es: Corregir a los estudiantes cuando se desvían o hacen ruido

source: Using material, beamers, etc
es: Usando material, beamers, etc

source: breaks and attention span
es: descansos y capacidad de atención

source: What if you run out of time
es: ¿Qué pasa si te quedas sin tiempo?

source: Student and trainer fatigue
es: Fatiga de estudiantes y entrenadores

source: Trainers high
es: Entrenadores altos

source: Structure of your training day
es: Estructura de tu día de entrenamiento

source: How the agenda of a training day should be structured has already been discussed in the theory and 'before' the training chapters. This section will discuss more 'hands on' tips for during the day and summarize the theory.
es: La forma en que se debe estructurar la agenda de una jornada de formación ya se ha discutido en los capítulos de teoría y 'antes' de la formación. En esta sección se discutirán más consejos prácticos para durante el día y se resumirá la teoría.

source: Be early. It takes at least half an hour to an hour to install yourself. If you're a bit late and students are already arriving it will be even more difficult to finish the set up in time. Also: if you're early and you don't like the chairs/desk set up you can still shift/change some stuff.
es: Llega temprano. Se tarda al menos entre media hora y una hora en instalarlo usted mismo. Si llegas un poco tarde y los estudiantes ya están llegando, será aún más difícil terminar la configuración a tiempo. Además: si llegas temprano y no te gusta la configuración de las sillas / escritorio, aún puedes cambiar/cambiar algunas cosas.

source: Introduction/Agenda
es: Introducción/Agenda

source: Sometimes a trainer shows a short agenda of the day and then continues to the training. The start of a training day is *THE* moment to manage expectations for both your students and you. Things you can do during the introduction:
es: A veces, un entrenador muestra una agenda corta del día y luego continúa con el entrenamiento. El inicio de un día de formación es *EL* momento para gestionar las expectativas tanto para tus alumnos como para ti. Cosas que puedes hacer durante la introducción:

source: Introduce yourself shortly. What have you done before, why are you giving the training, what do you like about giving a training. But don't overdo it :-)
es: Preséntate en breve. ¿Qué has hecho antes?, ¿por qué estás dando la capacitación?, ¿qué es lo que te gusta de dar una capacitación? Pero no te excedas :-)

source: If the group is small enough (and they're not all colleagues) ask them for a short introduction. You might have talked to them before the training, but if they don't know each other it is good to create a good vibe.
es: Si el grupo es lo suficientemente pequeño (y no todos son colegas), pídeles una breve presentación. Es posible que hayas hablado con ellos antes del entrenamiento, pero si no se conocen, es bueno crear un buen ambiente.
