Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: Settings for our theme are declared in the file :file:`manifest.cfg`. It contains settings for CSS files to use for development and production, a CSS file for the content editor TinyMCE and several other optional settings.
es: La configuración de nuestro tema se declara en el archivo :file:`manifest.cfg`. Contiene configuraciones para archivos CSS para usar en desarrollo y producción, un archivo CSS para el editor de contenido TinyMCE y varias otras configuraciones opcionales.

source: The one we get from ``bobtemplates.plone`` looks like this:
es: El que obtenemos de ``bobtemplates.plone`` se ve así:

source: The :file:`development-css` file is used when Plone is running in development mode, otherwise the file defined in :file:`production-css` will be used. The file :file:`tinymce-content-css` tells Plone to load that particular CSS file inside TinyMCE, whenever a TinyMCE rich text field is displayed.
es: El archivo :file:`development-css` se usa cuando Plone se está ejecutando en modo de desarrollo, de lo contrario, se usará el archivo definido en :file:`production-css`. El archivo :file:`tinymce-content-css` le dice a Plone que cargue ese archivo CSS en particular dentro de TinyMCE, siempre que se muestre un campo de texto enriquecido de TinyMCE.

source: After making changes to the file :file:`manifest.cfg`, we need to deactivate/activate the theme for them to take effect.
es: Después de realizar cambios en el archivo :file:`manifest.cfg`, necesitamos desactivar/activar el tema para que surtan efecto.

source: You can read more about the :file:`manifest.cfg` and the available options in the `plone.app.theming documentation <https://docs.plone.org/external/plone.app.theming/docs/index.html#the-manifest-file>`_.
es: Puedes leer más sobre el archivo :file:`manifest.cfg` y las opciones disponibles en la `documentación plone.app.theming <https://docs.plone.org/external/plone.app.theming/docs/index.html#the-manifest-file>`_.

source: Final CSS Customization
es: Personalización final de CSS

source: Our example theme already looks pretty good. But with the help of some CSS we can give it the final touch.
es: Nuestro tema de ejemplo ya se ve bastante bien. Pero con la ayuda de algo de CSS podemos darle el toque final.

source: We will re-use the definition of the ``box`` class from the file :file:`theme/css/business-casual.css` for portlets in the left and right portlet column. Replace the example content with the following Less code in the file :file:`custom.less`:
es: Reutilizaremos la definición de la clase ``box`` del archivo :file:`theme/css/business-casual.css` para los portlets en la columna de portlets izquierda y derecha. Reemplace el contenido de ejemplo con el siguiente código Less en el archivo :file:`custom.less`:

source: Install External CSS And JavaScript Libraries With npm And Use Them In Your Theme
es: Instale bibliotecas externas de CSS y JavaScript con npm y utilícelas en su tema

source: As our theme is based on ``Bootstrap``, we want to install ``Bootstrap`` with :program:`npm` to have more flexibility, for example to use the Less file of Bootstrap.
es: Como nuestro tema está basado en ``Bootstrap``, queremos instalar ``Bootstrap`` con :program:`npm` para tener más flexibilidad, por ejemplo para usar el archivo Less de Bootstrap.

source: To do that, we use :program:`npm`, which we already :doc:`installed in the preparations <theme-package>`.
es: Para ello, utilizamos :program:`npm`, que ya hemos :doc:`instalado en los preparativos <theme-package>`.

source: The following steps are already included in the ``bobtemplates.plone`` template We show them here for documentation reasons, so you see how you can install and use external packages like ``Bootstrap``.
es: Los siguientes pasos ya están incluidos en la plantilla ``bobtemplates.plone`` Los mostramos aquí por razones de documentación, para que veas cómo puedes instalar y usar paquetes externos como ``Bootstrap``.

source: To install ``Bootstrap`` with :program:`npm`, run the following command inside the theme folder:
es: Para instalar ``Bootstrap`` con :program:`npm`, ejecute el siguiente comando dentro de la carpeta del tema:

source: The ``--save`` option will add the ``bootstrap`` package to the file :file:`package.json` in the theme folder for us. Now we can install all dependencies on any other system by running the following command from inside of our theme folder:
es: La opción ``--save`` agregará el paquete ``bootstrap`` al archivo :file:`package.json` en la carpeta del tema por nosotros. Ahora podemos instalar todas las dependencias en cualquier otro sistema ejecutando el siguiente comando desde dentro de nuestra carpeta de temas:

source: Now that we have installed bootstrap using :command:`npm` we have all the ``bootstrap`` components available in the subfolder called :file:`node_modules`:
es: Ahora que hemos instalado bootstrap usando :command:`npm` tenemos todos los componentes de ``bootstrap`` disponibles en la subcarpeta llamada :file:`node_modules`:

source: We will include the "carousel" part and some other bootstrap components which our downloaded theme uses. To do this, we include the required bootstrap components in our :file:`theme.less` file (they were already added from ``bobtemplates.plone``):
es: Incluiremos la parte del "carrusel" y algunos otros componentes de arranque que utiliza nuestro tema descargado. Para hacer esto, incluimos los componentes de arranque requeridos en nuestro archivo :file:`theme.less` (ya se agregaron desde ``bobtemplates.plone``):

source: Here you can see how we include the resources like ``@import "@{bootstrap_path}/carousel.less";`` in our Less file.
es: Aquí puedes ver cómo incluimos los recursos como ``@import "@{bootstrap_path}/carousel.less";`` en nuestro archivo Less.

source: But before they can be used, it is important to add the path to the less files:
es: Pero antes de que se puedan usar, es importante agregar la ruta a los archivos less:

source: This defines the path to the ``bootstrap`` files, so that we can use it in all bootstrap includes.
es: Esto define la ruta a los archivos ``bootstrap``, para que podamos usarlo en todas las inclusiones de bootstrap.

source: Don't forget to run :command:`grunt compile` after you changed any of the Less files or use :command:`grunt watch` to do this automatically after every file change.
es: No olvide ejecutar :command:`grunt compile` después de cambiar cualquiera de los archivos Less o use :command:`grunt watch` para hacer esto automáticamente después de cada cambio de archivo.

source: More Diazo And plone.app.theming Details
es: Más detalles de Diazo y plone.app.theming

source: For more information on how to build a Diazo based theme look at `the diazo documentation <http://docs.diazo.org/en/latest/>`_ and `the plone.app.theming manual <https://docs.plone.org/external/plone.app.theming/docs/index.html>`_.
es: Para obtener más información sobre cómo crear un tema basado en Diazo, consulte la `documentación de Diazo <http://docs.diazo.org/en/latest/>`_ y `el manual de plone.app.theming <https://docs.plone.org/external/plone.app.theming/docs/index.html>`_.

source: In the next part we will :doc:`take a look at template customizations <theme-package-4>` for our theme and :ref:`make the slider dynamic and let users change the pictures for the slider <create-dynamic-slider-content-in-plone>`.
es: En la siguiente parte vamos a :doc:`echar un vistazo a las personalizaciones de plantillas <theme-package-4>` para nuestro tema y :ref:`hacer que el slider sea dinámico y permitir que los usuarios cambien las imágenes para el slider <create-dynamic-slider-content-in-plone>`.

source: Theme Package IV: Creating And Customizing Plone Templates
es: Paquete de temas IV: Creación y personalización de plantillas Plone

source: In the previous sections we :doc:`created our custom theme <theme-package-2>` and :doc:`customized it using CSS <theme-package-3>`. But sometimes CSS isn't enough, sometimes we have to adjust the HTML markup.
es: En las secciones anteriores hemos :doc:`creado nuestro tema personalizado <theme-package-2>` y :doc:`personalizado usando CSS <theme-package-3>`. Pero a veces CSS no es suficiente, a veces tenemos que ajustar el marcado HTML.

source: If we don't want to use Diazo rules and :term:`XSLT` for it, there is another way: customizing templates.
es: Si no queremos usar las reglas de Diazo y :term:`XSLT` para ello, hay otra forma: personalizar las plantillas.

source: In this section we will show you how you can customize existing templates and create new ones specific for your theme.
es: En esta sección te mostraremos cómo puedes personalizar las plantillas existentes y crear otras nuevas específicas para tu tema.

source: Overriding A Plone Template
es: Anulación de una plantilla Plone

source: A large part of the Plone UI is provided by *BrowserView* and *Viewlet* templates.
es: Una gran parte de la interfaz de usuario de Plone la proporcionan las plantillas *BrowserView* y *Viewlet*.

source: You can see all viewlets and their managers (sortable containers) when you view the URL ``./@@manage-viewlets``.
es: Puede ver todos los viewlets y sus administradores (contenedores ordenables) cuando ve la URL ``./@@manage-viewlets``.

source: To override them from the ZMI, you can go to ``./portal_view_customizations``. But this is very limited and does not work for all views.
es: Para anularlos desde el ZMI, puede ir a ``./portal_view_customizations``. Pero esto es muy limitado y no funciona para todos los puntos de vista.

source: To override them from your theme product, the best way is to use ``z3c.jbot`` (Just a Bunch of Templates).
es: Para anularlos desde su producto temático, la mejor manera es usar el paquete ``z3c.jbot`` (Just a Bunch of Templates).

source: Since jbot is already included in the ``bobtemplates.plone`` theme skeleton via ``plone.app.themingplugins``, you can start using it immediately by adding all the templates you want to override in the :file:`src/ploneconf/theme/theme/template-overrides` directory.
es: Dado que jbot ya está incluido en el esqueleto del tema en ``bobtemplates.plone`` a través del paquete ``plone.app.themingplugins``, puedes empezar a usarlo inmediatamente añadiendo todas las plantillas que quieras anular en el directorio :file:`src/ploneconf/theme/theme/template-overrides`.

source: In order for jbot to match the override to the template which is being overridden, the name of the *new* template needs to include the complete path to the original template as a prefix (with every ``/`` replaced by a ``.``).
es: Para que jbot coincida con la anulación de la plantilla que se está anulando, el nombre de la *nueva* plantilla debe incluir la ruta completa a la plantilla original como prefijo (con cada ``/`` reemplazado por un ``.``).

source: For instance, to override the :file:`path_bar.pt` template (the breadcrumbs) from ``plone.app.layout``, knowing that this template is found in a sub folder named ``viewlets``, you need to name the overriding template :file:`plone.app.layout.viewlets.path_bar.pt`.
es: Por ejemplo, para anular la plantilla :file:`path_bar.pt` (las migas de pan) del paquete ``plone.app.layout``, sabiendo que esta plantilla se encuentra en una subcarpeta llamada ``viewlets``, debe nombrar la plantilla de reemplazo :file:`plone.app.layout.viewlets.path_bar.pt`.

source: Clicking the template in ZMI > portal_view_customizations is a handy way to find the template path. You can also copy the original template's code here.
es: Hacer clic en la plantilla en ZMI > portal_view_customizations es una forma práctica de encontrar la ruta de la plantilla. También puedes copiar el código de la plantilla original aquí.

source: When a new override has been added, the Plone instance needs to be restarted. After this, a page reload is enough to see any changes to the template.
es: Cuando se ha agregado una nueva invalidación, es necesario reiniciar la instancia de Plone. Después de esto, una recarga de página es suficiente para ver cualquier cambio en la plantilla.

source: Example: Overriding The Event Item Template
es: Ejemplo: Reemplazar la plantilla de elemento de evento

source: The path to the original template is :file:`plone/app/event/browser/event_view.pt`, the full dotted name for our replacement template should be: :file:`plone.app.event.browser.event_view.pt`.
es: La ruta a la plantilla original es :file:`plone/app/event/browser/event_view.pt`, el nombre completo con puntos para nuestra plantilla de reemplazo debería ser: :file:`plone.app.event.browser.event_view.pt`.

source: Create a new file with this dotted name into the :file:`template-overrides` folder.
es: Cree un nuevo archivo con este nombre punteado en la carpeta :file:`template-overrides`.

source: Let's say we want to move the full text of the event item to appear before the event details block. To do this, we copy over the original template code and change the order of the two blocks:
es: Supongamos que queremos mover el texto completo del elemento del evento para que aparezca antes del bloque de detalles del evento. Para ello, copiamos el código de la plantilla original y cambiamos el orden de los dos bloques:

source: You can now restart Plone and view an event to see the effect.
es: Ahora puede reiniciar Plone y ver un evento para ver el efecto.

source: If your buildout is using ``omelette``, you can find the original template in :file:`buildout/parts/omelette/plone/app/event/browser`.
es: Si tu buildout está usando ``omelette``, puedes encontrar la plantilla original en :file:`buildout/parts/omelette/plone/app/event/browser`.

source: Creating A New Plone Template
es: Creación de una nueva plantilla Plone

source: Create Dynamic Slider Content In Plone
es: Crear contenido de control deslizante dinámico en Plone

source: To render our dynamic content for the slider we need a custom view in Plone. There are various ways to create views.
es: Para renderizar nuestro contenido dinámico para el control deslizante, necesitamos una vista personalizada en Plone. Hay varias formas de crear vistas.

source: For now, we will use a very simple template-only-view via ``jbot`` and ``themingplugins``. The ``bobtemplates.plone`` skeleton includes already everything you need.
es: Por ahora, usaremos una vista de solo plantilla muy simple a través de ``jbot`` y ``themingplugins``. El esqueleto ``bobtemplates.plone`` ya incluye todo lo que necesitas.

source: The only thing we need to do, is to add a template file in the :file:`theme/views` folder. Here we create a template file named :file:`slider-images.pt`.
es: Lo único que tenemos que hacer es añadir un archivo de plantilla en la carpeta :file:`theme/views`. Aquí creamos un archivo de plantilla llamado :file:`slider-images.pt`.

source: And we already have this file as an example.
es: Y ya tenemos este archivo como ejemplo.

source: The only thing we need to do is to rename the file :file:`slider-images.pt.example` to :file:`slider-images.pt`.
es: Lo único que tenemos que hacer es cambiar el nombre del archivo :file:`slider-images.pt.example` a :file:`slider-images.pt`.

source: The template code looks like this:
es: El código de la plantilla tiene el siguiente aspecto:

source: This is all that's required to create a very simple template-only view. You can test the view after restarting your Plone instance.
es: Esto es todo lo que se requiere para crear una vista de solo plantilla muy simple. Puede probar la vista después de reiniciar la instancia de Plone.

source: For the view to show up, it needs some images to display. To supply the images, we have to create a folder in Plone named ``slider-images`` and add some images there.
es: Para que la vista aparezca, necesita que se muestren algunas imágenes. Para proporcionar las imágenes, tenemos que crear una carpeta en Plone llamada ``slider-images`` y agregar algunas imágenes allí.

source: We will show you later how to :ref:`create initial content for the theme <creating-initial-content-for-the-theme>`
es: Más adelante te mostraremos cómo :ref:`crear contenido inicial para el tema <creating-initial-content-for-the-theme>`

source: Now we can browse to the View on this folder by visiting: http://localhost:8080/Plone/slider-images/@@slider-images. This will render the markup required to render the slider.
es: Ahora podemos navegar a la Vista en esta carpeta visitando: http://localhost:8080/Plone/slider-images/@@slider-images. Esto renderizará el marcado necesario para representar el control deslizante.

source: Use The Dynamic Slider Content From Plone
es: Usar el contenido del control deslizante dinámico de Plone

source: Now that we have our ``slider-images`` view which renders our HTML markup for the slider, we need to replace that with the static markup in our template.
es: Ahora que tenemos nuestra vista ``slider-images`` que renderiza nuestro marcado HTML para el deslizador, necesitamos reemplazarlo con el marcado estático en nuestra plantilla.

source: For that we use Diazo's ability to load the content from other URLs, using the ``href`` attribute in our :file:`rules.xml`.
es: Para ello, utilizamos la capacidad de Diazo de cargar el contenido de otras URLs, utilizando el atributo ``href`` en nuestro archivo :file:`rules.xml`.

source: We also make use of the ``css:if-content`` attribute to make sure it is only on the front page:
es: También hacemos uso del atributo ``css:if-content`` para asegurarnos de que solo esté en la página principal:

source: Theme Package V: Creating Initial Content
es: Paquete de temas V: Creación de contenido inicial

source: Our theme relies on some initial content structure, specifically the :file:`slider-images` folder with some images inside.
es: Nuestro tema se basa en alguna estructura de contenido inicial, específicamente la carpeta :file:`slider-images` con algunas imágenes dentro.

source: We will improve our theme package to create this content on install.
es: Mejoraremos nuestro paquete de temas para crear este contenido en la instalación.

source: To do that we create the :file:`slider-images` folder in our :file:`setuphandlers.py` and load some example images into that folder.
es: Para hacer eso, creamos la carpeta :file:`slider-images` en nuestro archivo :file:`setuphandlers.py` y cargamos algunas imágenes de ejemplo en esa carpeta.

source: We will add some images tp the :file:`theme/img` folder. To create the folder and the images add the following code in your setuphandlers.py:
es: Añadiremos algunas imágenes a la carpeta :file:`theme/img`. Para crear la carpeta y las imágenes, agregue el siguiente código en su :file:`setuphandlers.py`:

source: After adding this code to the file :file:`setuphandlers.py`, we need to restart Plone and uninstall/install our theme package add-on.
es: Después de agregar este código al archivo :file:`setuphandlers.py`, necesitamos reiniciar Plone y desinstalar/instalar nuestro complemento del paquete de temas.

source: Theme Package VI: Using TinyMCE Templates
es: Paquete de temas VI: Uso de plantillas TinyMCE

source: TinyMCE has a *templates* plugin which provides an easy way to create complex content in TinyMCE.
es: TinyMCE tiene un complemento de *plantillas* que proporciona una manera fácil de crear contenido complejo en TinyMCE.

source: You can use that to help users to add complex content structures like predefined tables or content.
es: Puede usarlo para ayudar a los usuarios a agregar estructuras de contenido complejas como tablas o contenido predefinido.

source: The users then need to customize this content to their needs.
es: Luego, los usuarios deben personalizar este contenido según sus necesidades.

source: Create Your Own TinyMCE Templates
es: Crea tus propias plantillas de TinyMCE

source: We already have a folder named :file:`tinymce-templates` in our theme folder. ``bobtemplates.plone`` already created an example template for us, but we will add another one.
es: Ya tenemos una carpeta llamada :file:`tinymce-templates` en nuestra carpeta de temas. ``bobtemplates.plone`` ya creó una plantilla de ejemplo para nosotros, pero agregaremos otra.

source: To create our first template we will add a new file named :file:`content-box.html` in this folder:
es: Para crear nuestra primera plantilla, agregaremos un nuevo archivo llamado :file:`content-box.html` en esta carpeta:

source: In the file :file:`content-box.html` we add the following HTML template content:
es: En el archivo :file:`content-box.html` añadimos el siguiente contenido de plantilla HTML:

source: This is the template content we will get in TinyMCE when we use this template.
es: Este es el contenido de la plantilla que obtendremos en TinyMCE cuando utilicemos esta plantilla.

source: In the next section we will see how we activate that template in our theme.
es: En el siguiente apartado veremos cómo activamos esa plantilla en nuestro tema.

source: Activate TinyMCE Templates Plugin
es: Activar el plugin de plantillas TinyMCE

source: The activation of the TinyMCE template plugin is already provided by ``bobtemplates.plone``. The only thing we have to do is to add our template to the registry in the file :file:`ploneconf.theme/src/ploneconf/theme/profiles/default/registry.xml`, like described below.
es: La activación del plugin de plantillas TinyMCE ya está proporcionada por el paquete ``bobtemplates.plone``. Lo único que tenemos que hacer es añadir nuestra plantilla al registro en el archivo :file:`ploneconf.theme/src/ploneconf/theme/profiles/default/registry.xml`, como se describe a continuación.

source: If the plugin is not already activated, you can activate it using the ``plone.custom_plugins`` record:
es: Si el plugin aún no está activado, puedes activarlo usando el registro ``plone.custom_plugins``:

source: In the next step we have to register our newly created TinyMCE template so we can use it in our Plone website.
es: En el siguiente paso tenemos que registrar nuestra plantilla TinyMCE recién creada para que podamos usarla en nuestro sitio web de Plone.

source: To add the registration, we have to extend the ``plone.templates`` record:
es: Para agregar el registro, tenemos que extender el registro ``plone.templates``:

source: After adding this code to the file :file:`registry.xml`, we need to restart Plone and uninstall/install our theme package add-on.
es: Después de agregar este código al archivo :file:`registry.xml`, necesitamos reiniciar Plone y desinstalar/instalar nuestro complemento de paquete de temas.

source: You can also add the template TTW (Trough-The-Web) in the TinyMCE control panel by updating the following snippet (*Plugins and Toolbar* tab, *Templates* setting):
es: También puede agregar la plantilla TTW (Trough-The-Web) en el panel de control de TinyMCE actualizando el siguiente fragmento (pestaña *Plugins y barra de herramientas*, configuración de *Plantillas*):

source: Remember to activate the plugin TTW (Through-The-Web) as well in the *Plugins and Toolbar* tab, *Custom plugins* setting:
es: Recuerde activar el plugin TTW (Through-The-Web) también en la pestaña *Plugins y barra de herramientas*, configuración de *Plugins personalizados*:

source: Use TinyMCE Templates For Content Creation
es: Utilice las plantillas de TinyMCE para la creación de contenido

source: We can add template-based content from the *Insert* menu > *Insert template*:
es: Podemos añadir contenido basado en plantillas desde el menú *Insertar* > *Insertar plantilla*:

source: Now we can choose one of the existing TinyMCE templates:
es: Ahora podemos elegir una de las plantillas de TinyMCE existentes:
