Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: In fact, if you use a better theme template then this one - where more useful CSS classes and id's are used and the grid is defined in CSS/Less and not in the HTML markup itself - it is a lot easier to work with without touching the template. But we decided to use this popular template as an example and therefor we have to make changes to the template itself.
es: De hecho, si usas una plantilla de tema mejor que esta, donde se usan clases CSS e identificadores más útiles y la cuadrícula se define en CSS/Less y no en el marcado HTML en sí, es mucho más fácil trabajar sin tocar la plantilla. Pero decidimos usar esta plantilla popular como ejemplo y, por lo tanto, tenemos que hacer cambios en la plantilla en sí.

source: Customizing The Ruleset
es: Personalización del conjunto de reglas

source: In this section we will adjust the Diazo rules to place the Plone content into the predefined template sections.
es: En esta sección ajustaremos las reglas de Diazo para colocar el contenido de Plone en las secciones de plantilla predefinidas.

source: Plone Toolbar
es: Barra de herramientas de Plone

source: We start with the toolbar since it is the most important part of the Plone site (for logged in users). So let's first make sure we have it in our theme template. We already have the required Diazo rule in our :file:`rules.xml`:
es: Comenzamos con la barra de herramientas, ya que es la parte más importante del sitio de Plone (para los usuarios registrados). Así que primero asegurémonos de tenerlo en nuestra plantilla de tema. Ya tenemos la regla Diazo requerida en nuestro :file:`rules.xml`:

source: The only thing we need is the corresponding HTML part in our theme template:
es: Lo único que necesitamos es la parte HTML correspondiente en nuestra plantilla de tema:

source: You can add it right after the opening body tag in your :file:`index.html`.
es: Puedes agregarlo justo después de la etiqueta de cuerpo de apertura en tu :file:`index.html`.

source: Unthemed Backend
es: Backend sin tema

source: If the only thing you want to do is theme your frontend, and use the default Barceloneta theme for your backend (edit, folder contents, settings), you can include Barceloneta's :file:`backend.xml`.
es: Si lo único que quieres hacer es tematizar tu frontend, y usar el tema predeterminado de la Barceloneta para tu backend (edición, contenido de la carpeta, configuración), puedes incluir el :file:`backend.xml` de Barceloneta.

source: To only have your frontend theme rules active when you visit the frontend part of your site, you can wrap the existing rules into another ``rules`` block:
es: Para que solo tengas activas las reglas de tu tema de frontend cuando visites la parte de frontend de tu sitio, puedes envolver las reglas existentes en otro bloque de ```rules``:

source: Note that we include the file from the theme directly, and don't use the one we got from :py:mod:`bobtemplates.plone`.
es: Ten en cuenta que incluimos el archivo del tema directamente, y no usas el que obtuvimos de :py:mod:`bobtemplates.plone`.

source: Login Link & Co
es: Enlace de inicio de sesión & Co

source: If you want to have a login link for your users, you can put this placeholder in your theme template where you want the link to display. You can always login into the Plone site by adding ``/login`` to the Plone url, so it's optional.
es: Si desea tener un enlace de inicio de sesión para sus usuarios, puede colocar este marcador de posición en la plantilla de su tema donde desea que se muestre el enlace. Siempre puede iniciar sesión en el sitio de Plone agregando ``/login`` a la URL de Plone, por lo que es opcional.

source: You can add it right before the tag ``<div class="brand">Business Casual</div>`` in your :file:`index.html`.
es: Puede agregarlo justo antes de la etiqueta ``<div class="brand">Casual de negocios</div>`` en tu :file:`index.html`.

source: The necessary rule to fill this with the Plone login link is already in our rules.xml. But because the id for the anonymous tools in Plone changed in one of the recent versions, we have to update it (change ``#portal-personaltools-wrapper`` to ``#portal-anontools``):
es: La regla necesaria para completar esto con el enlace de inicio de sesión de Plone ya está en nuestro rules.xml. Pero debido a que el id de las herramientas anónimas en Plone cambió en una de las versiones recientes, tenemos que actualizarlo (cambiar ``#portal-personaltools-wrapper`` a ``#portal-anontools``):

source: This will replace your placeholder with ``#portal-anontools`` from Plone (for example the login link). The link will only be inserted if the user is not already logged in.
es: Esto reemplazará su marcador de posición con ``#portal-anontools`` de Plone (por ejemplo, el enlace de inicio de sesión). El enlace solo se insertará si el usuario aún no ha iniciado sesión.

source: Top Navigation
es: Navegación superior

source: In the next step we will replace the menu placeholder with the real Plone top-navigation links. To do this we adjust this rule from Barceloneta:
es: En el siguiente paso, reemplazaremos el marcador de posición del menú con los enlaces de navegación superior reales de Plone. Para ello ajustamos esta regla desde el tema Barceloneta:

source: Change the rule to the following:
es: Cambie la regla por la siguiente:

source: Here we take the list of links from Plone and replace the placeholder links in the theme. The Barceloneta rule copies the whole navigation container into the theme, but we only need to copy the links over.
es: Aquí tomamos la lista de enlaces de Plone y reemplazamos los enlaces de marcador de posición en el tema. La regla de la Barceloneta copia todo el contenedor de navegación en el tema, pero solo tenemos que copiar los enlaces.

source: Breadcrumbs & Co
es: Migas de pan y compañía

source: Plone provides some viewlets like the breadcrumbs (showing the current path) which are rendered in the *above the content* area.
es: Plone proporciona algunos viewlets como las migas de pan (que muestran la ruta actual) que se representan en el área *por encima del contenido*.

source: We already have the required rule to insert the Plone above-content viewlets into the theme:
es: Ya tenemos la regla necesaria para insertar los viewlets de Plone sobre el contenido en el tema:

source: All we have to do to get this into the theme layout is to add a placeholder with the CSS id ``#above-content`` to the theme's :file:`index.html`.
es: Todo lo que tenemos que hacer para incluir esto en el diseño del tema es agregar un marcador de posición con el ID CSS ``#above-content`` al archivo :file:`index.html` del tema.

source: We can add this for example as a first element in the main container with the CSS class ``.container``, after the main navigation:
es: Podemos agregar esto, por ejemplo, como primer elemento en el contenedor principal con la clase CSS ``.container``, después de la navegación principal:

source: This will bring over everything from the ``viewlet-above-content`` block from Plone. It also includes the breadcrumbs bar.
es: Esto traerá todo desde el bloque ``viewlet-above-content`` de Plone. También incluye la barra de migas de pan.

source: Because our current theme does not provide a breadcrumbs bar, we can drop it from the Plone content, like this:
es: Debido a que nuestro tema actual no proporciona una barra de migas de pan, podemos eliminarlo del contenido de Plone, de esta manera:

source: If you only want to drop this for non-administrators, you can do it like this:
es: Si solo desea eliminar esto para los no administradores, puede hacerlo de la siguiente manera:

source: Or for anonymous users only:
es: O solo para usuarios anónimos:

source: The classes like *userrole-anonymous* are provided by Plone in the ``body`` tag.
es: Las clases como *userrole-anonymous* son proporcionadas por Plone en la etiqueta ``body``.

source: Slider Only On Front Page
es: Control deslizante solo en la página principal

source: We want the slider in the template to be only visible on the front page. To make this easier, we add the CSS-ID ``#front-page-slider`` to the outer row ``div``-tag which contains the slider:
es: Queremos que el control deslizante de la plantilla solo sea visible en la página principal. Para hacer esto más fácil, añadimos el CSS-ID ``#front-page-slider`` a la fila exterior etiqueta ``div`` que contiene el slider:

source: Now we can drop it if we are not on the front page and also in some other situations:
es: Ahora podemos soltarlo si no estamos en la portada y también en algunas otras situaciones:

source: Currently the slider is still static, but we will change that later in :ref:`create-dynamic-slider-content-in-plone`.
es: Actualmente, el control deslizante sigue siendo estático, pero lo cambiaremos más adelante en :ref:`create-dynamic-slider-content-in-plone`.

source: Title And Description
es: Título y descripción

source: The front page with the slider gives us a nice structure we can use for our title and description. We will use the ``<h1>`` tag with the class ``brand-name`` for the title and the following ``<h2>`` tag for the description. There is also an ``<h2>`` tag with the class ``brand-before`` which we don't need, so we will remove it.
es: La página principal con el control deslizante nos da una estructura agradable que podemos usar para nuestro título y descripción. Usaremos el ``<h1>`` con la clase ``brand-name`` para el título y el siguiente ``<h2>`` para la descripción. También hay un ``<h2>`` con la clase ``brand-before``' que no necesitamos, por lo que la eliminaremos.

source: The resulting block of rules can be wrapped into a separate ``rules`` tag with the ``css:if-content`` condition, so we only have to write this once:
es: El bloque de reglas resultante se puede envolver en una etiqueta ``rules`` separada con la condición ``css:if-content``, por lo que solo tenemos que escribir esto una vez:

source: If we are on the front page, the Plone title will be placed inside the tag with the class ``brand-name``. For all other pages, the title and description stay at their place in the content area.
es: Si estamos en la portada, el título de Plone se colocará dentro de la etiqueta con la clase ``brand-name``. Para todas las demás páginas, el título y la descripción permanecen en su lugar en el área de contenido.

source: Status Messages
es: Mensajes de estado

source: Plone will render status messages in an element with the CSS-ID ``#global_statusmessage``. To show the messages in our theme, we have to add another placeholder into our theme template (e.g. next to the ``above-content`` viewlets):
es: Plone renderizará los mensajes de estado en un elemento con el CSS-ID ``#global_statusmessage``. Para mostrar los mensajes en nuestro tema, tenemos que agregar otro marcador de posición a nuestra plantilla de tema (por ejemplo, al lado de los viewlets ``above-content``):

source: The necessary rule is already available:
es: La regla necesaria ya está disponible:

source: To test that the status messages are working, you can for example edit the front page and then click on cancel or save, which will give you a confirmation message from Plone.
es: Para comprobar que los mensajes de estado funcionan, puedes, por ejemplo, editar la página principal y luego hacer clic en cancelar o guardar, lo que te dará un mensaje de confirmación de Plone.

source: Main Content Area
es: Área de contenido principal

source: To make the Plone content area flexible and containing the correct Twitter Bootstrap grid classes, we use an inline :term:`XSLT` snippet. This is already available in our :file:`rules.xml` file, but it needs some customization for our theme:
es: Para que el área de contenido de Plone sea flexible y contenga las clases de cuadrícula correctas de Twitter Bootstrap, usamos un fragmento :term:`XSLT` en línea. Esto ya está disponible en nuestro archivo :file:`rules.xml`, pero necesita cierta personalización para nuestro tema:

source: We need to wrap the grid columns into an element with the class ``box`` and ``clearfix``.
es: Necesitamos envolver las columnas de la cuadrícula en un elemento con la clase ``box`` y ``clearfix``.

source: We have to adjust the CSS class depending on the available portlets.
es: Tenemos que ajustar la clase CSS en función de los portlets disponibles.

source: This code will add the correct Twitter Bootstrap grid classes to the content columns, depending on a one-, two- or three-column-layout. We had to adjust the column classes (we added ``col-md-push-3``) to push the main content (visually) after the 1st portlet column, if this one is available.
es: Este código agregará las clases de cuadrícula de Twitter Bootstrap correctas a las columnas de contenido, dependiendo de un diseño de una, dos o tres columnas. Tuvimos que ajustar las clases de columna (añadimos ``col-md-push-3``) para empujar el contenido principal (visualmente) después de la 1ª columna del portlet, si esta está disponible.

source: For our template we also need to wrap the content and the viewlets showing below the content in a ``<div>`` tag with the CSS class ``box``. This will add the shiny white transparent background.
es: Para nuestra plantilla, también necesitamos envolver el contenido y los viewlets que se muestran debajo del contenido en una etiqueta ``<div>`` con la clase CSS ``box``. Esto agregará el fondo blanco transparente brillante.

source: We also changed the column classes to use the ``col-sm-*`` size for small screens to use the full width and the ``col-md-*`` size for mid-size screens to use a column layout. This fits better on smaller screen sizes.
es: También cambiamos las clases de columna para usar el tamaño ``col-sm-*`` para pantallas pequeñas para usar el ancho completo y el tamaño ``col-md-*`` para pantallas de tamaño mediano para usar un diseño de columna. Esto se adapta mejor a tamaños de pantalla más pequeños.

source: Left And Right Columns
es: Columnas izquierda y derecha

source: We already added the necessary placeholders ``column1-container`` and ``column2-container`` for the two portlet columns to our template. The next set of rules will add the left and right portlet columns from Plone into the theme, and also change their markup to be an ``<aside>`` element instead of a normal ``<div>`` tag.
es: Ya hemos añadido los marcadores de posición necesarios ``column1-container`` y ``column2-container`` para las dos columnas de portlet a nuestra plantilla. El siguiente conjunto de reglas agregará las columnas de portlet izquierdo y derecho de Plone al tema, y también cambiará su marcado para que sea un ``<aside>`` en lugar de un elemento normal ``<div>``.

source: Because the main content column is coming before the two portlet columns, but we want to have the 1st column appear on the left side, we need to *pull* the column before the main content. This is done with the CSS classes ``col-md-pull-6`` (if both portlet columns are available) and ``col-md-pull-9`` (if only the left column is available).
es: Debido a que la columna de contenido principal viene antes de las dos columnas del portlet, pero queremos que la primera columna aparezca en el lado izquierdo, necesitamos *tirar* de la columna antes del contenido principal. Esto se hace con las clases CSS ``col-md-pull-6`` (si ambas columnas de portlet están disponibles) y ``col-md-pull-9`` (si solo está disponible la columna de la izquierda).

source: Another thing we have to change are the CSS-IDs for the columns. The ruleset we got from ``bobtemplates.plone`` assigned the ID ``sidebar`` twice, which is not valid HTML.
es: Otra cosa que tenemos que cambiar son los CSS-IDs para las columnas. El conjunto de reglas que obtuvimos de ``bobtemplates.plone`` asignó el ID ``sidebar`` dos veces, lo cual no es HTML válido.

source: Footer Area
es: Area del pie de página

source: Last but not least we have to integrate the footer area from Plone. The rule to move all footer portlets at once is already available, the only thing we have to adjust is the selector for the theme:
es: Por último, pero no menos importante, tenemos que integrar el área de pie de página de Plone. La regla para mover todos los portlets de pie de página a la vez ya está disponible, lo único que tenemos que ajustar es el selector para el tema:

source: If we want to go advanced, we can create a doormat like footer. Therefore, we first have to select the *footer*, *site actions* and *colophon* (which are the default portlets available in the footer) and move them into place:
es: Si queremos ir avanzados, podemos crear un felpudo como pie de página. Por lo tanto, primero tenemos que seleccionar el *pie de página*, las *acciones del sitio* y el *colofón* (que son los portlets predeterminados disponibles en el pie de página) y moverlos a su lugar:

source: Next we have to select all other available footer portlets, if any, and add them before the *footer*, *site actions* and *colophon* portlets in the footer area.
es: A continuación, tenemos que seleccionar todos los demás portlets de pie de página disponibles, si los hay, y añadirlos antes de los portlets *footer*, *site actions* y *colophon* en el área del pie de página.

source: We will count the amount of portlets, and based on the number we get we set the column classes.
es: Contaremos la cantidad de portlets, y en función del número que obtengamos establecemos las clases de columna.

source: That was basically all to bring the theme together with the dynamic elements from Plone. The next part will :doc:`cover necessary CSS customizations <theme-package-3>` for our theme. Later we will :ref:`make the slider dynamic and let users change the pictures for the slider <create-dynamic-slider-content-in-plone>`.
es: Básicamente, eso fue todo para unir el tema con los elementos dinámicos de Plone. La siguiente parte :doc:`cubrir las personalizaciones CSS necesarias <theme-package-3>` para nuestro tema. Más tarde haremos :ref:`hacer que el control deslizante sea dinámico y permitiremos que los usuarios cambien las imágenes para el control deslizante <create-dynamic-slider-content-in-plone>`.

source: Theme Package III: Customizations
es: Paquete de temas III: Personalizaciones

source: In the previous sections we :doc:`prepared our setup <theme-package>` and :doc:`created our custom theme, adjusted the template and modified and added some Diazo rules <theme-package-2>`.
es: En las secciones anteriores hemos :doc:`preparado nuestra configuración <theme-package>` y :doc:`hemos creado nuestro tema personalizado, hemos ajustado la plantilla y hemos modificado y añadido algunas reglas de Diazo <theme-package-2>`.

source: We will add some final customizations to the theme using CSS and define theme attributes.
es: Agregaremos algunas personalizaciones finales al tema usando CSS y definiremos los atributos del tema.

source: Understanding And Using The Grunt Build System
es: Comprensión y uso del sistema de compilación Grunt

source: Before we begin customizing the CSS for our theme we have to take a look at the :term:`Grunt` Task Runner. We already have a ``Gruntfile.js`` - generated by ``bobtemplates.plone`` - in the top level directory of our theme package.
es: Antes de comenzar a personalizar el CSS para nuestro tema, tenemos que echar un vistazo al :term:`Grunt` Task Runner. Ya tenemos un ``Gruntfile.js`` - generado por ``bobtemplates.plone`` - en el directorio de nivel superior de nuestro paquete de temas.

source: For our example we have to adjust the configuration for the ``browserSync:html`` and ``browserSync:plone`` tasks.
es: Para nuestro ejemplo, tenemos que ajustar la configuración para las tareas ``browserSync:html`` y ``browserSync:plone``.

source: This allows us to get automatic reloads in the browser when we work on the HTML template (with or without Plone) and change any of the configured files (more on that later in this chapter).
es: Esto nos permite obtener recargas automáticas en el navegador cuando trabajamos en la plantilla HTML (con o sin Plone) y cambiar cualquiera de los archivos configurados (más sobre esto más adelante en este capítulo).

source: At the end of the file we can see some registered :term:`Grunt` tasks. We can use these tasks to control what happens when we run the :command:`grunt` command.
es: Al final del archivo podemos ver algunas tareas registradas :term:`Grunt`. Podemos usar estas tareas para controlar lo que sucede cuando ejecutamos el comando :command:`grunt`.

source: By default, :command:`grunt` will run the :command:`compile` task, which compiles the configured Less files into CSS and afterwards transforms the generated CSS with :command:`postcss`:
es: De forma predeterminada, :command:`grunt` ejecutará la tarea :command:`compile`, que compila los archivos Less configurados en CSS y luego transforma el CSS generado con :command:`postcss`:

source: We can automate this task by running :command:`grunt watch`, which will check the configured Less files for changes. If you change on of the Less files, you will see the output on the command line:
es: Podemos automatizar esta tarea ejecutando :command:`grunt watch`, que comprobará los archivos Less configurados en busca de cambios. Si cambia uno de los archivos Less, verá el resultado en la línea de comandos:

source: There are also two ``browserSync`` tasks pre-configured. The first one, ``bsync`` will watch for changes on the template files and reload the browser window for you automatically. This is especially useful when you want to make bigger changes on the template itself, without the Plone related Diazo rules.
es: También hay dos tareas ``browserSync`` preconfiguradas. El primero, ``bsync`` buscará cambios en los archivos de plantilla y volverá a cargar la ventana del navegador automáticamente. Esto es especialmente útil cuando desea realizar cambios más grandes en la plantilla en sí, sin las reglas de Diazo relacionadas con Plone.

source: The next task, ``plone-bsync``, will connect to your development Plone instance and open another browser window for you. If you now change one of the configured theme files in the :file:`less` or :file:`barceloneta` folder, the files will be compiled to CSS and your browser window will reload.
es: La siguiente tarea, ``plone-bsync``, se conectará a su instancia de desarrollo de Plone y abrirá otra ventana del navegador para usted. Si ahora cambias uno de los archivos de tema configurados en la carpeta :file:`less` o :file:`Barceloneta`, los archivos se compilarán en CSS y se volverá a cargar la ventana de tu navegador.

source: A change of the HTML template file :file:`index.html` or Diazo rules file :file:`rules.xml` will reload your browser as well:
es: Un cambio en el archivo de plantilla HTML :file:`index.html` o el archivo de reglas de Diazo :file:`rules.xml` también recargará su navegador:

source: Don't forget to start your Plone instance.
es: No olvide iniciar su instancia de Plone.

source: If you use other ports or IP addresses for your Plone backend, you have to adjust the proxy settings in the :file:`Gruntfile.js` to match your Plone configuration.
es: Si utiliza otros puertos o direcciones IP para su backend de Plone, debe ajustar la configuración del proxy en el :file:`Gruntfile.js` para que coincida con su configuración de Plone.

source: Theme :file:`manifest.cfg`
es: Tema :file:`manifest.cfg`
