Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: For more TTW (Through-The-Web) configuring and customizing options, see :ref:`ttw-label`.
es: Para obtener más opciones de configuración y personalización de TTW (Through-The-Web), consulte :ref:`ttw-label`.

source: Now, let's see how you can re-use it in another Plone site.
es: Ahora, veamos cómo puedes reutilizarlo en otro sitio de Plone.

source: Go back to :guilabel:`Theming` control panel.
es: Vuelva al panel de control :guilabel:`Temas`.

source: Click the :guilabel:`Download` button in the box of your theme.
es: Haga clic en el botón :guilabel:`Descargar` en el cuadro de su tema.

source: The browser will download a zip file.
es: El navegador descargará un archivo zip.

source: Go to the :term:`ZMI` root.
es: Vaya a la raíz :term:`ZMI`.

source: Create a new Plone site.
es: Cree un nuevo sitio de Plone.

source: Go to the :guilabel:`Theming` control panel in that new Plone site.
es: Vaya al panel de control :guilabel:'Temas' en ese nuevo sitio de Plone.

source: Click on the :guilabel:`Upload zip file` button and select your downloaded theme.
es: Haga clic en el botón :guilabel:'Cargar archivo zip' y seleccione el tema descargado.

source: Tick :guilabel:`Immediately enable new theme` and click on :guilabel:`Import`.
es: Marque :guilabel:`Habilitar inmediatamente nuevo tema` y haga clic en :guilabel:`Importar`.

source: Go back to your Plone site: voilá!
es: Vuelve a tu sitio de Plone: ¡voilá!
