Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: After we have chosen our template and then clicked on *OK*, we have our template-based content in the editor:
es: Después de haber elegido nuestra plantilla y luego hacer clic en *Aceptar*, tenemos nuestro contenido basado en plantillas en el editor:

source: We can now customize it or use more templates to create more content.
es: Ahora podemos personalizarlo o usar más plantillas para crear más contenido.

source: Theme Package VII: Advanced Resource Registries Usage
es: Paquete de Tema VII: Uso Avanzado de Registros de Recursos

source: For theming in general you don't need to use the **Resource Registries**. The following infos are here as an example usage of the Plone **Resource Registries**.
es: Para la tematización en general, no es necesario utilizar los **Registros de recursos**. La siguiente información está aquí como un ejemplo de uso de los **Registros de recursos** de Plone.

source: In **Resource Registries** we can register our static resources, like CSS and LESS files and also JavaScript resources.
es: En **Resource Registries** podemos registrar nuestros recursos estáticos, como archivos CSS y LESS y también recursos JavaScript.

source: In fact even our resources we defined in the :file:`manifest.xml` are registered here automatically, but hidden.
es: De hecho, incluso nuestros recursos que definimos en el :file:'manifest.xml' se registran aquí automáticamente, pero están ocultos.

source: In this chapter we will cover CSS and LESS, but you can also do nice things with your JavaScript resources (for example using ``requirejs`` to do the import correctly without worrying about import order).
es: En este capítulo cubriremos CSS y LESS, pero también puedes hacer cosas buenas con tus recursos de JavaScript (por ejemplo, usar ``requires`` para hacer la importación correctamente sin preocuparte por el orden de importación).

source: For details about this, take a look into the documentation of the **Plone Resource Registries** and in the :doc:`JavaScript part of the training <../javascript/index>`.
es: Para obtener más información al respecto, consulte la documentación de los **Registros de recursos de Plone** y la :doc:`parte de la formación en JavaScript <./javascript/index>`.

source: Register CSS And Less Resources In The Registry
es: Registre CSS y menos recursos en el registro

source: Because of the flexibility of Less over CSS we will only use Less files here, but static CSS files can be registered in the same way. Less files have the advantage that we can use imports, and with ``reference-imports`` we can even import only the parts of the files which we are really using.
es: Debido a la flexibilidad de Less sobre CSS, solo usaremos archivos Less aquí, pero los archivos CSS estáticos se pueden registrar de la misma manera. Menos archivos tienen la ventaja de que podemos usar importaciones, y con ``reference-imports`` incluso podemos importar solo las partes de los archivos que realmente estamos usando.

source: We will now add a new resource to the **Resource Registries**. To do that, we add an ``IResourceRegistry`` entry into the :file:`registry.xml` file in our :file:`profiles/default` folder:
es: Ahora agregaremos un nuevo recurso a los **Registros de recursos**. Para hacer eso, agregamos una entrada ``IResourceRegistry`` en el archivo :file:`registry.xml` en nuestra carpeta :file:`profiles/default`:

source: This registers a file named :file:`custom.less` (from our theme package named ``ploneconf.theme``) as a *resource* named ``conf-main``. We can now add this resource to a *resource bundle* like the existing ``plone`` bundle:
es: Esto registra un archivo llamado :file:`custom.less` (de nuestro paquete de temas llamado ``ploneconf.theme``) como un *recurso* llamado ``conf-main``. Ahora podemos agregar este recurso a un *paquete de recursos* como el paquete ``plone`` existente:

source: This has the advantage of reducing the number of bundles, which also means reducing the amount of files which are loaded for the site, because every bundle will result in *one* compiled CSS file and *one* compiled JavaScript file.
es: Esto tiene la ventaja de reducir el número de paquetes, lo que también significa reducir la cantidad de archivos que se cargan para el sitio, porque cada paquete dará como resultado *un* archivo CSS compilado y *un* archivo JavaScript compilado.

source: If we have multiple LESS resources in the same bundle, they will be merged into one compiled CSS file.
es: Si tenemos varios recursos LESS en el mismo paquete, se fusionarán en un archivo CSS compilado.

source: We can also create our own custom bundle which contains our resource:
es: También podemos crear nuestro propio paquete personalizado que contenga nuestro recurso:

source: This can make sense if we only want to load that bundle under certain conditions, like only in a specific context. This could lead to a smaller size of loaded static resources, when they are not all needed.
es: Esto puede tener sentido si solo queremos cargar ese paquete bajo ciertas condiciones, como solo en un contexto específico. Esto podría dar lugar a un tamaño más pequeño de los recursos estáticos cargados, cuando no todos son necesarios.

source: After making changes to the registry, like adding resources to a bundle, you have to reload the registry configuration via an upgrade step, or via a uninstall/install of the package.
es: Después de realizar cambios en el registro, como agregar recursos a un paquete, debe volver a cargar la configuración del registro a través de un paso de actualización o mediante una desinstalación/instalación del paquete.

source: If you change a bundle, it has to be built or rebuilt. You can do this in the ``@@resourceregistry-controlpanel`` by clicking on *Build* for the bundle involved.
es: Si cambias un paquete, hay que construirlo o reconstruirlo. Puede hacer esto en el ``@@resourceregistry-controlpanel`` haciendo clic en *Construir* para el paquete en cuestión.

source: Before you can compile the bundles TTW (Through-The-Web) you have to adjust the ``@barceloneta_path`` and ``@bootstrap_path``
es: Antes de que pueda compilar los paquetes TTW (Through-The-Web) debe ajustar el ``@barceloneta_path`` y ``@bootstrap_path``

source: variables in the file :file:`theme.less`.
es: variables en el archivo :file:`theme.less`.

source: Otherwise Plone can't find the resources and will give you an error during compilation.
es: De lo contrario, Plone no puede encontrar los recursos y le dará un error durante la compilación.

source: TTW Theming I: Introduction To Diazo Theming
es: Temas TTW I: Introducción a la Tematización Diazo

source: Use the "Theming" control panel to make a copy of Plone's default theme (:term:`Barceloneta`)
es: Utilice el panel de control "Temas" para hacer una copia del tema predeterminado de Plone (:term:`Barceloneta`)

source: Customize a theme using :term:`Diazo` rules
es: Personaliza un tema usando las reglas de :term:`Diazo`

source: Customize a theme by editing and compiling :term:`Less` files
es: Personaliza un tema editando y compilando archivos :term:`Less`

source: :term:`Diazo` and plone.app.theming
es: :term:`Diazo` y plone.app.theming

source: The Default Plone Theme (:term:`Barceloneta`)
es: El tema Plone por defecto (:term:`Barceloneta`)

source: The "Theming Tool"
es: La "herramienta de Temas"

source: Building CSS in the "Theming Tool"
es: Construyendo CSS en la "herramienta de Temas"

source: CSS classes of the ``<body>`` element
es: Clases CSS del elemento ``<body>``

source: Conditionally activating :term:`Diazo` rules
es: Activación condicional de las reglas :term:`Diazo`

source: We will use a `Plone pre-configured Heroku instance <https://github.com/collective/training-sandbox>`_.
es: Usaremos una `instancia de Heroku preconfigurada de Plone <https://github.com/collective/training-sandbox>`_.

source: Once deployed, create a Plone site.
es: Una vez implementado, cree un sitio Plone.

source: Two Approaches To Theming
es: Dos enfoques para hacer Temas

source: There are two main approaches to creating a custom theme:
es: Hay dos enfoques principales para crear un tema personalizado:

source: Copying the default Barceloneta theme
es: Copiar el tema predeterminado de Barceloneta

source: Inheriting from the default Barceloneta theme.
es: Heredando del tema predeterminado de Barceloneta.

source: In this section we will work with the first approach
es: En esta sección trabajaremos con el primer enfoque

source: The second one will be covered in detail in :doc:`ttw-advanced-2`.
es: El segundo se tratará en detalle en :doc:`ttw-advanced-2`.

source: What Is Diazo?
es: ¿Qué es Diazo?

source: :program:`Diazo` is a theming engine used by Plone to make theming a site easier. At it's core, a :term:`Diazo` theme consists of an HTML page and :file:`rules.xml` file containing directives.
es: :program:`Diazo` es un motor de tematización utilizado por Plone para facilitar la tematización de un sitio. En esencia, un tema :term:`Diazo` consiste en una página HTML y un archivo :file:`rules.xml` que contiene directivas.

source: You can find extended information about Diazo and its integration package :py:mod:`plone.app.theming` in the official docs for `Diazo <http://docs.diazo.org/en/latest/>`_ and `plone.app.theming <https://docs.plone.org/external/plone.app.theming/docs/index.html#what-is-a-diazo-theme>`_.
es: Puede encontrar información ampliada sobre Diazo y su paquete de integración :py:mod:`plone.app.theming` en la documentación oficial de `Diazo <http://docs.diazo.org/en/latest/>`_ y `plone.app.theming <https://docs.plone.org/external/plone.app.theming/docs/index.html#what-is-a-diazo-theme>`_.

source: Principles
es: Principios

source: For this part of the training you just need to know the basic principles of a Diazo theme:
es: Para esta parte de la formación sólo necesitas conocer los principios básicos de un tema Diazo:

source: Plone renders the content of the page.
es: Plone representa el contenido de la página.

source: Diazo rules inject the content into any static theme.
es: Las reglas de Diazo inyectan el contenido en cualquier tema estático.

source: Copy Barceloneta Theme
es: Copiar tema de Barceloneta

source: To create our playground we will copy the existing Barceloneta theme.
es: Para crear nuestro parque infantil copiaremos el tema de Barceloneta existente.

source: Go to the :guilabel:`Theming` control panel.
es: Vaya al panel de control :guilabel:`Temas`.

source: You will see a list of the available themes. In a bare new Plone site, you will see something like this:
es: Verás una lista de los temas disponibles. En un nuevo sitio de Plone, verá algo como esto:

source: Look for the *Barceloneta Theme* and click the :guilabel:`Copy` button next to it.
es: Busque el *Tema de Barceloneta* y haga clic en el botón :guilabel:'Copiar' junto a él.

source: Insert "My theme" as the name and click the checkbox to immediately enable the theme:
es: Inserte "Mi tema" como nombre y haga clic en la casilla de verificación para habilitar inmediatamente el tema:

source: Click on :guilabel:`Create` and you get redirected to your new theme's inspector:
es: Haga clic en :guilabel:`Crear` y será redirigido al inspector de su nuevo tema:

source: Anatomy Of A Diazo Theme
es: Anatomía de un tema Diazo

source: The most important files:
es: Los archivos más importantes:

source: :file:`manifest.cfg`: contains metadata about the theme (`manifest reference <https://docs.plone.org/external/plone.app.theming/docs/index.html#the-manifest-file>`_);
es: archivo :file:`manifest.cfg`: contiene metadatos sobre el tema (`referencia de manifest <https://docs.plone.org/external/plone.app.theming/docs/index.html#the-manifest-file>`_);

source: :file:`rules.xml`: contains the theme rules (`rules reference <https://docs.plone.org/external/plone.app.theming/docs/index.html#rules-syntax>`_);
es: archivo :file:`rules.xml`: contiene las reglas del tema (`referencia de rules <https://docs.plone.org/external/plone.app.theming/docs/index.html#rules-syntax>`_);

source: :file:`index.html`: the static HTML of the theme.
es: archivo :file:`index.html`: el HTML estático del tema.

source: Exercise 1 - Inspecting The :file:`manifest.cfg`
es: Ejercicio 1 - Inspeccionando el :file:`manifest.cfg`

source: To better understand how your theme is arranged start by reading the :file:`manifest.cfg` file.
es: Para entender mejor cómo está organizado tu tema, empieza por leer el archivo :file:`manifest.cfg`.

source: In the theming tool, open the :file:`manifest.cfg` spend a minute or two looking through it, then see if you can answer the questions below.
es: En la herramienta de creación de temas, abra el archivo :file:`manifest.cfg`, dedique uno o dos minutos a revisarlo, luego vea si puede responder a las preguntas a continuación.

source: Where are the main rules located for your theme?
es: ¿Dónde se encuentran las reglas principales para tu tema?

source: What property in the :file:`manifest.cfg` file defines the source CSS/Less file used by the theme?
es: ¿Qué propiedad en el archivo :file:`manifest.cfg` define el archivo fuente CSS/Less utilizado por el tema?

source: What do you think is the purpose of the ``prefix`` property?
es: ¿Cuál crees que es el propósito de la propiedad ``prefix``?

source: Solution
es: Solución

source: The main rules are defined by the ``rules`` property (you could point this anywhere, however the accepted convention is to use a file named :file:`rules.xml`.
es: Las reglas principales están definidas por la propiedad ``rules`` (podría apuntar esto en cualquier lugar, sin embargo, la convención aceptada es usar un archivo llamado :file:`rules.xml`.

source: The ``development-css`` property points at the main Less file, when compiled to CSS it is placed in the location defined by the ``production-css`` property.
es: La propiedad ``development-css`` apunta al archivo Less principal, cuando se compila a CSS se coloca en la ubicación definida por la propiedad ``production-css``.

source: The ``prefix`` property defines the default location to look for non prefixed files, for example if your prefix is set to ``/++theme++mytheme`` then a file like index.html will be expected at ``/++theme++mytheme/index.html``
es: La propiedad ``prefijo`` define la ubicación predeterminada para buscar archivos sin prefijo, por ejemplo, si su prefijo está establecido en ``/++theme++mitema``, entonces se esperará un archivo como index.html en ``/++theme++mitema/index.html``

source: CSS Classes For The ``<body>`` Element
es: Clases CSS del elemento ``<body>``

source: As you browse a Plone site, Plone adds rich information about your current context. This information is represented as special classes in the ``<body>`` element. Information represented by the ``<body>`` classes includes:
es: A medida que navega por un sitio de Plone, Plone agrega información valiosa sobre su contexto actual. Esta información se representa como clases especiales en el elemento ``<body>``. La información representada por las clases ``<body>`` incluye:

source: the current user role and permissions,
es: el rol de usuario y los permisos actuales,

source: the current content-type and its template,
es: el tipo de contenido actual y su plantilla,

source: the site section and sub section,
es: la sección y la subsección del sitio,

source: the current subsite (if any),
es: el subsitio actual (si lo hay),

source: whether this is a frontend view,
es: ya sea que se trate de una vista frontend,

source: whether icons are enabled.
es: si los iconos están habilitados.

source: ``<body>`` Classes For An Anonymous Visitor
es: Clases ``<body>`` para un visitante Anónimo

source: Below you can see an example of the body classes for a page named "front-page", located in the root of a typical Plone site called "acme":
es: A continuación puede ver un ejemplo de las clases de cuerpo para una página llamada "front-page", ubicada en la raíz de un sitio típico de Plone llamado "acme":

source: ``<body>`` Classes For A Manager
es: Clases ``<body>`` para un Administrador

source: And here is what the classes for the same page look like when viewed by a manager who has logged in:
es: Y así es como se ven las clases para la misma página cuando las ve un administrador que ha iniciado sesión:

source: Notice the addition of ``userrole-manager``.
es: Observe la adición de ``userrole-manager``.

source: Exercise 2 - Discussion About The ``<body>`` Classes
es: Ejercicio 2 - Discusión sobre las clases ``<body>``

source: Look back at the ``<body>`` classes for a manager. Can you answer the following questions?
es: Mira hacia atrás a la clases ``<body>`` para un administrador. ¿Puede responder a las siguientes preguntas?

source: What other roles does the manager have?
es: ¿Qué otras funciones tiene el Administrador?

source: Can you see other differences?
es: ¿Puedes ver otras diferencias?

source: What do you think the ``plone-toolbar-expanded`` class does?
es: ¿Qué crees que hace la clase ``plone-toolbar-expanded``?

source: The manager also has the role "member" and "authenticated"
es: El administrador también tiene el rol de "member" y "authenticated"

source: There are ``plone-toolbar`` classes added to the ``<body>`` element, these control the display of the toolbar
es: Hay clases ``plone-toolbar`` añadidas a la clase ``<body>``, estos controlan la visualización de la barra de herramientas

source: The ``plone-toolbar-expanded`` class is used to control styles used by the expanded version of the toolbar.
es: La clase ``plone-toolbar-expanded`` se utiliza para controlar los estilos utilizados por la versión expandida de la barra de herramientas.

source: Custom Rules
es: Reglas personalizadas

source: Let's open the default rules file :file:`rules.xml`. You will see all the rules that are used in the Barceloneta theme right now. For the time being let's concentrate on how to hack these rules.
es: Abramos el archivo de reglas predeterminado :file:`rules.xml`. Verás todas las reglas que se utilizan en el tema de la Barceloneta en este momento. Por el momento, concentrémonos en cómo hackear estas reglas.

source: Conditionally Showing Content
es: Mostrar contenido de forma condicional

source: Suppose that we want to make the "above content" block (the one that contains breadcrumbs) conditional, and show it only for authenticated users.
es: Supongamos que queremos hacer que el bloque "contenido anterior" (el que contiene migas de pan) sea condicional y mostrarlo solo para usuarios autenticados.

source: In the :file:`rules.xml` find this line:
es: En el archivo :file:`rules.xml` encuentra esta línea:

source: This rule states that the element that comes from the content (Plone) with the id ``#viewlet-above-content`` must replace the element with the id ``#above-content`` in the static theme.
es: Esta regla establece que el elemento que proviene del contenido (Plone) con el id ``#viewlet-above-content`` debe reemplazar el elemento con el id ``#above-content`` en el tema estático.

source: We want to hide it for anonymous users (hint: we'll use the ``<body>`` classses we discussed above).
es: Queremos ocultarlo para los usuarios anónimos (sugerencia: usaremos las clases ``<body>`` que discutimos anteriormente).

source: The class we are looking for is ``userrole-authenticated``. Add another attribute to the rule so that we produce this code:
es: La clase que estamos buscando es ``userrole-authenticated``. Agregue otro atributo a la regla para que generemos este código:

source: The attribute ``css:if-content`` allows us to put a condition on the rule based on a CSS selector that acts on the content. In this way the rule will be applied only if the body element has the class ``.userrole-authenticated``.
es: El atributo ``css:if-content`` nos permite poner una condición a la regla basada en un selector CSS que actúa sobre el contenido. De esta manera, la regla se aplicará solo si el elemento body tiene la clase ``.userrole-authenticated``.

source: We will learn more about Diazo rules in :doc:`ttw-advanced-2`.
es: Aprenderemos más sobre las reglas de Diazo en :doc:`ttw-advanced-2`.

source: Customize CSS
es: Personalizar el CSS

source: In the theme editor open the file :file:`less/barceloneta.plone.less`. This file is the main Less file as specified in the :file:`manifest.cfg`.
es: En el editor de temas abre el archivo :file:`less/barceloneta.plone.less`. Este fichero es el fichero Less principal tal y como se especifica en el :file:`manifest.cfg`.

source: Add your own customization at the bottom of the file, like:
es: Agregue su propia personalización en la parte inferior del archivo, como:

source: Normally you would place this in a separate file to keep the main one clean but for this example it is enough.
es: Normalmente, colocaría esto en un archivo separado para mantener limpio el principal, pero para este ejemplo es suficiente.

source: Click the buttons :guilabel:`Save` and :guilabel:`Build CSS`.
es: Haga clic en los botones :guilabel:`Guardar` y :guilabel:`Construir CSS`.

source: Go back to the Plone site and reload the page: voilá!
es: Vuelve al sitio de Plone y vuelve a cargar la página: ¡voilá!

source: At the moment you need to "Build CSS" from the main file, the one declared in the manifest (in this case :file:`less/barceloneta.plone.less`). So, whatever Less file you edit, go back to the main one to compile. This behavior will be improved in the future, but for now remember this simple rule.
es: En este momento necesitas "Construir CSS" desde el archivo principal, el que se declara en el manifiesto (en este caso :file:`less/barceloneta.plone.less`). Por lo tanto, sea cual sea el archivo Less que edites, vuelve al principal para compilar. Este comportamiento se mejorará en el futuro, pero por ahora recuerde esta simple regla.

source: TTW Theming II: Create A Custom Theme Based On Barceloneta
es: Tema TTW II: Crea un tema personalizado basado en Barceloneta

source: Create a new theme by inheriting from the :term:`Barceloneta` theme.
es: Crea un nuevo tema heredando del tema :term:`Barceloneta`.

source: Use the :file:`manifest.cfg` to register a production CSS file.
es: Utilice el archivo :file:`manifest.cfg` para registrar un archivo CSS de producción.

source: Use an ``XInclude`` to incorporate rules from the :term:`Barceloneta` theme.
es: Utilice un ``XInclude`` para incorporar reglas del tema :term:`Barceloneta`.

source: Use ``?diazo.off=1`` to view unthemed versions.
es: Use ``?diazo.off=1`` para ver versiones sin tema.

source: Use conditional rules to have a different backend theme from the anonymous visitors theme.
es: Utilice reglas condicionales para tener un tema de backend diferente del tema de visitantes anónimos.

source: Inheriting from Barceloneta theme.
es: Heredero del tema de Barceloneta.

source: Diazo rule directives and attributes.
es: Directivas y atributos de la regla Diazo.

source: Viewing the unthemed version of a Plone item.
es: Visualización de la versión sin tema de un elemento de Plone.

source: Creating a visitor-only theme.
es: Creación de un tema solo para visitantes.

source: Inheriting From Barceloneta
es: Heredar del tema Barceloneta

source: When inheriting from the Barceloneta theme keep the following in mind:
es: Al heredar del tema de Barceloneta, tenga en cuenta lo siguiente:

source: The theme provides styles and assets used by Plone's backend tools.
es: El tema proporciona estilos y activos utilizados por las herramientas de backend de Plone.

source: Inheritance involves including the Barceloneta :file:`rules.xml` (``++theme++barceloneta/rules.xml``) and styles.
es: La herencia implica incluir el tema Barceloneta en el archivo :file:`rules.xml` (``++theme++barceloneta/rules.xml``) y los estilos.
