Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: The most important objective of this training is to explain how to adjust the layout and design of a Plone site. It will cover basic customizations you can do :term:`TTW` (Through-The-Web) in your Plone site, as well as advanced theming methods and tools to create stunning themes for your Plone website based on existing HTML templates.
es: El objetivo más importante de esta capacitación es explicar cómo ajustar el diseño y la disposición de un sitio Plone. Cubrirá las personalizaciones básicas que puede hacer :term:`TTW` (Through-The-Web) en su sitio de Plone, así como métodos y herramientas de temas avanzados para crear temas impresionantes para su sitio web de Plone basados en plantillas HTML existentes.

source: This training is **not** about:
es: Esta formación **no** sobre:

source: How to write JavaScript and integrate it into Plone
es: Cómo escribir JavaScript e integrarlo en Plone

source: How to create designs or templates used for the advanced theming
es: Cómo crear diseños o plantillas utilizadas para la tematización avanzada

source: Theme Package I: Preparations
es: Paquete Tema I: Preparativos

source: Creating a theme product with the Diazo inline editor is an easy way to start and to test, but it is not a solid long term solution and you are also limited in what you can do that way.
es: Crear un producto temático con el editor en línea Diazo es una manera fácil de comenzar y probar, pero no es una solución sólida a largo plazo y también está limitado en lo que puede hacer de esa manera.

source: Even if :py:mod:`plone.app.theming` allows importing and exporting of a Diazo theme as a ZIP archive, it might be preferable to manage your theme as an actual Plone product.
es: Incluso si :py:mod:`plone.app.theming` permite importar y exportar un tema de Diazo como un archivo ZIP, podría ser preferible administrar su tema como un producto Plone real.

source: One of the most obvious reasons is that it will allow you to override Plone elements that are not accessible via pure Diazo features (such as overloading content view templates, viewlets, configuration settings, etc.).
es: Una de las razones más obvias es que le permitirá anular los elementos de Plone a los que no se puede acceder a través de las funciones puras de Diazo (como la sobrecarga de plantillas de vista de contenido, viewlets, ajustes de configuración, etc.).

source: Preparing Your Setup
es: Preparación de la configuración

source: Install npm
es: Instalar npm

source: If you don't have :term:`npm` already installed on your system please do it. :program:`npm` comes with :program:`nodejs`, we just need to install :program:`npm`.
es: Si aún no tienes :term:`npm` instalado en tu sistema, por favor hazlo. :program:`npm` viene con :program:`nodejs`, solo necesitamos instalar :program:`npm`.

source: On Debian/Ubuntu for example you can do this with apt:
es: En Debian/Ubuntu, por ejemplo, puede hacer esto con apt:

source: On a Mac you can install :program:`npm` using :program:`Homebrew`:
es: En un Mac puedes instalar :program:`npm` usando :program:`Homebrew`:

source: If you need a newer version of :program:`npm` just update your version with :command:`npm` itself:
es: Si necesita una versión más reciente de :program:`npm` simplemente actualice su versión con :command:`npm` mismo:

source: Install Grunt
es: Instalar Grunt

source: We also need to install :program:`grunt-cli` globally.
es: También necesitamos instalar :program:`grunt-cli` globalmente.

source: If you already have it, you can skip this step.
es: Si ya lo tienes, puedes saltarte este paso.

source: If you get an error with :program:`node` on Debian/Ubuntu, please check if you already have ``/usr/bin/node``, if not create a symlink like:
es: Si obtiene un error con :program:`node` en Debian/Ubuntu, por favor verifique si ya tiene ``/usr/bin/node``, si no, cree un enlace simbólico como:

source: Setup A Python Virtual Environment
es: Configurar un entorno virtual de Python

source: First, let's create a Python :program:`virtualenv`:
es: Primero, vamos a crear un Python :program:`virtualenv`:

source: Then we enable the virtualenv:
es: A continuación, habilitamos el virtualenv:

source: Create A Product To Handle Your Diazo Theme
es: Crea un producto para manejar tu Tema Diazo

source: To create a Plone 5 theme skeleton, you will use :program:`mr.bob`'s templates for Plone.
es: Para crear un esqueleto temático de Plone 5, usarás las plantillas de :program:`mr.bob` para Plone.

source: Install mr.bob And bobtemplates.plone
es: Instalar mr.bob y bobtemplates.plone

source: To install :py:mod:`mr.bob`, you can use :command:`pip`:
es: Para instalar :py:mod:`mr.bob`, puedes usar :command:`pip`:

source: and to install the required bobtemplates for Plone, do:
es: y para instalar los bobtemplates necesarios para Plone, haga lo siguiente:

source: Create a Plone 5 theme product skeleton with :command:`mrbob`. It will ask you some questions about the new theme package:
es: Cree un esqueleto de producto del tema Plone 5 con :command:`mrbob`. Te hará algunas preguntas sobre el nuevo paquete de temas:

source: Now you have a new Python package in your current folder:
es: Ahora tienes un nuevo paquete de Python en tu carpeta actual:

source: It is now safe to deactivate the ``mrbob`` virtualenv:
es: Ahora es seguro desactivar el virtualenv ``mrbob``:

source: This would be the perfect time to initialize your package with Git and put your files under version control:
es: Este sería el momento perfecto para inicializar tu paquete con Git y poner tus archivos bajo control de versiones:

source: Install zc.buildout And Bootstrap Your Development Environment
es: Instale zc.buildout y arranque su entorno de desarrollo

source: You can install Buildout globally or on a virtualenv.
es: Puede instalar Buildout globalmente o en un virtualenv.

source: We will install ``zc.buildout`` in a new virtual environment using the provided :file:`requirements.txt`.
es: Instalaremos ``zc.buildout`` en un nuevo entorno virtual utilizando el archivo :file:`requirements.txt` proporcionado.

source: Now you have everything in place and you can run :command:`buildout`.
es: Ahora tienes todo en su lugar y puedes ejecutar :command:`buildout`.

source: Depending on your internet connection and your local buildout cache this can take several minutes to complete.
es: Dependiendo de tu conexión a Internet y de tu caché de compilación local, esto puede tardar varios minutos en completarse.

source: After buildout finished successfully it is now safe to deactivate the ``buildoutvenv`` virtualenv:
es: Una vez finalizada la compilación con éxito, ahora es seguro desactivar el virtualenv ``buildoutvenv``:

source: This will create the whole development environment for your package:
es: Esto creará todo el entorno de desarrollo para su paquete:

source: Inspect Your Package Source
es: Inspeccione el origen de su paquete

source: Your package source code is in the ``src`` folder:
es: El código fuente de su paquete está en la carpeta ``src``:

source: As you can see, the package already contains a :term:`Diazo` theme including the :term:`Barceloneta` resources:
es: Como puedes ver, el paquete ya contiene un tema :term:`Diazo` que incluye los recursos :term:`Barceloneta`:

source: This theme basically provides you with a copy of the Plone 5 default theme (Barceloneta), and you can change everything you need to create your own theme. The Barceloneta resources are in the folder ``barceloneta``.
es: Este tema básicamente te proporciona una copia del tema predeterminado de Plone 5 (Barceloneta), y puedes cambiar todo lo que necesitas para crear tu propio tema. Los recursos de la Barceloneta están en la carpeta ``Barceloneta``.

source: This is basically a copy of the theme folder of :py:mod:`plonetheme.barceloneta`. We removed some unneeded files there, because we only need the :term:`Less` part for partially including it in our file :file:`theme.less`.
es: Esto es básicamente una copia de la carpeta del tema de :py:mod:`plonetheme.barceloneta`. Eliminamos algunos archivos innecesarios allí, porque solo necesitamos la parte :term:`Less` para incluirla parcialmente en nuestro archivo :file:`theme.less`.

source: We also have the icons and the file :file:`backend.xml` from Barceloneta in our theme folder.
es: También tenemos los iconos y el archivo :file:`backend.xml` de la Barceloneta en nuestra carpeta de temas.

source: In the folder ``theme/less`` we have our :term:`CSS`/:term:`Less` files. Our own CSS goes into the file :file:`custom.less`.
es: En la carpeta ``theme/less`` tenemos nuestros archivos :term:`CSS` / :term:`Less`. Nuestro propio CSS entra en el archivo :file:`custom.less`.

source: You can also add more :term:`Less` files and include them in :file:`theme.less`, if you have a lot of custom CSS and you like to split it into multiple files.
es: También puedes agregar más archivos :term:`Less` e incluirlos en el archivo :file:`theme.less`, si tienes una gran cantidad de CSS personalizado y te gusta dividirlo en varios archivos.

source: The file :file:`theme.less` is our main :term:`Less` file. Here we include all other files we need.
es: El archivo :file:`theme.less` es nuestro archivo principal :term:`Less`. Aquí incluimos todos los demás archivos que necesitamos.

source: It already has some includes of :term:`Barceloneta`, Twitter Bootstrap and our cusomizations from the file :file:`custom.less` at the bottom.
es: Ya tiene algunas inclusiones de :term:`Barceloneta`, Twitter Bootstrap y nuestras comparecciones del archivo :file:`custom.less` en la parte inferior.

source: We also have a file :file:`package.json`, which we can use to define external dependencies like Twitter Bootstrap or other CSS/JS packages we want to use in our theme. For more information on how to do this, see :ref:`install-ext-packages-with-npm`.
es: También tenemos un archivo :file:`package.json`, que podemos usar para definir dependencias externas como Twitter Bootstrap u otros paquetes CSS/JS que queramos usar en nuestro tema. Para obtener más información sobre cómo hacer esto, consulte :ref:`install-ext-packages-with-npm`.

source: Start Plone And Install Your Theme Product
es: Inicie Plone e instale su producto tema

source: To start the Plone instance, run:
es: Para iniciar la instancia de Plone, ejecute:

source: The Plone instance will then be available at http://localhost:8080. The default username is ``admin`` and password is ``admin``.
es: A partir de ese momento, la instancia de Plone estará disponible en http://localhost:8080. El nombre de usuario predeterminado es ``admin`` y la contraseña es ``admin``.

source: Go to http://localhost:8080 and click the button :guilabel:`Create a new Plone site` to add a new Plone site.
es: Vaya a http://localhost:8080 y haga clic en el botón :guilabel:`Crear un nuevo sitio Plone` para agregar un nuevo sitio Plone.

source: Name the site ``Plone`` (which should be the default) and click on :guilabel:`Create Plone Site`.
es: Asigne al sitio el nombre ``Plone`` (que debería ser el predeterminado) y haga clic en :guilabel:`Crear sitio Plone`.

source: Go to the :guilabel:`Add-ons` control panel.
es: Vaya al panel de control :guilabel:`Complementos`.

source: Click on the :guilabel:`Install` next to ``Plone Theme: Ploneconf Theme`` to install your add-on.
es: Haga clic en :guilabel:`Instalar` junto a ``Plone Theme: Ploneconf Theme`` para instalar su complemento.

source: The theme will be automatically enabled.
es: El tema se habilitará automáticamente.

source: If something is wrong with the theme, you can always go to http://localhost:8080/Plone/@@theming-controlpanel and disable it.
es: Si algo está mal con el tema, siempre puedes ir a http://localhost:8080/Plone/@@theming-controlpanel y desactivarlo.

source: This control panel will never be themed, so it works even if the theme might be broken.
es: Este panel de control nunca tendrá un tema, por lo que funciona incluso si el tema puede estar roto.

source: Don't forget to commit any changes on your package to version control. After the first buildout run, there are some new files and folders. Some of them (:file:`node_modules` and :file:`package-lock.json`) can be ignored, while others (:file:`theme-compiled.css`) need to be added to the repository.
es: No olvide confirmar cualquier cambio en su paquete para el control de versiones. Después de la primera ejecución de compilación, hay algunos archivos y carpetas nuevos. Algunos de ellos (carpeta :file:`node_modules` y el archivo :file:`package-lock.json`) se pueden ignorar, mientras que otros (el archivo :file:`theme-compiled.css`) deben agregarse al repositorio.

source: Edit the :file:`.gitignore` file and add the following entries:
es: Edite el archivo :file:`.gitignore` y agregue las siguientes entradas:

source: Then run the following commands:
es: A continuación, ejecute los siguientes comandos:

source: :doc:`In the next section <theme-package-2>` we will adjust the skeleton we got from ``bobtemplates.plone`` and fill it with our custom theme.
es: :doc:`En la siguiente sección <theme-package-2>` ajustaremos el esqueleto que obtuvimos de ``bobtemplates.plone`` y lo llenaremos con nuestro tema personalizado.

source: Theme Package II: Build Your Diazo-Based Theme
es: Paquete de temas II: Crea tu tema basado en Diazo

source: In the previous section we :doc:`prepared our setup for our custom theme package <theme-package>`. Now we will adjust the skeleton we got using ``bobtemplates.plone`` and build our Diazo theme.
es: En la sección anterior hemos :doc:`preparado nuestra configuración para nuestro paquete de temas personalizados <theme-package>`. Ahora ajustaremos el esqueleto que obtuvimos usando ``bobtemplates.plone`` y construiremos nuestro tema Diazo.

source: You can start with the example files in the theme folder. Change the :file:`index.html` and :file:`custom.less` files to customize the default theme to your needs.
es: Puede comenzar con los archivos de ejemplo en la carpeta del tema. Cambie los archivos :file:`index.html` y :file:`custom.less` para personalizar el tema predeterminado según sus necesidades.

source: As stated above it's the Plone 5 default :term:`Barceloneta` theme plus some custom files you can use to to override or write CSS/Less.
es: Como se indicó anteriormente, es el tema :term:`Barceloneta` predeterminado de Plone 5, además de algunos archivos personalizados que puede usar para anular o escribir CSS / Less.

source: Use Your Own Static Mockup
es: Usa tu propia maqueta estática

source: If you got a static mockup from your designer or from a website like https://startbootstrap.com/ (where the example template came from), you can use this without customization and just apply the Diazo rules to it.
es: Si tienes una maqueta estática de tu diseñador o de un sitio web como https://startbootstrap.com/ (de donde proviene la plantilla de ejemplo), puedes usarla sin personalización y simplemente aplicarle las reglas de Diazo.

source: Another way is to change the static mockup a little bit to use mostly the same CSS id's and classes like Plone does. This way it is easier to reuse CSS/Less from Barceloneta and Plone add-ons if needed.
es: Otra forma es cambiar un poco la maqueta estática para usar principalmente los mismos identificadores y clases CSS como lo hace Plone. De esta manera, es más fácil reutilizar los complementos CSS/Less de Barceloneta y Plone si es necesario.

source: Download And Prepare A Static Theme
es: Descargar y preparar un tema estático

source: Let's start with an untouched static template, such as this Twitter Bootstrap based one: https://startbootstrap.com/template-overviews/business-casual/. The latest version of that template uses a beta version of Twitter Bootstrap 4.
es: Comencemos con una plantilla estática intacta, como esta basada en Twitter Bootstrap: https://startbootstrap.com/template-overviews/business-casual/. La última versión de esa plantilla utiliza una versión beta de Twitter Bootstrap 4.

source: We are going to use the latest release which uses Twitter Bootstrap 3. Download it from https://github.com/BlackrockDigital/startbootstrap-business-casual/releases/tag/v3.3.7 and extract it into the theme folder.
es: Vamos a usar la última versión que usa Twitter Bootstrap 3. Descárgalo de https://github.com/BlackrockDigital/startbootstrap-business-casual/releases/tag/v3.3.7 y extráelo en la carpeta del tema.

source: Replace the :file:`index.html` with the one from the downloaded template.
es: Reemplace el :file:'index.html' por el de la plantilla descargada.

source: The content of your theme folder should now look like this:
es: El contenido de la carpeta de tu tema ahora debería verse así:

source: Preparing The Template
es: Preparación de la plantilla

source: To make the given template :file:`index.html` more useful, we customize it a little bit.
es: Para hacer que la plantilla dada :file:'index.html' sea más útil, la personalizamos un poco.

source: Right before the second box which contains:
es: Justo antes de la segunda caja que contiene:

source: Add this:
es: Agregar botón:

source: And then move the main content (the box 2 and box 3 including the parent ``div`` with the class ``row``) into the ``content-container``.
es: Y luego mueva el contenido principal (la caja 2 y la caja 3 incluyendo el elemento ``div`` principal con la clase ``row``) al ``content-container``.

source: It should now look like this:
es: Ahora debería verse así:

source: We added the portlet columns *after* the main content.
es: Añadimos las columnas de portlet *después* del contenido principal.

source: Using the correct Twitter Bootstrap grid classes we can later *push* the 1st portlet column visually before the main content.
es: Usando las clases de cuadrícula correctas de Twitter Bootstrap, más adelante podemos *empujar* la primera columna del portlet visualmente antes del contenido principal.

source: Include Theme CSS
es: Incluir tema CSS

source: Next we need to include the CSS from the template into our :file:`theme.less` file. We will add the include of the CSS the template provides in :file:`theme/css/business-casual.css` after the ``END OF UTILS`` marker, but before the ``custom.less`` include:
es: A continuación, debemos incluir el CSS de la plantilla en nuestro archivo :file:`theme.less`. Agregaremos la inclusión del CSS que la plantilla proporciona en :file:`theme/css/business-casual.css` después del marcador ``END OF UTILS``, pero antes de la inclusión ``custom.less``:

source: We include the CSS file here as a :term:`Less` file. This way we can extend parts of the CSS in our theme (we will do this with the ``.box`` class in the next section).
es: Incluimos el archivo CSS aquí como un archivo :term:`Less`. De esta manera podemos extender partes del CSS en nuestro tema (lo haremos con la clase ``.box`` en la siguiente sección).

source: Don't forget to run :command:`grunt compile` in your package root after you changed the :term:`Less` files.
es: No olvide ejecutar :command:`grunt compile` en la raíz de su paquete después de cambiar los archivos :term:`Less`.

source: You can use :command:`grunt watch` to automatically compile your :term:`Less` files to CSS whenver they are changed.
es: Puedes usar :command:`grunt watch` para compilar automáticamente tus archivos :term:`Less` en CSS cada vez que se cambien.

source: Using Diazo Rules To Map The Theme With Plone Content
es: Uso de las reglas de Diazo para mapear el tema con contenido Plone

source: Now that we have the static theme, we need to apply the Diazo rules in :file:`rules.xml` to map the Plone content elements to the theme.
es: Ahora que tenemos el tema estático, necesitamos aplicar las reglas de Diazo en :file:'rules.xml' para mapear los elementos de contenido de Plone al tema.

source: First let me explain what we mean when we talk about *content* and *theme*.
es: Primero permítanme explicar a qué nos referimos cuando hablamos de *contenido* y *tema*.

source: *Content* is usually the dynamic generated content on the Plone site, and the *theme* is the static template site.
es: *Contenido* suele ser el contenido dinámico generado en el sitio de Plone, y el *theme* es el sitio de plantilla estática.

source: For example:
es: Por ejemplo:

source: This rule will replace the element with the CSS id ``#headline`` in the theme with the element with CSS id ``#firstHeading`` from the generated Plone content.
es: Esta regla reemplazará el elemento con el ID CSS ''#headline'' en el tema con el elemento con el ID CSS ``#firstHeading`` del contenido Plone generado.

source: To inspect the content side, you can open another Browser tab, but instead of http://localhost:8080/Plone, use http://127.0.0.1:8080/Plone. In this tab Diazo is disabled, allowing you to use your browser's Inspector or Developer tools to view the DOM structure of the default, unthemed Plone content.
es: Para inspeccionar el lado del contenido, puede abrir otra pestaña del navegador, pero en lugar de http://localhost:8080/Plone, use http://127.0.0.1:8080/Plone. En esta pestaña, Diazo está deshabilitado, lo que le permite usar el Inspector o las herramientas de desarrollo de su navegador para ver la estructura DOM del contenido Plone predeterminado y sin tema.

source: This *unthemed host name* is managed in the :guilabel:`Theming Control Panel` under :guilabel:`Advanced Settings`, where more domains can be added.
es: Este *nombre de host sin tema* se administra en el :guilabel:`Panel de control de temas` en :guilabel:`Configuración avanzada`, donde se pueden agregar más dominios.

source: For more details on how to use Diazo rules, take a look at http://docs.diazo.org/en/latest/ and https://docs.plone.org/external/plone.app.theming/docs/index.html.
es: Para obtener más detalles sobre cómo usar las reglas de Diazo, eche un vistazo a http://docs.diazo.org/en/latest/ y https://docs.plone.org/external/plone.app.theming/docs/index.html.

source: With our theme generated from :py:mod:`bobtemplates.plone` we already got a fully functional rule set based on the Plone 5 default Theme:
es: Con nuestro tema generado a partir de :py:mod:`bobtemplates.plone` ya tenemos un conjunto de reglas completamente funcional basado en el tema predeterminado de Plone 5:

source: As you probably noticed, the theme does not look like it should right now and is missing some important parts like the toolbar. That is because we are using an HTML template which has a different HTML structure than the one Plone's default theme is using.
es: Como probablemente hayas notado, el tema no se ve como debería en este momento y le faltan algunas partes importantes como la barra de herramientas. Esto se debe a que estamos utilizando una plantilla HTML que tiene una estructura HTML diferente a la que utiliza el tema predeterminado de Plone.

source: We can either change our theme's template to use the same structure and naming for classes and id's, or we can change our rule set to work with the theme template like it is. We will use the second approach and customize our rule set to work with the provided theme template.
es: Podemos cambiar la plantilla de nuestro tema para usar la misma estructura y nomenclatura para las clases y los identificadores, o podemos cambiar nuestro conjunto de reglas para que funcione con la plantilla del tema tal como está. Usaremos el segundo enfoque y personalizaremos nuestro conjunto de reglas para trabajar con la plantilla de tema proporcionada.
