Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: The prefix/unique path to the Barceloneta theme is ``++theme++barceloneta``.
es: El prefijo/ruta única al tema de Barceloneta es ``++theme++barceloneta``.

source: It is necessary to include a copy of Barceloneta's :file:`index.html` in the root of your custom theme.
es: Es necesario incluir una copia del archivo :file:`index.html` del tema Barceloneta en la raíz de tu tema personalizado.

source: The three key files involved are :file:`manifest.cfg`, :file:`rules.xml` and a Less file defined in the manifest which we will call :file:`styles.less`.
es: Los tres archivos clave involucrados son :file:`manifest.cfg`, :file:`rules.xml` y un archivo Less definido en el manifiesto al que llamaremos :file:`styles.less`.

source: Use "Build CSS" to generate a CSS file from your custom Less file.
es: Utilice "Compilar CSS" para generar un archivo CSS a partir de su archivo Less personalizado.

source: Copying Barceloneta makes your theme heavier and will likely make upgrading more difficult.
es: Copiar Barceloneta hace que tu tema sea más pesado y probablemente dificultará la actualización.

source: The Barceloneta theme provides many assets used by Plone's utilities that you do not need to duplicate.
es: El tema Barceloneta proporciona muchos activos utilizados por las utilidades de Plone que no es necesario duplicar.

source: New releases of the theme may introduce optimizations or bug fixes.
es: Las nuevas versiones del tema pueden introducir optimizaciones o correcciones de errores.

source: By referencing the Barceloneta rules and styles, instead of copying them, you automatically benefit from any updates to the Barceloneta theme while also keeping your custom theme relatively small.
es: Al hacer referencia a las reglas y estilos de la Barceloneta, en lugar de copiarlos, se beneficia automáticamente de cualquier actualización del tema de la Barceloneta y, al mismo tiempo, mantiene su tema personalizado relativamente pequeño.

source: Exercise 1 - Create A New Theme That Inherits From Barceloneta
es: Ejercicio 1 - Crear un nuevo tema que herede de Barceloneta

source: In this exercise we will create a new theme that inherits the Barceloneta rules and styles.
es: En este ejercicio crearemos un nuevo tema que hereda las reglas y estilos de Barceloneta.

source: Click the :guilabel:`New theme` button to create a new theme:
es: Haga clic en el botón :guilabel:`Nuevo tema` para crear un nuevo tema:

source: Give the theme a name, e.g. "Custom", and click the checkbox to immediately enable the theme:
es: Asigne un nombre al tema, por ejemplo, "Personalizado", y haga clic en la casilla de verificación para habilitar inmediatamente el tema:

source: Click on :guilabel:`Create` and you get redirected to your new theme's inspector.
es: Haga clic en :guilabel:`Crear` y será redirigido al inspector de su nuevo tema.

source: In the theming editor, ensure that your new theme contains the files :file:`manifest.cfg`, :file:`rules.xml`, :file:`index.html` (from Barceloneta) and :file:`styles.less`.
es: En el editor de temas, asegúrate de que tu nuevo tema contiene los archivos :file:`manifest.cfg`, :file:`rules.xml`, :file:`index.html` (de Barceloneta) y :file:`styles.less`.

source: Edit the file :file:`manifest.cfg` which contains the configuration for your theme:
es: Edita el archivo :file:`manifest.cfg` que contiene la configuración de tu tema:

source: Edit the file :file:`rules.xml` which includes the link to the Barceloneta rules:
es: Edita el archivo :file:`rules.xml` que incluye el enlace a las reglas de Barceloneta:

source: Create a copy of the file :file:`index.html` from Barceloneta (this one cannot be imported or inherited, it must be local to your theme).
es: Crea una copia del archivo :file:`index.html` de Barceloneta (este no se puede importar ni heredar, debe ser local a tu tema).

source: Edit the file :file:`styles.less` which includes imports from the Barceloneta styles:
es: Edita el archivo :file:`styles.less` que incluye importaciones de los estilos de Barceloneta:

source: Generate the :file:`styles.css` CSS file using :file:`styles.less`. Click the buttons :guilabel:`Save` and :guilabel:`Build CSS` to create the file.
es: Genera el archivo CSS :file:`styles.css` usando el archivo :file:`styles.less`. Haga clic en los botones :guilabel:`Guardar` y :guilabel:`Construir CSS` para crear el archivo.

source: Your theme is ready.
es: Tu tema está listo.

source: Viewing The Unthemed Plone Site
es: Viendo el sitio sin tema de Plone

source: When you create your Diazo rules, it is important to know how the content Diazo is receiving from Plone is structured. In order to see a "non-diazoed" version page, just add ``?diazo.off=1`` at the end of its URL.
es: Al crear sus reglas de Diazo, es importante saber cómo está estructurado el contenido que Diazo recibe de Plone. Para ver una página de versión ``sin tema diazo``, simplemente agregue ``?diazo.off=1`` al final de su URL.

source: Exercise 2 - Viewing The Unthemed Site
es: Ejercicio 2 - Ver el sitio sin tema

source: Use ``?diazo.off=1`` to view the unthemed version of your site. Using your browser's inspector, find out the location/name of some of Plone's elements. Then try to answer the following:
es: Utilice ``?diazo.off=1`` para ver la versión sin tema de su sitio. Usando el inspector de su navegador, averigüe la ubicación/nombre de algunos de los elementos de Plone. A continuación, intente responder lo siguiente:

source: What do you think is the difference between "content-core" and "content"?
es: ¿Cuál crees que es la diferencia entre "content-core" y "content"?

source: There are several viewlets, how many do you count?
es: Hay varios viewlets, ¿cuántos cuentas?

source: Can you identify any portlets, what do you think they are for?
es: ¿Puedes identificar algún portlet, para qué crees que sirven?

source: The "content-core" does not include the "title" and "description" while the "content" combines the "title", "description" and "content-core".
es: El "núcleo de contenido" no incluye el "title" y la "description", mientras que el "content" combina el "title", "description" y "content-core".

source: Out of the box there are six viewlets (``viewlet-above-content``, ``viewlet-above-content-title``, ``viewlet-below-content-title``, ``viewlet-above-content-body``, ``viewlet-below-content-body``, ``viewlet-below-content``).
es: Fuera de la caja hay seis viewlets (``viewlet-above-content``, ``viewlet-above-content-title``, ``viewlet-below-content-title``, ``viewlet-above-content-body``, ``viewlet-below-content-body``, ``viewlet-below-content``).

source: There are a few *footer* portlets which construct the footer of the site.
es: Hay algunos portlets de *pie de página* que construyen el pie de página del sitio.

source: Diazo Rule Directives And Attributes
es: Directivas y atributos de la regla Diazo

source: The Diazo rules file is an :term:`XML` document containing rules to specify where the content elements (title, footer, main text, etc.) will be located in the targeted theme page. The rules are created using *rule directives* which have *attributes*; attribute values are either CSS expressions or :term:`XPath` expressions.
es: El archivo de reglas de Diazo es un documento :term:`XML` que contiene reglas para especificar dónde se ubicarán los elementos de contenido (título, pie de página, texto principal, etc.) en la página del tema de destino. Las reglas se crean utilizando *directivas de reglas* que tienen *atributos*; Los valores de atributo son expresiones CSS o expresiones :term:`XPath`.

source: CSS Selector Based Attributes
es: Atributos basados en selector CSS

source: It is generally recommended that you use CSS3 selectors to target elements in your content or theme. The CSS3 selectors used by Diazo directives are listed below:
es: Por lo general, se recomienda utilizar selectores CSS3 para orientar los elementos del contenido o tema. Los selectores CSS3 utilizados por las directivas Diazo se enumeran a continuación:

source: Used to select target elements from the theme using CSS3 selectors.
es: Se utiliza para seleccionar elementos de destino del tema mediante selectores CSS3.

source: Used to specify the element that should be taken from the content.
es: Se utiliza para especificar el elemento que se debe tomar del contenido.

source: Used to select the children of matching elements.
es: Se utiliza para seleccionar los elementos secundarios de los elementos coincidentes.

source: Used to identify the children of an element that will be used.
es: Se utiliza para identificar los elementos secundarios de un elemento que se va a utilizar.

source: XPath Selector Based Attributes
es: Atributos basados en el selector XPath

source: Depending on complexity of the required selector it is sometimes necessary or more convenient to use :term:`XPath` selectors instead of CSS selectors. XPath selectors use the unprefixed attributes ``theme`` and ``content``.
es: Dependiendo de la complejidad del selector requerido, a veces es necesario o más conveniente usar selectores :term:`XPath` en lugar de selectores CSS. Los selectores XPath utilizan los atributos sin prefijo ``theme`` y ``content``.

source: The common XPath selector attributes include:
es: Los atributos comunes del selector XPath incluyen:

source: Used to select target elements from the theme using XPath selectors.
es: Se utiliza para seleccionar elementos de destino del tema mediante selectores XPath.

source: Used to specify the element that should be taken from the content using XPath selectors.
es: Se utiliza para especificar el elemento que se debe tomar del contenido mediante selectores XPath.

source: Used to select the children of matching elements using XPath selectors.
es: Se utiliza para seleccionar los elementos secundarios de los elementos coincidentes mediante selectores XPath.

source: Used to identify the children of an element that will be used using XPath selectors.
es: Se utiliza para identificar los elementos secundarios de un elemento que se usará mediante selectores XPath.

source: You can also create conditions about the current path using ``if-path``.
es: También puede crear condiciones sobre la ruta actual usando ``if-path``.

source: For a more comprehensive overview of all the Diazo rule directives and related attributes see: http://docs.diazo.org/en/latest/basic.html#rule-directives
es: Para obtener una descripción más completa de todas las directivas de regla de Diazo y los atributos relacionados, consulte: http://docs.diazo.org/en/latest/basic.html#rule-directives

source: Exercise 3 - The ``<drop>`` Directive
es: Ejercicio 3 - La directiva ``<drop>``

source: Add a rule that drops the "search section" checkbox from the search box. See the diagram below:
es: Agregue una regla que elimine la casilla de verificación "sección de búsqueda" del cuadro de búsqueda. Vea el diagrama a continuación:

source: The ``div`` which contains the checkbox has the class ``searchSection`` applied. To remove it, extend your :file:`rules.xml` to include the following lines:
es: El elemento ``div`` que contiene la casilla de verificación tiene la clase ''searchSection'' aplicada. Para eliminarlo, extiende tu :file:`rules.xml` para incluir las siguientes líneas:

source: Conditional Attributes
es: Atributos condicionales

source: The following attributes can be used to conditionally activate a directive.
es: Los siguientes atributos se pueden utilizar para activar condicionalmente una directiva.

source: Defines a CSS3 expression: if there is an element in the *content* that matches the expression then activate the directive.
es: Define una expresión CSS3: si hay un elemento en el *content* que coincide con la expresión, active la directiva.

source: Defines a CSS3 expression: if there is an element in the *theme* that matches the expression then activate the directive.
es: Define una expresión CSS3: si hay un elemento en el *theme* que coincide con la expresión, active la directiva.

source: Defines an XPath expression: if there is an element in the *content* that matches the expression then activate the directive.
es: Define una expresión XPath: si hay un elemento en el *content* que coincide con la expresión, active la directiva.

source: Defines an XPath expression: if there is an element in the *theme* that matches the expression then activate the directive.
es: Define una expresión XPath: si hay un elemento en el *theme* que coincide con la expresión, active la directiva.

source: Conditionally activate the current directive based on the current path.
es: Active condicionalmente la directiva actual en función de la ruta actual.

source: In a previous chapter we discussed the Plone ``<body>`` element and how to take advantage of the custom CSS classes associated with it. We were introduced to the attribute ``css:if-content``. Remember that we are able to determine a lot of context related information from the classes, such as:
es: En un capítulo anterior hablamos de la Plone ``<body>`` y cómo aprovechar las clases CSS personalizadas asociadas a él. Se nos presentó el atributo ``css:if-content``. Recuerde que podemos determinar una gran cantidad de información relacionada con el contexto de las clases, como:

source: the current user role and permissions,
es: el rol de usuario y los permisos actuales,

source: the current subsite (if any).
es: el subsitio actual (si lo hay).

source: Here is an example:
es: He aquí un ejemplo:

source: Converting An Existing HTML Template Into A Theme
es: Convertir una plantilla HTML existente en un tema

source: In the Plone "universe" it is not uncommon to convert an existing HTML template into a Diazo theme.
es: En el "universo" de Plone no es raro convertir una plantilla HTML existente en un tema Diazo.

source: Ensure that when you zip up the source theme that there is a single folder in the root of the zip file.
es: Asegúrese de que cuando comprima el tema de origen haya una sola carpeta en la raíz del archivo zip.

source: We will explore this in more detail in the next exercise.
es: Exploraremos esto con más detalle en el próximo ejercicio.

source: Exercise 4 - Convert A HTML Template Into A Diazo Theme
es: Ejercicio 4 - Convertir una plantilla HTML en un tema Diazo

source: In this exercise we will walk through the process of converting an existing free HTML theme into a Diazo-based Plone theme.
es: En este ejercicio, recorreremos el proceso de conversión de un tema HTML gratuito existente en un tema Plone basado en Diazo.

source: We've selected the free `New Age Bootstrap theme <https://github.com/BlackrockDigital/startbootstrap-new-age>`_. The theme is already packaged in a manner that will work with the theming tool.
es: Hemos seleccionado el tema gratuito `New Age Bootstrap <https://github.com/BlackrockDigital/startbootstrap-new-age>`_. El tema ya está empaquetado de una manera que funcionará con la herramienta de creación de temas.

source: When being distributed, Plone themes are packaged as zip files. A theme should be structured such that there is only one top-level directory in the root of the zip file.
es: Cuando se distribuyen, los temas de Plone se empaquetan como archivos zip. Un tema debe estar estructurado de tal manera que solo haya un directorio de nivel superior en la raíz del archivo zip.

source: By convention the directory should contain your :file:`index.html`. The supporting files (CSS, JavasSript and other files) may be in subdirectories.
es: Por convención, el directorio debe contener su archivo :file:`index.html`. Los archivos de soporte (CSS, JavasSript y otros archivos) pueden estar en subdirectorios.

source: To get started `download a copy of the New Age theme as a zip file <https://codeload.github.com/BlackrockDigital/startbootstrap-new-age/zip/master>`_. Then upload it to the theme control panel.
es: Para comenzar, `descargue una copia del tema New Age como un archivo zip <https://codeload.github.com/BlackrockDigital/startbootstrap-new-age/zip/master>`_. A continuación, súbelo al panel de control del tema.

source: This is a generic theme, it does not provide the Plone/Diazo specific :file:`rules.xml` or :file:`manifest.cfg` files. When you upload the zip file, the theming tool generates a :file:`rules.xml` file. In the next steps you will add additional files including a :file:`manifest.cfg` file (perhaps in the future the :file:`manifest.cfg` file will also be generated for you).
es: Este es un tema genérico, no proporciona los archivos específicos de Plone/Diazo archivo :file:`rules.xml` o el archivo :file:`manifest.cfg`. Al cargar el archivo zip, la herramienta de creación de temas genera un archivo :file:`rules.xml`. En los siguientes pasos, agregará archivos adicionales, incluido un archivo :file:`manifest.cfg` (quizás en el futuro también se genere el archivo :file:`manifest.cfg`).

source: Select the downloaded zip file.
es: Seleccione el archivo zip descargado.

source: Add a :file:`styles.less` file and import the Barceloneta styles (look back to Exercise 1).
es: Añade un archivo :file:`styles.less` e importa los estilos de Barceloneta (mira hacia atrás al Ejercicio 1).

source: Add a :file:`manifest.cfg` file, set ``production-css`` equal to ``styles.css``
es: Agregue un archivo :file:`manifest.cfg`, establezca ``production-css`` igual a ``styles.css``

source: *Clean Blog* is a free Bootstrap theme, the latest version is available on GitHub `<https://github.com/BlackrockDigital/startbootstrap-clean-blog>`_
es: *Clean Blog* es un tema gratuito de Bootstrap, la última versión está disponible en GitHub `<https://github.com/BlackrockDigital/startbootstrap-clean-blog>`_

source: You can identify the theme path by reading your browser's address bar when your theme is open in the theming tool. You'll need to include the proper theme path in your :file:`manifest.cfg`, in this case it will most likely be something like ``++theme++startbootstrap-new-age-master``
es: Puede identificar la ruta del tema leyendo la barra de direcciones de su navegador cuando su tema está abierto en la herramienta de temas. Tendrás que incluir la ruta del tema adecuada en tu :file:`manifest.cfg`, en este caso lo más probable es que sea algo como ``++theme++startbootstrap-new-age-master``

source: Add rules to include the Barceloneta backend utilities.
es: Agregue reglas para incluir las utilidades de backend de Barceloneta.

source: Add rules to include content, add site structure, drop unneeded elements, customize the menu.
es: Agregue reglas para incluir contenido, agregue estructura del sitio, elimine elementos innecesarios, personalice el menú.

source: Look out for inline styles in this theme (i.e. the use of the ``style`` attribute on a tag). This is especially problematic with background images set with relative paths. The two issues that result are:
es: Busca estilos en línea en este tema (es decir, el uso del atributo ``style`` en una etiqueta). Esto es especialmente problemático con imágenes de fondo establecidas con rutas relativas. Los dos problemas que se derivan son:

source: the relative path does not translate properly in the context of the theme;
es: la ruta relativa no se traduce correctamente en el contexto del tema;

source: it can be tricky to dynamically replace background images provided by inline styles.
es: puede ser complicado reemplazar dinámicamente las imágenes de fondo proporcionadas por los estilos en línea.

source: Add the theme file:
es: Agregue el archivo del tema:

source: To add the Plone-related header data, add these rules:
es: Para agregar los datos de encabezado relacionados con Plone, agregue estas reglas:

source: The attributes from the ``body`` element from Plone are important:
es: Los atributos del elemento ``body`` de Plone son importantes:

source: Add content-related rules:
es: Agregue reglas relacionadas con el contenido:

source: Create A Visitor-Only Theme - Conditionally Enabling Barceloneta
es: Crear un tema solo para visitantes - Habilitación condicional de Barceloneta

source: Sometimes it is more convenient for your website administrators to use Barceloneta, Plone's default theme. Other visitors would see a completely different layout provided by your custom theme.
es: A veces es más conveniente para los administradores de su sitio web usar Barceloneta, el tema predeterminado de Plone. Otros visitantes verán un diseño completamente diferente proporcionado por su tema personalizado.

source: To achieve this you will need to associate your visitor theme rules with an expression like ``css:if-content="body.userrole-anonymous"``. For rules that will affect logged-in users you can use the expression ``css:if-content="body:not(.userrole-anonymous)"``.
es: Para lograr esto, necesitarás asociar las reglas de tu tema de visitante con una expresión como ``css:if-content="body.userrole-anonymous"``. Para las reglas que afectarán a los usuarios registrados, puede usar la expresión ``css:if-content="body:not(.userrole-anonymous)"``.

source: Once you've combined the expressions above with the right Diazo rules you will be able to present an anonymous visitor with a specific HTML theme while presenting the Barceloneta theme to logged-in users.
es: Una vez que hayas combinado las expresiones anteriores con las reglas correctas de Diazo, podrás presentar a un visitante anónimo un tema HTML específico mientras presentas el tema de Barceloneta a los usuarios registrados.

source: The Barceloneta :file:`++theme++barceloneta/rules.xml` expects the Barceloneta :file:`index.html` to reside locally in your current theme. To avoid conflict and to accommodate the inherited Barceloneta, ensure that your theme file has a different name such as :file:`front.html`.
es: El archivo de reglas de Barceloneta :file:`++theme++barceloneta/rules.xml` espera que la Barceloneta :file:`index.html` resida localmente en su tema actual. Para evitar conflictos y acomodar la Barceloneta heredada, asegúrese de que el archivo de su tema tenga un nombre diferente, como archivo :file:`front.html`.

source: Exercise 5 - Convert The Theme To Be A Visitor-Only Theme
es: Ejercicio 5 - Convertir el tema en un tema solo para visitantes

source: In this exercise we will alter our theme from the previous exercise to make it into a visitor-only theme.
es: En este ejercicio, modificaremos nuestro tema del ejercicio anterior para convertirlo en un tema solo para visitantes.

source: Update the :file:`rules.xml` file to include Barceloneta rules.
es: Actualice el archivo :file:`rules.xml` para incluir las reglas de Barceloneta.

source: Use ``<xi:include href="++theme++barceloneta/rules.xml" />``
es: Utilice ``<xi:include href="++theme++barceloneta/rules.xml" />``

source: Add conditional rules to :file:`rules.xml` so that the new theme is only shown to anonymous users. Rename the theme's :file:`index.html` to :file:`front.html` and add a copy of the Barceloneta :file:`index.html`.
es: Agregue reglas condicionales al archivo :file:`rules.xml` para que el nuevo tema solo se muestre a usuarios anónimos. Cambia el nombre del archivo :file:`index.html` del tema a el nombre :file:`front.html` y añade una copia del :file:`index.html` de Barceloneta.

source: Copy the contents of the Barceloneta :file:`index.html` file, then add it to the theme as the new :file:`index.html` file.
es: Copie el contenido del archivo :file:`index.html` de Barceloneta, luego agréguelo al tema como el nuevo archivo :file:`index.html`.

source: Change :file:`rules.xml` to look similar to this:
es: Cambia :file:`rules.xml` para que se parezca a esto:

source: TTW Theming III: Make It Reproducible
es: Tema TTW III: Hazlo reproducible

source: You created your shiny brand new theme :term:`TTW`.
es: Has creado tu nuevo y brillante tema: term:`TTW`.
