Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/theming.po
Languages: es

source: Glossary
es: Glosario

source: `Amazon Web Services <https://aws.amazon.com/>`_ offers reliable, scalable, and inexpensive cloud computing services. ree to join, pay only for what you use.
es: `Amazon Web Services <https://aws.amazon.com/>`_ ofrece servicios de computación en la nube confiables, escalables y económicos. libre de unirse, pague solo por lo que usa.

source: `Linode.com <https://www.linode.com/>`_ is an American privately owned virtual private server provider company
es: `Linode.com <https://www.linode.com/>`_ es una empresa proveedora de servidores privada virtual de propiedad privada estadounidense

source: based in Galloway, New Jersey, United States.
es: con sede en Galloway, New Jersey, Estados Unidos.

source: `DigitalOcean, Inc. <https://www.digitalocean.com/>`_ is an American cloud infrastructure provider
es: `DigitalOcean, Inc. <https://www.digitalocean.com/>`_ es un proveedor estadounidense de infraestructura en la nube

source: headquartered in New York City with data centers worldwide.
es: con sede en la ciudad de Nueva York y centros de datos en todo el mundo.

source: `A native object database for Python <http://www.zodb.org/en/latest/>`_.
es: `Una base de datos de objetos nativos para Python <http://www.zodb.org/en/latest/>`_.

source: The default theme for Plone 5.
es: El tema por defecto para Plone 5.

source: Cascading Style Sheets (CSS) is a stylesheet language used for describing the (most of the times visual) representation of web pages.
es: Cascading Style Sheets (CSS) es un lenguaje de hojas de estilo utilizado para describir la representación (la mayoría de las veces visual) de las páginas web.

source: `Diazo <http://docs.diazo.org/en/latest/>`_ allows you to apply a theme contained in a static HTML web page to a dynamic website created using any server-side technology.
es: `Diazo <http://docs.diazo.org/en/latest/>`_ Diazo le permite aplicar un tema contenido en una página web HTML estática a un sitio web dinámico creado utilizando cualquier tecnología del lado del servidor.

source: The JavaScript Task Runner. Automates the creation and manipulation of static assets for the theme.
es: El JavaScript Task Runner. Automatiza la creación y manipulación de activos estáticos para el tema.

source: A dynamic stylesheet language that can be compiled into :term:`CSS` (Cascading Style Sheets).
es: Un lenguaje de hoja de estilo dinámico que se puede compilar en :term:`CSS` (Hojas de estilo en cascada).

source: npm is a package manager for the JavaScript programming language. It is the default package manager for the JavaScript runtime environment Node.js.
es: npm es un administrador de paquetes para el lenguaje de programación JavaScript. Es el administrador de paquetes por defecto para el entorno de tiempo de ejecución de JavaScript Node.js.

source: Through-The-Web, changes in the browser.
es: A través de la web, cambios en el navegador.

source: `Amazon S3 <https://aws.amazon.com/s3/>`_ - Object storage built to store and retrieve any amount of data from anywhere.
es: `Amazon S3 <https://aws.amazon.com/s3/>`_ - Almacenamiento de objetos creado para almacenar y recuperar cualquier cantidad de datos desde cualquier lugar.

source: `AWS OpsWorks <https://aws.amazon.com/opsworks/>`_ is a configuration management service that uses Chef,
es: `AWS OpsWorks <https://aws.amazon.com/opsworks/>`_ es un servicio de administración de configuración que usa Chef,

source: an automation platform that treats server configurations as code.
es: una plataforma de automatización que trata las configuraciones del servidor como código.

source: `Ansible <https://www.ansible.com/>`_ is an open source automation platform.
es: `Ansible <https://www.ansible.com/>`_ es una plataforma de automatización de fuente abierta.

source: Ansible can help you with configuration management, application deployment, task automation.
es: Ansible puede ayudarlo con la administración de configuraciones, el despliegue de aplicaciones y la automatización de tareas.

source: `A configuration management tool written in Ruby and Erlang <https://www.chef.io/chef/>`_.
es: `Una herramienta de gestión de configuración escrita en Ruby y Erlang <https://www.chef.io/chef/>`_.

source: `AWS CloudFormation <https://aws.amazon.com/cloudformation/>`_ gives developers and systems administrators an way to create and manage a collection of related AWS resources, provisioning and updating them in an orderly and predictable fashion.
es: `AWS CloudFormation <https://aws.amazon.com/cloudformation/>`_ brinda a los desarrolladores y administradores de sistemas una forma de crear y administrar una colección de recursos relacionados de AWS, aprovisionándolos y actualizándolos de manera ordenada y predecible.

source: Travis CI is a hosted, distributed continuous integration service used to build and test software projects hosted at GitHub. Open source projects may be tested at no charge via `travis-ci.org <https://travis-ci.org>`_.
es: Travis CI es un servicio de integración continua alojado que se utiliza para crear y probar proyectos de software alojados en GitHub. Los proyectos de código abierto pueden probarse sin cargo a través de `travis-ci.org <https://travis-ci.org>`_.

source: `Solr <http://lucene.apache.org/solr/>`_ a the popular, blazing-fast, open source enterprise search platform built on Apache Lucene.
es: `Solr <http://lucene.apache.org/solr/>`_ una popular plataforma de búsqueda empresarial de código abierto, desarrollada en Apache Lucene.

source: The `Zope Configuration Mark-up Language <https://docs.plone.org/develop/addons/components/zcml.html>`_.
es: El `Lenguaje de marcado de configuración Zope <https://docs.plone.org/develop/addons/components/zcml.html>`_.

source: `Diazo theme engine guide <http://docs.diazo.org/en/latest/>`_ Diazo allows you to apply a theme contained in a static HTML web page to a dynamic website created using any server-side technology.
es: `Guía del motor de temas Diazo <http://docs.diazo.org/en/latest/>`_ Diazo le permite aplicar un tema contenido en una página web HTML estática a un sitio web dinámico creado utilizando cualquier tecnología del lado del servidor.

source: `Dexterity <https://github.com/plone/plone.dexterity>`_, the base framework for building content types, both through-the-web and as filesystem code for Zope.
es: `Dexterity <https://github.com/plone/plone.dexterity>`_, el framework base para crear tipos de contenido, tanto a través de la web y como en el sistema de archivo en código fuente para Zope.

source: The Dublin Core Schema is a small set of vocabulary terms that can be used to describe web resources (video, images, web pages, etc.), as well as physical resources such as books or CDs, and objects like artworks.
es: El Dublin Core Schema es un pequeño conjunto de términos de vocabulario que se pueden utilizar para describir recursos web (video, imágenes, páginas web, etc.), así como recursos físicos como libros o CD y objetos como obras de arte.

source: The Zope Management Interface. The ZMI is a direct interface into the backend software stack of Plone. While it can still serve as a valuable tool for Plone specialists to fix problems or accomplish certain tasks, it is not recommended as a regular tool for Plone maintenance.
es: La Zope Management Interface. La ZMI es una interfaz directa en el stack de software backend de Plone. Si bien todavía puede servir como una herramienta valiosa para los especialistas de Plone para solucionar problemas o realizar ciertas tareas, no se recomienda como una herramienta habitual para el mantenimiento de Plone.

source: The Extensible Markup Language.
es: El lenguaje de marcado extensible.

source: The Extensible Stylesheet Language Transformations. A language which defines elements to describe transformations to be applied on a document.
es: El Extensible Stylesheet Language Transformations, o las transformaciones del lenguaje de hoja de estilo extensible. Un lenguaje que define elementos para describir las transformaciones que se aplicarán en un documento.

source: XPath (XML Path Language) is a query language for selecting nodes from an XML document.
es: XPath (XML Path Language) es un lenguaje de consulta para seleccionar nodos desde un documento XML.

source: About
es: Acerca de

source: Advanced Diazo
es: Diazo Avanzado

source: **"Diazo allows you to apply a theme contained in a static HTML web page to a dynamic website created using any server-side technology."**
es: **"Diazo le permite aplicar un tema contenido en una página web HTML estática a un sitio web dinámico creado utilizando cualquier tecnología del lado del servidor."**

source: To do this, Diazo does some real complicated stuff on your behalf: it writes XSLT!
es: Para hacer esto, Diazo hace algunas cosas realmente complicadas en su nombre: ¡escribe XSLT!

source: But sometimes basic rules are not enough and you need to write a bit of XLST yourself.
es: Pero a veces las reglas básicas no son suficientes y necesitas escribir un poco de XLST tú mismo.

source: Modify Theme And Content On The Fly
es: Modifique el tema y el contenido sobre la marcha

source: Let's look at some examples from the `official diazo docs <http://docs.diazo.org/en/latest/advanced.html#modifying-the-theme-on-the-fly>`_.
es: Veamos algunos ejemplos de la `documentación oficial de diazo <http://docs.diazo.org/en/latest/advanced.html#modifying-the-theme-on-the-fly>`_.

source: Extend Rules
es: Ampliar reglas

source: You can `re-use or extend rules <http://docs.diazo.org/en/latest/advanced.html#xinclude>`_ from another theme or from another file in your theme.
es: Puede `reutilizar o ampliar las reglas <http://docs.diazo.org/en/latest/advanced.html#xinclude>`_ desde otro tema o desde otro archivo de su tema.

source: A good example of a use case is the one described by `Asko Soukka <https://twitter.com/datakurre>`_ (thanks!!!) in this blog post about `how to Customize Plone 5 default theme on the fly <http://datakurre.pandala.org/2015/05/customize-plone-5-default-theme-on-fly.html>`_.
es: Un buen ejemplo de un caso de uso es el descrito por `Asko Soukka <https://twitter.com/datakurre>`_ (gracias!!) en esta entrada de blog sobre `cómo personalizar el tema predeterminado de Plone 5 sobre la marcha <http://datakurre.pandala.org/2015/05/customize-plone-5-default-theme-on-fly.html>`_.

source: Include External Content
es: Incluir contenido externo

source: You can `include external content <http://docs.diazo.org/en/latest/advanced.html#including-external-content>`_ from another website or from a custom view.
es: Puede `incluir contenido externo <http://docs.diazo.org/en/latest/advanced.html#including-external-content>`_ desde otro sitio web o desde una vista personalizada.

source: Recipes And Snippets
es: Recetas y fragmentos

source: The docs provide `a basic recipe set <http://docs.diazo.org/en/latest/recipes/index.html>`_ and you can have your own, but how to remember and re-use them?
es: Los documentos proporcionan `un conjunto de recetas básicas <http://docs.diazo.org/en/latest/recipes/index.html>`_ y usted puede tener el suyo propio, pero ¿cómo recordarlos y reutilizarlos?

source: `All the snippets are available here <http://pigeonflight.github.io/lessArcane/>`_.
es: `Todos los fragmentos están disponibles aquí <http://pigeonflight.github.io/lessArcane/>`_.

source: More Snippets
es: Más fragmentos

source: Make Some Links Open In New Window
es: Hacer que algunos enlaces se abran en una ventana nueva

source: At `diazo.org <http://docs.diazo.org/en/latest/recipes/adding-an-attribute/index.html>`_ is another way described.
es: En `diazo.org <http://docs.diazo.org/en/latest/recipes/adding-an-attribute/index.html>`_ se describe otra forma.

source: Add CSS Marker Classes Depending On Existing ``portal-columns``
es: Agregue clases de marcadores CSS en función de las existentes ``portal-columns``

source: This adds a CSS class for every existing ``portal-column`` to the ``body`` tag. If ``portal-column-one`` exists, we add ``col-one``; if ``portal-column-content`` exists, we add ``col-content``; and if ``portal-column-two`` exists, we add ``col-two``.
es: Esto añade una clase CSS para cada ``portal-column`` existente a la etiqueta ``body``. Si existe ``portal-column-one``, añadimos ``col-one``; si ``portal-column-content``, añadimos ``col-content``; Y si existe ``portal-column-two``, añadimos ``col-two``.

source: Now, one can use these markers to define the grid in a semantic way like this:
es: Ahora, uno puede usar estos marcadores para definir la cuadrícula de una manera semántica como esta:

source: This way, you don't need the xsl-rules Barceloneta uses to create the main content area. It's more flexible than Barceloneta's approach.
es: De esta manera, no necesitas las reglas xsl que usa Barceloneta para crear el área de contenido principal. Es más flexible que el enfoque de Barceloneta.

source: Another way could be, to change Plone to provide these classes already ;).
es: Otra forma podría ser, cambiar Plone para proporcionar estas clases ya ;-).

source: Move Plone Elements Around
es: Mover los elementos de Plone

source: Sometimes one needs to move Plone elements from one place to another or merge some elements together. In the following example we merge the language flags together with the document actions.
es: A veces es necesario mover elementos de Plone de un lugar a otro o fusionar algunos elementos. En el siguiente ejemplo, fusionamos las marcas de idioma con las acciones del documento.

source: Taking Over Specific Portlets
es: Tomar el control de portlets específicos

source: Basic: Customize The Logo And CSS From The Default Theme
es: Básico: Personaliza el logotipo y CSS desde el tema predeterminado

source: In this section you will:
es: En esta sección:

source: Use the Site control panel to add a custom logo
es: Utilice el panel de control del sitio para agregar un logotipo personalizado

source: Customize the look of a Plone site by adjusting Less Variables
es: Personalice el aspecto de un sitio de Plone ajustando variables Less

source: Add a custom toolbar logo
es: Agregar un logotipo de barra de herramientas personalizado

source: Topics covered:
es: Tópicos cubiertos:

source: The "Site" control panel
es: El panel de control "Sitio"

source: The "Resource Registries" Control Panel
es: El panel de control "Registros de recursos"

source: Resource Registries > Development Mode
es: Registros de recursos > modo desarrollo

source: Customize Logo
es: Personalizar el logotipo

source: Go to the Plone Control Panel: :menuselection:`toolbar --> admin --> Site Setup`
es: Vaya al panel de control de Plone: :menuselection:`toolbar --> admin --> Configuración del sitio`

source: Go to the "Site" control panel.
es: Vaya al panel de control "Sitio".

source: You will see this form:
es: Verás este formulario:

source: You can now add/edit/remove your custom logo.
es: Ahora puede agregar/editar/eliminar su logotipo personalizado.

source: For more information, take a look at the `official docs <https://docs.plone.org/adapt-and-extend/change-the-logo.html>`_.
es: Para más información, echa un vistazo a la `documentación oficial <https://docs.plone.org/adapt-and-extend/change-the-logo.html>`_.

source: Customize CSS/Less Variables
es: Personalizar variables CSS/Less

source: Go back to the Control Panel.
es: Vuelva al Panel de control.

source: Go to the :guilabel:`Resource Registries` control panel.
es: Vaya al panel de control :guilabel:`Registros de recursos`.

source: On the first tab: enable :guilabel:`Development Mode`.
es: En la primera pestaña: habilite :guilabel:`Modo desarrollo`.

source: In the "plone" bundle below, click on "develop CSS".
es: En el paquete "plone" a continuación, haga clic en "desarrollar CSS".

source: Your panel should now look like this:
es: Su panel ahora debería verse así:

source: Now we can play with some Less variables:
es: Ahora podemos jugar con algunas variables Less:

source: Go to the :guilabel:`Less Variables` tab.
es: Vaya a la pestaña :guilabel:`Variables Less`.

source: Find the variable ``plone-left-toolbar-expanded`` and set it to 400px.
es: Encuentra la variable ``plone-left-toolbar-expanded`` y establécela en 400px.

source: Hit the :guilabel:`Save` button in the upper right and reload the page.
es: Presione el botón :guilabel:`Guardar` en la parte superior derecha y vuelva a cargar la página.

source: Click on the toolbar logo to expand the toolbar: voilá!
es: Haga clic en el logotipo de la barra de herramientas para expandir la barra de herramientas: ¡voilá!

source: You can play around with some other variables, if you want.
es: Puedes jugar con algunas otras variables, si quieres.

source: "Development Mode" is expensive for the browser. Depending on the browser and on the system, you might encounter extreme slowness while rendering the page. You could see an unthemed page for a while.
es: El "Modo de desarrollo" es caro para el navegador. Dependiendo del navegador y del sistema, es posible que encuentre una lentitud extrema al procesar la página. Podrías ver una página sin tema durante un tiempo.

source: Remember to switch it off as soon as you finished tweaking.
es: Recuerde apagarlo tan pronto como termine de ajustarlo.

source: Customize templates on the fly with collective.jbot
es: Personaliza plantillas sobre la marcha con collective.jbot

source: Not yet compatible with Plone 5!
es: ¡Todavía no es compatible con Plone 5!

source: Back in the old days we used to customize views' templates from the tool `portal_view_customizations` from the ZMI.
es: En los viejos tiempos, solíamos personalizar las plantillas de vistas desde la herramienta `portal_view_customizations` de ZMI.

source: This tool has no UI (User Interface) and could beat you whenever you don't expect it.
es: Esta herramienta no tiene UI (interfaz de usuario) y podría vencerte cuando menos lo esperes.

source: `Nathan Van Gheem <https://twitter.com/vangheezy>`_ has created this package that unfortunately is not (yet!) part of the core: `collective.jbot <https://github.com/collective/collective.jbot>`_.
es: `Nathan Van Gheem <https://twitter.com/vangheezy>`_ ha creado este paquete que desafortunadamente no es (¡todavía!) parte del núcleo: `collective.jbot <https://github.com/collective/collective.jbot>`_.

source: This package uses the well-known `z3c.jbot` under the hood and allows you to customize templates TTW (Through-The-Web) from the control panel.
es: Este paquete utiliza el conocido `z3c.jbot` bajo el capó y le permite personalizar plantillas TTW (Through-The-Web) desde el panel de control.

source: Installation
es: Instalación

source: Usage
es: Uso

source: Additional
es: Adicional

source: Overrides are stored on the filesystem and you can version / backup them as you like!
es: ¡Las anulaciones se almacenan en el sistema de archivos y puede versionarlas / respaldarlas como desee!

source: Creating Custom Components
es: Creando Componentes Personales

source: Plone is a powerful system and it provides many interesting features and function. To dive into this, we recommend to go through the ``Mastering Plone 5: Development`` of the training.
es: Plone es un sistema potente y proporciona muchas características y funciones interesantes. Para profundizar en esto, recomendamos pasar por el ``Maestria en Plone 5: Desarrollo`` de la formación.

source: For theming the most relevant part are the following components, which render some parts of Plone, you may want to customize or build new once.
es: Para la tematización, la parte más relevante son los siguientes componentes, que renderizan algunas partes de Plone, es posible que desee personalizar o construir nuevos una vez.

source: Views
es: Vistas

source: In Plone a view usually consists of multiple components, a Python class based on BrowserView and a template which renders the markup. Is is possible to have a template which is only a view.
es: En Plone, una vista suele constar de varios componentes, una clase de Python basada en BrowserView y una plantilla que representa el marcado. Es posible tener una plantilla que sea solo una vista.

source: It is also possible to have a view which has no template, but renders the output by it self, as JSON for example.
es: También es posible tener una vista que no tenga plantilla, pero que renderice la salida por sí misma, como JSON, por ejemplo.

source: For more details about views and there possibilities see the view sections of the ``Mastering Plone 5: Development`` chapters.
es: Para obtener más detalles sobre las vistas y las posibilidades, consulte las secciones de vistas de los capítulos ``Maestria en Plone 5: Desarrollo``.

source: Viewlets are small pieces which are rendered inside a view. The are registered for a ordered ViewletManager, which renders all Viewlets in the given order. You can change the order even TTW (Through-The-Web) or via configuration.
es: Los viewlets son pequeñas piezas que se renderizan dentro de una vista. Se registran para un ViewletManager ordenado, que representa todos los Viewlets en el orden dado. Puede cambiar el orden incluso TTW (a través de la web) o mediante la configuración.

source: A Viewlet consists of a Viewlet Python class and a template.
es: Un Viewlet consta de una clase de Python de Viewlet y una plantilla.

source: Plone has default Viewlets and ViewletManagers like ContentAbove and BelowContent which you can use to register small pieces of functionality.
es: Plone tiene Viewlets y ViewletManagers predeterminados como ContentAbove y BelowContent que puede usar para registrar pequeñas piezas de funcionalidad.

source: For an overview of existing Viewlets and ViewletManagers look at the ``/@@manage-viewlets`` view.
es: Para obtener una descripción general de los Viewlets y ViewletManagers existentes, consulte la vista ``/@@manage-viewlets``.

source: For more details about Viewlets/ViewletManagers and there possibilities see the Viewlets sections of the `Mastering Plone 5: Development chapters <https://training.plone.org/5/mastering-plone/viewlets_1.html>`_.
es: Para obtener más detalles sobre Viewlets/ViewletManagers y sus posibilidades, consulte las secciones de Viewlets de los capítulos de desarrollo en `Maestria en Plone 5: <https://training.plone.org/5/mastering-plone/viewlets_1.html>`_.

source: Portlets are a very flexible way of providing context related information in the right, left or footer area.
es: Los portlets son una forma muy flexible de proporcionar información relacionada con el contexto en el área derecha, izquierda o de pie de página.

source: For details on how to use, configure and create Portlets, look into the Plone docs `Plone docs Portlet sections <https://docs.plone.org/develop/plone/functionality/portlets.html>`_.
es: Para obtener más información sobre cómo utilizar, configurar y crear portlets, consulte la documentación de Plone como `Secciones del portlet <https://docs.plone.org/develop/plone/functionality/portlets.html>`_.

source: Plone Theming
es: Temas en Plone

source: Adjusting the visual representation of Plone with :term:`Diazo`
es: Ajustando la representación visual de Plone con :term:`Diazo`

source: Level
es: Nivel

source: All levels
es: Todos los niveles

source: **Training Objective**
es: **Objetivo de la formación**
