Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/thirdparty_behaviors.po
Languages: es

source: Add teaser with collective.behavior.banner
es: Agregar el comportamiento de banner con el complemento ``collective.behavior.banner``

source: There are a lot of add-ons in Plone for sliders/banners/teasers. We thought there should be a better one and created ``collective.behavior.banner``.
es: Hay un montón de complementos en Plone para diapositivas / banners / teasers. Nosotros pensamos que debe haber un mejor complemento y fue creado ``collective.behavior.banner``.

source: Like many add-ons it has not yet been released on pypi but only exists as code on github.
es: Al igual muchos complementos que aún no se ha lanzado en PyPI pero sólo existe como código fuente en GitHub.

source: The training buildout has a section ``[sources]`` that tells buildout to download a specific add-on not from pypi but from some code repository (usually github):
es: El buildout del entrenamiento contiene una sección ``[sources]`` que le dice buildout para descargar un complemento específico no disponible en PyPI sino en algún repositorio de código (generalmente GitHub):

source: Pinning the revision saves us from being surprised by changes in the code we might not want.
es: Definiendo la revisión nos salva de ser sorprendidos por algunos cambios en el código fuente que puede que no querríamos tener.

source: After adding the source, we need to add the egg to buildout:
es: Después de añadir el código fuente, tenemos que añadir el paquete ``Egg`` al archivo buildout:

source: And rerun ``./bin/buildout``
es: Y vuelva a ejecutar el comando ``./bin/buildout``

source: Install the ad-don
es: Instalar el complemento

source: Create a new dexterity content type ``Banner`` with **only** the behavior ``Banner`` enabled.
es: Crear un nuevo tipo de contenido Dexterity ``Banner`` con **sólo** el comportamiento ``Banner`` habilitado.

source: Create a folder called ``banners``
es: Crear una carpeta llamada ``banners``

source: Add two banners into that folder using images taken from http://lorempixel.com/800/150/
es: Agregar dos banners dentro de la carpeta usando imágenes tomadas desde la dirección URL http://lorempixel.com/800/150/

source: Add the Behavior ``Slider`` to the default contenttype ``Page (Document)``
es: Agregar el comportamiento ``Slider`` al tipo de contenido por defecto ``Página (Document)``
