Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/ttw.po
Languages: es

source: The Mosaic Editor
es: El editor Mosaic

source: To enable the Mosaic editor on a content item change its default display as follows: go to :menuselection:`Display --> Mosaic layout`.
es: Para habilitar el editor Mosaic en un elemento de contenido, cambie su visualización por defecto de la siguiente manera: vaya a :menuselection:`Mostrar --> Diseño en mosaico`.

source: You have now enabled the Mosaic editor as a replacement for the default edit form.
es: Ahora ha habilitado el editor de mosaico como reemplazo del formulario de edición predeterminado.

source: Click on :guilabel:`Edit`. If this is the first time editing the current item, you will be prompted to select a layout.
es: Haga clic en :guilabel:`Editar`. Si es la primera vez que edita el elemento actual, se le pedirá que seleccione un diseño.

source: Choose a layout.
es: Elija un diseño.

source: This editor allows to change our content fields content (like the regular Plone form), but the fields are rendered into the view layout and they are edited in-place.
es: Este editor permite cambiar el contenido de nuestros campos de contenido (como el formulario Plone normal), pero los campos se representan en el diseño de la vista y se editan en el lugar.

source: The top bar offers different buttons:
es: La barra superior ofrece diferentes botones:

source: :guilabel:`Save`, to save our field entries.
es: :guilabel:`Guardar`, para guardar nuestras entradas de campo.

source: :guilabel:`Cancel`, to cancel our changes.
es: :guilabel:`Cancelar`, para cancelar nuestros cambios.

source: :guilabel:`Properties`, to access the content properties: it displays the regular Plone form tabs, but the fields currently involved in the layout are hidden.
es: :guilabel:`Propiedades`, para acceder a las propiedades del contenido: muestra las pestañas regulares del formulario Plone, pero los campos actualmente involucrados en el diseño están ocultos.

source: :guilabel:`Layout`, to manage the content layout.
es: :guilabel:`Diseño`, para gestionar el diseño del contenido.

source: Exercise 1 - Change The Layout Of The Front Page
es: Ejercicio 1 - Cambiar el diseño de la página principal

source: Go to the front page of the website and update the layout as follows:
es: Vaya a la página principal del sitio web y actualice el diseño de la siguiente manera:

source: Activate :menuselection:`Display --> Mosaic layout`.
es: Activar :menuselection:`Display --> Diseño Mosaic`.

source: :guilabel:`Edit` and select the "*Document*" layout.
es: :guilabel:`Editar` y seleccione el diseño "*Documento*".

source: Then select :menuselection:`Layout --> Customize`.
es: A continuación, seleccione :menuselection:`Diseño --> Personalizar`.

source: Add a *Document Byline* to the bottom of the layout :menuselection:`Insert > Document Byline`.
es: Añada una *Firma del documento* en la parte inferior del diseño :menuselection:`Insertar > línea de documento`.

source: Click :guilabel:`Save`.
es: Haga clic en :guilabel:`Guardar`.

source: In the context of the Mosaic Editor, do you know the difference between :guilabel:`Save` and :menuselection:`Layout --> Save`?
es: En el contexto del Editor de mosaicos, ¿conoce la diferencia entre :guilabel:`Guardar` y :menuselection:`Diseño --> Guardar`?

source: Change The Content Layout
es: Cambiar el diseño del contenido

source: If we click on :menuselection:`Layout --> Change`, we can choose the layout we want for our content. The choices are restricted to the layout applicable to the current content-type.
es: Si hacemos clic en :menuselection:`Diseño --> Cambiar`, podemos elegir el diseño que queremos para nuestro contenido. Las opciones están restringidas al diseño aplicable al tipo de contenido actual.

source: For instance for a *Page*, Mosaic proposes (by default) two layouts: *Basic* and *Document*.
es: Por ejemplo, para una *Página*, Mosaic propone (por defecto) dos diseños: *Básico* y *Documento*.

source: Customize A Content Layout
es: Personalizar un diseño de contenido

source: If we click on :menuselection:`Layout --> Customize`, the Mosaic editor switches to the layout mode, where we can still change our field values, but also change the layout:
es: Si hacemos clic en :menuselection:`Diseño --> Personalizar`, el editor de mosaicos cambia al modo de diseño, donde aún podemos cambiar los valores de nuestros campos, pero también cambiar el diseño:

source: by hovering the page content, existing tiles are highlighted and we can drag & drop them in different places,
es: al pasar el cursor sobre el contenido de la página, se resaltan los mosaicos existentes y podemos arrastrarlos y soltarlos en diferentes lugares,

source: by clicking in a tile, we can edit its content,
es: al hacer clic en un mosaico, podemos editar su contenido,

source: by clicking outside the currently edited tile, we disable the edit mode.
es: al hacer clic fuera del mosaico editado actualmente, deshabilitamos el modo de edición.

source: In layout mode, the top bar contains two extra buttons:
es: En el modo de diseño, la barra superior contiene dos botones adicionales:

source: :guilabel:`Format`, which provides different simple formatting options for tiles (text padding, floating) or for rows (change background color),
es: :guilabel:`Formato`, que proporciona diferentes opciones de formato simples para mosaicos (relleno de texto, flotante) o para filas (cambiar el color de fondo),

source: :guilabel:`Insert`, which allows to add new tiles to our layout.
es: :guilabel:`Insertar`, que permite añadir nuevas baldosas a nuestro diseño.

source: The Tiles
es: Los mosaicos

source: Mosaic provides the following tiles:
es: Mosaic proporciona los siguientes mosaicos:

source: Structure tiles:
es: Mosaicos de estructura:

source: heading,
es: encabezado,

source: subheading,
es: sub-encabezado,

source: text,
es: texto,

source: table,
es: tabla,

source: bulleted list,
es: lista no ordenada,

source: numbered list,
es: lista numerada,

source: table of contents,
es: tabla de contenido,

source: navigation: this tile displays a navigation menu. Its settings can be changed in a modal window (click on the :guilabel:`i` button on the bottom-right corner to display the modal),
es: navegación: este mosaico muestra un menú de navegación. Su configuración se puede cambiar en una ventana modal (haga clic en el botón :guilabel:`i` en la esquina inferior derecha para mostrar el modal),

source: Media:
es: Multimedia:

source: image,
es: imagen,

source: embed: it allows to display any remote embeddable content (like a YouTube video for instance),
es: embed: permite mostrar cualquier contenido incrustable a distancia (como un vídeo de YouTube, por ejemplo),

source: attachment,
es: adjunto,

source: Fields: all the existing fields of the current content,
es: Campos: todos los campos existentes del contenido actual,

source: Applications: for now, there is only Discussion, which shows the discussion form (discussion needs to be enable in the site setup),
es: Aplicaciones: por ahora, solo existe Discusión, que muestra el formulario de discusión (la discusión debe estar habilitada en la configuración del sitio),

source: Properties:
es: Propiedades:

source: document byline,
es: documento por línea,

source: related contents,
es: contenidos relacionados,

source: keywords,
es: palabras claves,

source: Advanced:
es: Avanzado:

source: content listing: this is a collection-like tile. It allows to list all contents matching given criteria (which be edited in the modal window),
es: listado de contenido: Este es un mosaico similar a una colección. Permite listar todos los contenidos que coinciden con los criterios dados (que se editan en la ventana modal),

source: existing content: it allows to display any content item in a tile.
es: contenido existente: Permite mostrar cualquier elemento de contenido en un mosaico.

source: if Rapido is installed, there is also a Rapido tile, which allows to display any Rapido block.
es: si Rapido está instalado, también hay un mosaico de Rapido, que permite mostrar cualquier bloque de Rapido.

source: Exercise 2: Customize The Home Page Layout
es: Ejercicio 2: Personalizar el diseño de la página de inicio

source: Create an attractive layout for the home page.
es: Crea un diseño atractivo para la página de inicio.

source: Go to the :guilabel:`Display` menu and select :guilabel:`Mosaic layout`,
es: Vaya al menú :guilabel:`Mostrar` y seleccione :guilabel:`Diseño de mosaico`,

source: Click :guilabel:`Edit`,
es: Haga clic en :guilabel:`Editar`,

source: Click on :menuselection:`Layout --> Customize`,
es: Haga clic en :menuselection:`Diseño --> Personalizar`,

source: Change the layout,
es: Cambiar el diseño,

source: Create A Reusable Layout
es: Crear un diseño reutilizable

source: When the layout has been customized, the :guilabel:`Layout` menu offers a :guilabel:`Save` action.
es: Cuando se ha personalizado el diseño, el menú :guilabel:`Diseño` ofrece una acción :guilabel:`Guardar`.

source: This action allows to save the current layout as a reusable layout.
es: Esta acción permite guardar el diseño actual como un diseño reutilizable.

source: If :guilabel:`Global` is checked, the layout will be usable by any user (else it is restricted to the current user).
es: Si :guilabel:`Global` está marcado, el diseño será utilizable por cualquier usuario (de lo contrario, está restringido al usuario actual).

source: The layout is associated with the current content type. By default it will not be usable for other content types.
es: El diseño está asociado con el tipo de contenido actual. De forma predeterminada, no se podrá utilizar para otros tipos de contenido.

source: Once saved, our layout will be listed with the other available layouts when we click on :menuselection:`Layout --> Change`.
es: Una vez guardado, nuestro diseño se enumerará con los otros diseños disponibles cuando hagamos clic en :menuselection:`Diseño --> Cambiar`.

source: Exercise 3: Create A Layout For Talks
es: Ejercicio 3: Crear un diseño para charlas

source: This exercise assumes that you have created a content type called "Talk". You can quickly create one by the following the steps in the `Dexterity: Creating TTW content types <dexterity.html#creating-contenttypes-ttw>`_ documentation.
es: En este ejercicio se supone que ha creado un tipo de contenido denominado "Talk". Puede crear uno rápidamente siguiendo los pasos de la documentación `Dexterity: Creación de tipos de contenido TTW <dexterity.html#creating-contenttypes-ttw>`_.

source: Create an attractive layout for a talk, save it and reuse it for another talk.
es: Crea un diseño atractivo para una charla, guárdalo y reutilízalo para otra charla.

source: customize a talk layout (see Exercise 2),
es: personalizar el diseño de una charla (véase el Ejercicio 2),

source: click on :menuselection::menuselection:`Layout --> Save`,
es: haga clic en :menuselection:`Diseño --> Guardar`,

source: enter its title: "Talk", and select "Global",
es: introduzca su título: "Charla" y seleccione "Global",

source: click :guilabel:`Save`,
es: haga clic en :guilabel:`Guardar`,

source: navigate to another talk,
es: navega a otra charla,

source: go to :guilabel:`Display` menu and select "Mosaic layout",
es: vaya al menú :guilabel:`Mostrar` y seleccione "Diseño Mosaic",

source: click :guilabel:`Edit`,
es: haga clic en :guilabel:`Editar`,

source: click on :menuselection:`Layout --> Change`,
es: haga clic en :menuselection:`Diseño --> Cambiar`,

source: choose "Talk".
es: elija "Charla".

source: Manage Custom Layouts
es: Administrar diseños personalizados

source: Custom layouts can be managed from the Plone control panel:
es: Los diseños personalizados se pueden administrar desde el panel de control de Plone:

source: click on :menuselection:`user menu --> Site settings`,
es: haga clic en :menuselection:`menú de usuario --> Configuración del sitio`,

source: click on :guilabel:`Mosaic Layout Editor` (in the last section, namely :guilabel:`Add-on configuration`),
es: haga clic en :guilabel:`Editor de diseño Mosaic` (en la última sección, es decir, :guilabel:`Configuración de complementos`),

source: In the third tab of this control panel, named :guilabel:`Show/hide content layouts`, we can see the existing layouts, their associated content types, and we can deactivate (or re-activate) them by clicking on :guilabel:`Hide` (or :guilabel:`Show`).
es: En la tercera pestaña de este panel de control, llamada :guilabel:`Mostrar/ocultar diseños de contenido`, podemos ver los diseños existentes, sus tipos de contenido asociados, y podemos desactivarlos (o reactivarlos) haciendo clic en :guilabel:`Ocultar` (o :guilabel:`Mostrar`).

source: In the first tab, named :guilabel:`Content layouts`, there is a source editor.
es: En la primera pestaña, llamada :guilabel:`Diseños de contenido`, hay un editor de código fuente.

source: By editing :file:`manifest.cfg`, we can assign a layout to another content type by changing the ``for =`` line. If we remove this line, the layout is available for any content type.
es: Al editar el archivo :file:`manifest.cfg`, podemos asignar un diseño a otro tipo de contenido cambiando la línea ``for =``. Si eliminamos esta línea, el diseño está disponible para cualquier tipo de contenido.

source: We can also delete the layout section from :file:`manifest.cfg`, and the layout will be deleted (if we do so, it is recommended to delete its associated HTML file too).
es: También podemos eliminar la sección de diseño del archivo :file:`manifest.cfg`, y el diseño se eliminará (si lo hacemos, se recomienda eliminar también su archivo HTML asociado).

source: Deleting a custom layout can also be managed in another way:
es: La eliminación de un diseño personalizado también se puede administrar de otra manera:

source: Note: the second tab, named :guilabel:`Site layouts`, is not usable for now.
es: Nota: la segunda pestaña, llamada :guilabel:`Diseños del sitio`, no se puede usar por ahora.

source: Edit The Layout HTML Structure
es: Editar la estructura HTML del diseño

source: In the Mosaic Layout Editor's first tab (:guilabel:`Content layouts`), :file:`manifest.cfg` is not the only editable file.
es: En la primera pestaña del Editor de diseño de mosaico (:guilabel:`Diseños de contenido`), en el archivo :file:`manifest.cfg` no es el único archivo editable.

source: There are also some HTML files. Each of them corresponds to a layout and they represent what we have built by drag & dropping tiles in our layouts.
es: También hay algunos archivos HTML. Cada uno de ellos corresponde a un diseño y representan lo que hemos construido arrastrando y soltando mosaicos en nuestros diseños.

source: Using the code editor, we can change this HTML structure manually instead of using the WYSIWIG editor.
es: Usando el editor de código, podemos cambiar esta estructura HTML manualmente en lugar de usar el editor WYSIWIG.

source: Layouts are implemented in regular HTML using nested ``<div>`` elements and specific CSS classes. Those classes are provided by the Mosaic grid which works like any CSS grid:
es: Los diseños se implementan en HTML normal utilizando anidado ``<div>`` y clases CSS específicas. Esas clases son proporcionadas por la cuadrícula Mosaic que funciona como cualquier cuadrícula CSS:

source: structure:
es: estructura:

source: sizes:
es: tamaños:

source: positions:
es: posiciones:

source: Import Layouts
es: Importar diseños

source: We might want to work on a layout on our development server, and then be able to deploy it on our production server.
es: Es posible que queramos trabajar en un diseño en nuestro servidor de desarrollo y, a continuación, poder implementarlo en nuestro servidor de producción.

source: We can achieve that using the Mosaic editor control panel, which allows to copy the layout HTML structure and its declaration in :file:`manifest.cfg`.
es: Podemos lograrlo usando el panel de control del editor Mosaic, que permite copiar la estructura HTML del diseño y su declaración en el archivo :file:`manifest.cfg`.

source: `Rapido <https://rapidoplone.readthedocs.io/en/latest/>`_ allows you to create Plone applications in the Theme.
es: `Rapido <https://rapidoplone.readthedocs.io/en/latest/>`_ le permite crear aplicaciones Plone en el Tema.

source: Create a :guilabel:`Like` button on any talk so that visitors can cast votes,
es: Crear un botón :guilabel:`Me gusta` en cualquier charla que esos visitantes puedan tener la posibilidad de votar,

source: Display the total of votes next to the button,
es: Mostrar el total de votos junto al botón,

source: Create a "Top 5" page,
es: Crear una página de los 5 elementos más votados,

source: Reset the votes on workflow change.
es: Restablezca los votos sobre el cambio de flujo de trabajo.

source: Create a Rapido app.
es: Crea una aplicación Rapido.

source: Insert Rapido blocks in Plone pages.
es: Inserte bloques de Rapido en las páginas de Plone.

source: Implement scripts in Rapido.
es: Implementar scripts en Rapido.

source: What is Rapido?
es: ¿Qué es Rapido?

source: used to extend your Plone site features,
es: utilizado para ampliar las características de su sitio Plone,

source: which works entirely through the theming tool.
es: que funciona completamente a través de la herramienta de tematización.

source: Rapido is a Plone add-on that allows implementation of custom features on top of Plone. It is a simple yet powerful way to extend the behavior of your Plone site without using the underlying frameworks. The **Plone theming tool** is the interface used to build :py:mod:`rapido.plone` applications. This means that Rapido applications can be written both **on the file system** or using the **inline editor** of the Plone theming tool.
es: Rapido es un complemento de Plone que permite la implementación de funciones personalizadas sobre Plone. Es una forma simple pero poderosa de ampliar el comportamiento de su sitio Plone sin usar los marcos subyacentes. La **herramienta de tematización Plone** es la interfaz utilizada para crear aplicaciones :py:mod:`rapido.plone`. Esto significa que las aplicaciones de Rapido se pueden escribir tanto **en el sistema de archivos** como utilizando el **editor en línea** de la herramienta de temas Plone.

source: A Rapido application is a part of your current theme: It can be imported, exported, copied, modified, etc. like the rest of the theme. But in addition to layout and design elements, it can contain business logic implemented in Python.
es: Una aplicación Rapido es una parte de su tema actual: puede ser importada, exportada, copiada, modificada, etc. como el resto del tema. Pero además de los elementos de diseño y disposición, puede contener lógica empresarial implementada en Python.

source: A couple of comparisons
es: Un par de comparaciones

source: Unlike :term:`Dexterity`, it focuses on features, not on content types.
es: A diferencia de :term:`Dexterity`, se centra en las características, no en los tipos de contenido.

source: Rapido apps can be displayed using :term:`Diazo`, or as a Mosaic tile, but they cannot manage design or layouts.
es: Las aplicaciones de Rapido se pueden mostrar usando :term:`Diazo`, o como un mosaico de mosaico, pero no pueden administrar el diseño o los diseños.

source: Unlike Plone development, it is quick and easy to write Rapido apps.
es: A diferencia del desarrollo de Plone, es rápido y fácil escribir aplicaciones Rapido.

source: Compared to **Dexterity**:
es: En comparación con **Dexterity**:

source: Dexterity focuses on content types. Content types can only use the Plone business logic, you cannot implement your own logic.
es: Dexterity se centra en los tipos de contenido. Los tipos de contenido solo pueden usar la lógica de negocios de Plone, no puede implementar su propia lógica.

source: By contrast, using Rapido you can implement your own logic; however you can only store data records, not **Plone content items** (at least, not directly like Dexterity does).
es: Por el contrario, con Rapido puedes implementar tu propia lógica; sin embargo, solo puede almacenar registros de datos, no **elementos de contenido de Plone** (al menos, no directamente como lo hace Dexterity).

source: Compared to **Diazo** and **Mosaic**:
es: En comparación con **Diazo** y **Mosaic**:

source: :term:`Diazo` manages the Plone theme,
es: :term:`Diazo` gestiona el tema Plone,

source: Mosaic allows you to manage layouts by positioning tiles,
es: Mosaic le permite administrar diseños colocando mosaicos,

source: Rapido does not do either theming or layouts, but a Rapido block can be called from a Diazo rule or displayed in a Mosaic tile.
es: Rapido no crea temas ni diseños, pero se puede llamar a un bloque de Rapido desde una regla de Diazo o mostrarlo en un mosaico.

source: Compared to conventional Plone development:
es: En comparación con el desarrollo convencional de Plone:

source: Rapido is simpler: no need to learn about any framework, no need to create Python eggs,
es: Rapido es más simple: no es necesario aprender sobre ningún framework, no es necesario crear paquetes eggs de Python,

source: but Rapido code runs in restricted mode, so you cannot import any unsafe Python module in your code.
es: pero el código de Rapido se ejecuta en modo restringido, por lo que no puede importar ningún módulo de Python inseguro en su código.

source: For the training, we will use a `Heroku instance pre-configured with Plone <https://github.com/collective/training-sandbox>`_.
es: Para el entrenamiento, utilizaremos una `instancia de Heroku preconfigurada con Plone <https://github.com/collective/training-sandbox>`_.

source: Once deployed:
es: Una vez desplegado:

source: Create a Plone site,
es: Crear un sitio Plone,

source: Go to: :menuselection:`Plone control panel -> Add-ons`,
es: Vaya a: :menuselection:`Panel de control Plone -> Complementos`,

source: Finally: install Rapido.
es: Por último: instala Rapido.

source: But to deploy Rapido on an actual Plone instance, modify :file:`buildout.cfg` to add Rapido as a dependency:
es: Pero para implementar Rapido en una instancia real de Plone, modifique el archivo :file:`buildout.cfg` para añadir Rapido como una dependencia:

source: Run your buildout:
es: Ejecute su buildout:

source: Then go to :menuselection:`Plone control panel -> Add-ons` ``http://localhost:8080/Plone/prefs_install_products_form``, and install Rapido.
es: A continuación, vaya a :menuselection:`Panel de control Plone -> Complementos` ``http://localhost:8080/Plone/prefs_install_products_form``, e instale Rapido.

source: Principles
es: Principios

source: :term:`Rapido application`
es: :term:`Aplicación Rapido`

source: :dfn:`Rapido application`
es: :dfn:`Aplicación Rapido`

source: How To Create A Rapido App
es: Cómo crear una aplicación Rapido

source: A folder in our Diazo theme::
es: Una carpeta en nuestro tema Diazo:

source: A sub-folder with blocks::
es: Una subcarpeta con bloques:

source: A Rapido app is defined by a set of files in our Diazo theme.
es: Una aplicación Rapido se define por un conjunto de archivos en nuestro tema Diazo.

source: The files need to be in a specific location
es: Los archivos deben estar en una ubicación específica

source: Here is a typical layout for a Rapido app
es: Este es un diseño típico para una aplicación Rapido

source: ADD SCREENSHOT HERE
es: AÑADE UNA CAPTURA DE PANTALLA AQUÍ

source: Blocks And Elements
es: Bloques y elementos

source: Blocks are the app components.
es: Los bloques son los componentes de la aplicación.

source: They contain *elements* (fields, buttons, etc.)
es: Contienen *elementos* (campos, botones, etc.)

source: A block is defined by 3 files:
es: Un bloque está definido por 3 archivos:

source: a YAML file to declare *elements*,
es: un archivo YAML para declarar *elementos*,
