Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/ttw.po
Languages: es

source: You can configure and customize a lot in Plone through the web. The most important options are accessible in the `Plone control panel <http://localhost:8080/Plone/@@overview-controlpanel>`_ but some are hidden away in the `ZMI <http://localhost:8080/Plone/manage>`_.
es: Se pueden configurar y personalizar muchas cosas en Plone a través de la web. Las opciones más importantes están accesibles en el `Panel de control Plone <http://localhost:8080/Plone/@@overview-controlpanel>`_, pero algunas están ocultas en el `ZMI <http://localhost:8080/Plone/manage>`_.

source: The amount and presentation of information is overwhelming but you'll get the hang of it through a lot of practice.
es: La cantidad y la presentación de la información es abrumadora, pero la dominarás a través de mucha práctica.

source: In this part you will:
es: En esta parte vamos a tratar:

source: Create a new content type called *Talk*.
es: Crea un nuevo tipo de contenido llamado *Talk*.

source: Content types
es: Tipos de contenidos

source: Archetypes and Dexterity
es: Archetypes y Dexterity

source: Fields
es: Campos

source: What Is A Content Type?
es: ¿Qué es un tipo de contenido?

source: A content type is a kind of object that can store information and is editable by users. We have different content types to reflect the different kinds of information about which we need to collect and display information. Pages, folders, events, news items, files (binary) and images are all content types.
es: Un tipo de contenido es un tipo de objeto que puede almacenar información y que los usuarios pueden editar. Tenemos diferentes tipos de contenido para reflejar los diferentes tipos de información sobre los que necesitamos recopilar y mostrar información. Las páginas, las carpetas, los eventos, las noticias, los archivos (binarios) y las imágenes son tipos de contenido.

source: It is common in developing a web site that you'll need customized versions of common content types, or perhaps even entirely new types.
es: Es común en el desarrollo de un sitio Web usted necesitará versiones personalizadas de los tipos de contenido comunes, o tal vez incluso totalmente nuevos tipos.

source: Remember the requirements for our project? We wanted to be able to solicit and edit conference talks. We *could* use the **Page** content type for that purpose.
es: ¿Recuerdas los requisitos de nuestro proyecto? Queríamos ser capaces de solicitar y editar charlas de conferencias. *Podríamos* usar el tipo de contenido **Page** para ese propósito.

source: But we need to make sure we collect certain bits of information about a talk and we couldn't be sure to get that information if we asked potential presenters to create a page.
es: Pero tenemos que asegurarnos de recopilar ciertos fragmentos de información sobre una charla y no podríamos estar seguros de obtener esa información si pedimos a los posibles presentadores que creen una página.

source: Also, we'll want to be able to display talks featuring that special information, and we'll want to be able to show collections of talks.
es: Además, querremos poder mostrar charlas con esa información especial, y querremos poder mostrar colecciones de charlas.

source: A custom content type will be ideal.
es: Un tipo de contenido personalizado será ideal.

source: The Makings Of A Plone Content Type
es: Los ingredientes de un tipo de contenido Plone

source: Every Plone content type has the following parts:
es: Cada tipo de contenido Plone tiene las siguientes partes:

source: Schema
es: Esquema

source: A definition of fields that comprise a content type; properties of an object.
es: Una definición de campos que comprenden un tipo de contenido; propiedades de un objeto.

source: The "Factory Type Information" configures the content type in Plone, assigns it a name, an icon, additional features and possible views to it.
es: La "Factory Type Information" configura el tipo de contenido en Plone, asigna un nombre, un icono, características adicionales y posibles vistas.

source: Views
es: Vistas

source: A view is a representation of the object and the content of its fields that may be rendered in response to a request. You may have *one or more* views for an object. Some may be *visual* — intended for display as web pages — others may be intended to satisfy AJAX requests and render content in formats like JSON or XML.
es: Una vista es una representación del objeto y el contenido de sus campos que pueden prestarse en respuesta a una solicitud. Usted puede tener *una o más* vistas de un objeto. Algunos pueden ser *visuales* - destinados a la pantalla en forma de páginas Web - otros pueden estar destinados a satisfacer las peticiones AJAX y estar en formatos como JSON o XML.

source: Dexterity And Archetypes
es: Dexterity y Archetypes

source: There are two content frameworks in Plone:
es: Hay dos framworks de contenido en Plone:

source: *Dexterity*: new and the coming default.
es: Dexterity: nuevo y el que vendra por defecto.

source: *Archetypes*: old, tried and tested. Widespread, used in many add-ons.
es: Archetypes: los tipos de contenidos viejos, intentados y probados. Generalizado, utilizado en muchos complementos.

source: Plone 4.x: Archetypes is the default, with Dexterity available.
es: Plone 4.x: Archetypes es el predeterminado, con Dexterity disponible.

source: Plone 5.x: Dexterity is the default, with Archetypes available.
es: Plone 5.x: Dexterity es el defecto, con Archetypes disponible.

source: For both, add and edit forms are created automatically from a schema.
es: Por tanto, añadir y editar formularios se crean automáticamente a partir de un esquema.

source: What are the differences?
es: ¿Cuales son las diferencias?

source: Dexterity: New, faster, modular, no dark magic for getters and setters.
es: Dexterity: Nuevo, más rápido, modular, no hay magia oscura para los métodos getters y setters.

source: Archetypes had magic setter/getter - use :py:meth:`talk.getAudience()` for the field :py:attr:`audience`.
es: Archetypes tiene métodos mágicos setter / getter - usa :py:meth:`talk.getAudience()` para el campo :py:attr:`audience`.

source: Dexterity: fields are attributes: :py:attr:`talk.audience` instead of :py:meth:`talk.getAudience()`.
es: Dexterity: los campos son atributos: :py:attr:`talk.audience` en vez de :py:meth:`talk.getAudience()`.

source: "Through The Web" or TTW, i.e. in the browser, without programming:
es: "Through The Web" o TTW, es decir, A través de la Web en el navegador, sin programación:

source: Dexterity has a good TTW story.
es: Dexterity tiene una buena historia a través de la Web.

source: Archetypes has no TTW story.
es: Archetypes no tiene historia a través de la Web.

source: UML-modeling: `ArchGenXML <https://docs.plone.org/old-reference-manuals/archgenxml/index.html>`_ for Archetypes, `agx <https://web.archive.org/web/20170411060701/http://agx.me/>`_ for Dexterity
es: Modelado UML: `ArchGenXML <https://docs.plone.org/old-reference-manuals/archgenxml/index.html>`_ para Archetypes, `agx <https://web.archive.org/web/20170411060701/http://agx.me/>`_ para Dexterity

source: Approaches for Developers:
es: Enfoques para Desarrolladores:

source: Schema in Dexterity: TTW, XML, Python. Interface = schema, often no class needed.
es: Esquema en Dexterity: A través de la Web, XML, Python. Interface = esquema, a menudo no hay clase necesaria.

source: Schema in Archetypes: Schema only in Python.
es: Esquema en Archetypes: Esquemas solamente en Python.

source: Dexterity: Easy permissions per field, easy custom forms.
es: Dexterity: Permisos fácil por cada campo. fácil personalización de formularios.

source: Archetypes: Permissions per field are hard, custom forms even harder.
es: Archetypes: Los permisos por campo son duros, los formularios personalizados aún más difícil.

source: If you have to program for old sites you need to know Archetypes!
es: Si tiene que programar para los sitios antiguos ¡usted necesita saber Archetypes!

source: If starting fresh, go with Dexterity.
es: Si empieza desde cero en nuevo sitios, use Dexterity.

source: Extending:
es: Extendiendo:

source: Dexterity has *Behaviors*: easily extendable. Just activate a behavior TTW and your content type is e.g. translatable (:py:mod:`plone.app.multilingual`).
es: La destreza tiene *Comportamientos*: fácilmente extensible. Solo tienes que activar un TTW de comportamiento y tu tipo de contenido será, por ejemplo, traducible (:py:mod:`plone.app.multilingual`).

source: Archetypes has :py:mod:`archetypes.schemaextender`. Powerful but not as flexible.
es: Archetypes tiene el producto :py:mod:`archetypes.schemaextender`. Potente pero no tan flexible.

source: We have only used Dexterity for the last few years. We teach Dexterity and not Archetypes because it's more accessible to beginners, has a great TTW story and is the future.
es: Sólo hemos utilizado Dexterity en los últimos años. Enseñamos Dexterity y no Archetypes porque es más accesible a los principiantes, tiene una gran historia a través de la Web y es el futuro.

source: Views:
es: Vistas:

source: Both Dexterity and Archetypes have a default view for content types.
es: Tanto Dexterity y Archetypes tienen una vista por defecto de tipos de contenido.

source: Browser Views provide custom views.
es: Browser Views proveen vistas personalizadas.

source: You can generate views for content types in the browser without programming (using the :py:mod:`plone.app.mosaic` Add-on).
es: Puede generar vistas para tipos de contenido en el navegador sin programación (usando el complemento :py:mod:`plone.app.mosaic`).

source: Display Forms.
es: Mostrar Formularios.

source: Modifying Existing Types
es: Modificando tipos de contenidos existentes

source: Go to the control panel http://localhost:8080/Plone/@@dexterity-types
es: Ir a panel de control http://localhost:8080/Plone/@@dexterity-types

source: Inspect some of the existing default types.
es: Inspecciona algunos de los tipos de contenido existentes.

source: Select the type :guilabel:`News Item` and add a new field ``Hot News`` of type :guilabel:`Yes/No`
es: Seleccione el tipo de contenidos ``Noticias`` y añadir un nuevo campo ``Hot News`` de tipo :guilabel:`Sí/No`

source: In another tab, add a *News Item* and you'll see the new field.
es: En otra pestaña añadir un tipo de contenido Noticia y entonces se ve el nuevo campo.

source: Go back to the schema-editor and click on :guilabel:`Edit XML Field Model`.
es: Valla al editor de esquema y haga clic en :guilabel:`Editar el modelo de campo XML`.

source: Note that the only field in the XML schema of the News Item is the one we just added. All others are provided by behaviors.
es: Note que el único campo en el esquema XML de la Noticia es el que acaba de añadir. Todos los demás son proporcionados por los comportamientos.

source: Edit the form-widget-type so it says:
es: Editar el de tipo widget del formulario por lo que dice:

source: Edit the News Item again. The widget changed from a radio field to a check box.
es: Edite de nuevo el elemento de Noticia. El widget de cambiado de un campo de radio a una casilla de verificación.

source: The new field ``Hot News`` is not displayed when rendering the News Item. We'll take care of this later.
es: El nuevo campo ``Hot News`` no se visualiza cuando se representa la Noticia. Nosotros nos ocuparemos de esto más adelante.

source: Creating Content Types "Through-The-Web"
es: Creando tipos de contenidos a través de la Web

source: In this step we will create a content type called *Talk* and try it out. When it's ready, we will move the code from the web to the file system and into our own add-on. Later we will extend that type, add behaviors and a viewlet for Talks.
es: En este paso vamos a crear un tipo de contenido llamado *Talk* (para las charlas) y probarlo. Cuando esté listo, vamos a mover el código fuente de la Web para el sistema de archivos y en nuestro propio complemento. Más tarde vamos a ampliar ese tipo, los comportamientos y añadir un viewlet de las Charlas.

source: Add new content type "Talk" and some fields for it:
es: Añadir un nuevo tipo de contenido llamado "Talk" y algunos campos para el:

source: :guilabel:`Add new field` "Type of talk", type :guilabel:`Choice`. Go to :menuselection:`Settings` and add options: talk, keynote, training.
es: :guilabel:`Añada nuevo campo` "Type of talk", de tipo :guilabel:`Selección`. Valla a :menuselection:`Settings` y añadir las opciones: talk, keynote, training.

source: :guilabel:`Add new field` "Details", type :guilabel:`Rich Text` with a maximal length of 2000.
es: :guilabel:`Añada nuevo campo` "Details", de tipo :guilabel:`Rich Text` con un tamaño máximo de 2000.

source: :guilabel:`Add new field` "Audience", type :guilabel:`Multiple Choice`. Add options: beginner, advanced, pro.
es: :guilabel:`Añada nuevo campo` "Audience", de tipo :guilabel:`Selección múltiple`. Añadir las opciones: beginner, advanced, pro.

source: Check the behaviors that are enabled: *Dublin Core metadata*, *Name from title*. Do we need them all?
es: Marque los comportamientos que están habilitados: *Metadatos Dublin Core*, *Nombre a partir del título*. ¿Tenemos todos necesitamos?

source: Test the content type.
es: Pruebe el tipo de contenido.

source: Return to the control panel http://localhost:8080/Plone/@@dexterity-types
es: Regrese al panel de control http://localhost:8080/Plone/@@dexterity-types

source: Extend the new type: add the following fields:
es: Extienda el nuevo tipo: añada los siguientes campos:

source: "Speaker", type: :guilabel:`Text line`
es: "Speaker", tipo: :guilabel:`Línea de texto (cadena de caracteres)`

source: "Email", type: :guilabel:`Email`
es: "Email", tipo: :guilabel:`Email (correo electrónico)`

source: "Image", type: :guilabel:`Image`, not required
es: "Image", tipo: :guilabel:`Image`, no requerido

source: "Speaker Biography", type: :guilabel:`Rich Text`
es: "Speaker Biography", tipo: :guilabel:`Rich Text`

source: Test again.
es: Probar otra vez.

source: Here is the complete XML schema created by our actions:
es: Aquí está el código completo de esquema XML creado por nuestras acciones:

source: Moving Content Types Into Code
es: Moviendo el tipo de contenido dentro del código fuente

source: It's awesome that we can do so much through the web. But it's also a dead end if we want to reuse this content type in other sites.
es: Es impresionante que podemos hacer tanto a través de la Web. Pero también es un callejón sin salida si queremos volver a utilizar este tipo de contenido en otros sitios.

source: Also, for professional development, we want to be able to use version control for our work, and we'll want to be able to add the kind of business logic that will require programming.
es: También, para el desarrollo profesional, queremos ser capaces de utilizar el control de versiones para nuestro trabajo, y vamos a querer ser capaz de añadir la clase de lógica de negocio que requerirá de programación.

source: So, we'll ultimately want to move our new content type into a Python package. We're missing some skills to do that, and we'll cover those in the next couple of chapters.
es: Por lo tanto, vamos a última instancia querer mover nuestro nuevo tipo de contenido en un paquete Python. Nos faltan algunas habilidades para hacer eso, y vamos a cubrir aquellos en los próximos dos capítulos.

source: `Dexterity Developer Manual <https://docs.plone.org/external/plone.app.dexterity/docs/index.html>`_
es: `Manual del desarrollador Dexterity <https://docs.plone.org/external/plone.app.dexterity/docs/index.html>`_

source: `The standard behaviors <https://docs.plone.org/external/plone.app.dexterity/docs/reference/standard-behaviours.html>`_
es: `Los comportamientos estándar <https://docs.plone.org/external/plone.app.dexterity/docs/reference/standard-behaviours.html>`_

source: Exercises
es: Ejercicios

source: Exercise 1
es: Ejercicio 1

source: Modify Pages to allow uploading an image as decoration (like *News Items* do).
es: Modificar el tipo de contenido Páginas para permitir subir una imagen como decoración (así como las *Noticias* lo hacen).

source: Solution
es: Solución

source: Go to the dexterity control panel (http://localhost:8080/Plone/@@dexterity-types)
es: Valla al panel de control Tipos de contenido Dexterity (http://localhost:8080/Plone/@@dexterity-types)

source: Click on *Page* (http://127.0.0.1:8080/Plone/dexterity-types/Document)
es: Haga clic en *Página* (http://127.0.0.1:8080/Plone/dexterity-types/Document)

source: Select the tab *Behaviors* (http://127.0.0.1:8080/Plone/dexterity-types/Document/@@behaviors)
es: Seleccione la pestaña *Comportamientos* (http://127.0.0.1:8080/Plone/dexterity-types/Document/@@behaviors)

source: Check the box next to :guilabel:`Lead Image` and save.
es: Marque la casilla junto a :guilabel:`Imagen Lead` y guardar.

source: The images are displayed above the title.
es: Las imágenes se muestran por encima del título.

source: Exercise 2
es: Ejercicio 2

source: Create a new content type called *Speaker* and export the schema to a XML File. It should contain the following fields:
es: Crear un nuevo tipo de contenido llamada *Speaker* y exportar el esquema a un archivo XML. Debe contener los siguientes campos:

source: Title, type: :guilabel:`Text Line`
es: Título, escriba: :guilabel:`Línea de texto`

source: Email, type: :guilabel:`Email`
es: Correo electrónico, escriba: :guilabel:`Correo electrónico`

source: Homepage, type: :guilabel:`URL` (optional)
es: Página de inicio, escriba: :guilabel:`URL` (opcional)

source: Biography, type: :guilabel:`Rich Text` (optional)
es: Biografía, escriba: :guilabel:`Texto enriquecido` (opcional)

source: Company, type: :guilabel:`Text Line` (optional)
es: Empresa, escriba: :guilabel:`Línea de texto` (opcional)

source: Twitter Handle, type: :guilabel:`Text Line` (optional)
es: Identificador de Twitter, escriba: :guilabel:`Línea de texto` (opcional)

source: IRC Handle, type: :guilabel:`Text Line` (optional)
es: Identificador de IRC, tipo: :guilabel:`Línea de texto` (opcional)

source: Image, type: :guilabel:`Image` (optional)
es: Imagen, escriba: :guilabel:`Imagen` (opcional)

source: Do not use the :term:`Dublin Core` or the Basic behavior since a speaker should not have a description (unselect it in the Behaviors tab).
es: No utilice el :term:`Dublin Core` o el comportamiento básico, ya que un hablante no debe tener una descripción (deselecciónelo en la pestaña Comportamientos).

source: We could use this content type later to convert speakers into Plone users. We could then link them to their talks.
es: Podríamos utilizar este tipo de contenido después de convertir los ponentes en los usuarios de Plone. Podríamos luego enlazar a sus charlas.

source: The schema should look like this:
es: El esquema debería lucir así:

source: `Model-driven types <https://docs.plone.org/external/plone.app.dexterity/docs/model-driven-types.html#model-driven-types>`_
es: `Tipos basados en modelos <https://docs.plone.org/external/plone.app.dexterity/docs/model-driven-types.html#model-driven-types>`_

source: "Through-The-Web" Plone Customization
es: Personalización de Plone "a través de la Web"

source: This chapter is still work in progress!
es: ¡Este capítulo todavía está en progreso!

source: Customize Plone Through-The-Web
es: Personaliza Plone a través de la web

source: Level
es: Nivel

source: Experienced
es: Experimentado

source: Status
es: Estatus

source: Work in progress
es: Trabajo en Progreso

source: In this section we will:
es: En esta sección nosotros haremos:

source: create a *home page* layout,
es: crear un diseño de *página de inicio*,

source: create a *specific talk detail* layout.
es: crea un diseño de *Detalle de conversación específico*.

source: Create custom layouts.
es: Crea diseños personalizados.

source: Manage layouts.
es: Administrar diseños.

source: Use the layout editor.
es: Utilice el editor de diseño.

source: What is Mosaic?
es: ¿Qué es Mosaic?

source: A Plone add-on,
es: Un complemento de Plone,

source: which allows managing layouts from the Plone interface.
es: que permite gestionar los diseños desde la interfaz de Plone.

source: Some Comparisons
es: Algunas comparaciones

source: It allows to manage the *layout*, not the *design* (unlike Diazo).
es: Permite gestionar el *layout*, no el *diseño* (a diferencia de Diazo).

source: It can manage the layout of *any* page, it does not provide a specific layout-enabled content type (like :py:mod:`collective.cover`).
es: Puede administrar el diseño de *cualquier* página, no proporciona un tipo de contenido específico habilitado para el diseño (como :py:mod:`collective.cover`).

source: Compared to Diazo:
es: En comparación con Diazo:

source: Diazo enables theming our Plone site by providing CSS, images, and HTML templates. It will apply to the entire page (footer, main content, portlets, etc.).
es: Diazo permite la tematización de nuestro sitio Plone al proporcionar CSS, imágenes y plantillas HTML. Se aplicará a toda la página (pie de página, contenido principal, portlets, etc.).

source: Mosaic uses the grid provided by our design to dynamically build specific content layouts.
es: Mosaic utiliza la cuadrícula proporcionada por nuestro diseño para crear dinámicamente diseños de contenido específicos.

source: Compared to :py:mod:`collective.cover`:
es: En comparación con :py:mod:`collective.cover`:

source: :py:mod:`collective.cover` provides a specific content-type (a "Cover page") where we can manage the layout in order to build our home page.
es: :py:mod:`collective.cover` proporciona un tipo de contenido específico (una "Portada") donde podemos administrar el diseño para construir nuestra página de inicio.

source: Mosaic does not provide any content-type, it allows to edit any existing content layout.
es: Mosaic no proporciona ningún tipo de contenido, permite editar cualquier diseño de contenido existente.

source: Installation
es: Instalación

source: If you already have your own Plone installation you can install Mosaic by customizing it as follows:
es: Si ya tienes tu propia instalación de Plone, puedes instalar Mosaic personalizándola de la siguiente manera:

source: Modify :file:`buildout.cfg` to add Mosaic as a dependency
es: Modifique :file:`buildout.cfg` para añadir Mosaic como dependencia

source: Run your buildout
es: Ejecute su buildout

source: Then go to :menuselection:`Site Setup --> Add-ons` and Mosaic :guilabel:`Install`.
es: A continuación, vaya a :menuselection:`Configuración del sitio --> Complementos` y Mosaic :guilabel:`Instalar`.

source: We will use a `Plone pre-configured Heroku instance <https://github.com/collective/training-sandbox>`_.
es: Usaremos una `instancia de Heroku preconfigurada de Plone <https://github.com/collective/training-sandbox>`_.

source: Once deployed, create a Plone site, then go to the :menuselection:`Site Setup --> Add-ons` and Mosaic :guilabel:`Install`.
es: Una vez implementado, cree un sitio Plone, luego vaya a :menuselection:`Configuración del sitio --> Complementos` y Mosaic :guilabel:`Instalar`.

source: Principle
es: Principio

source: The basic component of a Mosaic based layout is called a tile. A layout is a combination of several tiles.
es: El componente básico de un diseño basado en mosaico se denomina mosaico. Un diseño es una combinación de varios mosaicos.

source: A tile is a dynamic portion of a web page, it can be a text element, an image, a field, etc.
es: Un mosaico es una parte dinámica de una página web, puede ser un elemento de texto, una imagen, un campo, etc.

source: Mosaic provides an editor able to position tiles across our theme's grid.
es: Mosaic proporciona un editor capaz de posicionar mosaicos a lo largo de la cuadrícula de nuestro tema.
