Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/ttw.po
Languages: es

source: Example (assuming ``author``, ``title`` and ``price`` are existing indexes):
es: Ejemplo (asumiendo que ``author``, ``title`` y ``price`` son índices existentes):

source: To reindex a record, we can use the Rapido Python API:
es: Para reindexar un registro, podemos usar la API de Rapido Python:

source: We can also reindex all the records using the ``refresh`` URL command::
es: También podemos reindexar todos los registros usando el comando URL ``refresh``:

source: Exercise 6: Compute The Top 5
es: Ejercicio 6: Calcular los 5 primeros

source: We want to be able to sort the records according to their votes:
es: Queremos poder ordenar los registros según sus votos:

source: we need to declare ``total`` as an indexed element,
es: necesitamos declarar ``total`` como un elemento indexado,

source: we need to refresh all our stored records,
es: necesitamos actualizar todos nuestros registros almacenados,

source: we need to update the ``top5`` block to display the first 5 ranked talks.
es: necesitamos actualizar el bloque ``top5`` para mostrar las primeras 5 charlas clasificatorias.

source: We add the following to :file:`rate.yaml` containing:
es: Añadimos lo siguiente al archivo :file:`rate.yaml` que contiene:

source: To index the previously stored values, we have to refresh the storage index by calling the following URL::
es: Para indexar los valores almacenados anteriormente, tenemos que refrescar el índice de almacenamiento llamando a la siguiente URL:

source: And to make sure future changes will be indexed, we need to fix the :py:func:`like` function in the ``rate`` block: the indexing is triggered when we call the record's :py:meth:`save` method:
es: Y para asegurarnos de que los cambios futuros se indexarán, necesitamos corregir la función :py:func:`like` en el bloque ``rate``: la indexación se activa cuando llamamos al método :py:meth:`save` del registro:

source: Now let's change the ``top5`` block:
es: Ahora cambiemos el bloque ``top5``:

source: create :file:`top5.yaml`:
es: crear el archivo :file:`top5.yaml`:

source: create :file:`top5.py`:
es: crear el archivo :file:`top5.py`:

source: update :file:`top5.pt`:
es: actualizar el archivo :file:`top5.pt`:

source: Create Custom Content-rules
es: Crear reglas de contenido personalizadas

source: Plone content rules allow triggering a given action depending on an *event* (content modified, content created, etc.) and on a *list of criteria* (for example: only for certain content types, only in this folder, etc.).
es: Las reglas de contenido de Plone permiten desencadenar una acción determinada en función de un *evento* (contenido modificado, contenido creado, etc.) y de una *lista de criterios* (por ejemplo: solo para ciertos tipos de contenido, solo en esta carpeta, etc.).

source: Plone provides a set of useful ready-to-use content rule actions, such as moving some content somewhere, sending mail to an email address, executing a workflow change, etc.
es: Plone proporciona un conjunto de acciones de reglas de contenido útiles y listas para usar, como mover contenido a algún lugar, enviar correo a una dirección de correo electrónico, ejecutar un cambio en el flujo de trabajo, etc.

source: Rapido allows us to easily implement our own actions. To do this, it adds a generic "Rapido action" to the Plone content rules system. It allows us to enter the following parameters:
es: Rapido nos permite implementar fácilmente nuestras propias acciones. Para ello, añade una "acción Rapido" genérica al sistema de reglas de contenido de Plone. Nos permite introducir los siguientes parámetros:

source: The app id,
es: El ID de la aplicación,

source: The block id,
es: El ID de bloque,

source: The function name.
es: El nombre de la función.

source: The :py:attr:`content` property in the function's :py:obj:`context` allows access to the content targeted by the content rule.
es: La propiedad :p y:attr:'content' en el :py:obj:`context` de la función permite el acceso al contenido al que se dirige la regla de contenido.

source: For instance, to transform the content title to uppercase every time we edit something, we would use a function such as this:
es: Por ejemplo, para transformar el título del contenido a mayúsculas cada vez que editamos algo, usaríamos una función como esta:

source: Exercise 7: Reset The Votes On Workflow change
es: Ejercicio 7: Restablecer el cambio de flujo de trabajo de las votaciones

source: We would like to reset the votes when we change the workflow status of a talk.
es: Nos gustaría restablecer los votos cuando cambiamos el estado del flujo de trabajo de una charla.

source: We will need to:
es: Necesitaremos:

source: create a new block to handle our :py:func:`reset` function,
es: crear un nuevo bloque para manejar nuestra función :py:func:`reset`,

source: add a content rule to our Plone site,
es: añadir una regla de contenido a nuestro sitio de Plone,

source: assign the rule to the proper location.
es: asigne la regla a la ubicación adecuada.

source: create :file:`contentrule.py`:
es: crear el archivo :file:`contentrule.py`:

source: go to :menuselection:`Site setup --> Content rules`, and add a rule for the event :guilabel:`Workflow state changed`,
es: vaya a :menuselection:`Configuración del sitio --> Reglas de contenido`, y añada una regla para el evento :guilabel:`Estado del flujo de trabajo cambiado`,

source: add a condition on the content type to only target *Talks*,
es: añadir una condición en el tipo de contenido para orientar solo *Talks*,

source: add a Rapido action where the application is ``rating``, the block is ``contentrule`` and the method is ``reset``,
es: añada una acción de Rapido donde la aplicación es ``rating``, el bloque es ``contentrule`` y el método es ``reset``,

source: activate the rule for the whole site.
es: active la regla para todo el sitio.

source: Other Topics
es: Otros temas

source: The following Rapido features haven't been covered by this training:
es: Las siguientes características de Rapido no se han cubierto en esta capacitación:

source: using Rapido blocks as tiles in Mosaic,
es: usando bloques Rapido como mosaicos en Mosaic,

source: using blocks as forms to create, display and edit records directly,
es: usar bloques como formularios para crear, mostrar y editar registros directamente,

source: access control,
es: control de acceso,

source: Rapido JSON REST API.
es: API REST JSON Rapido.

source: You can find information about those features and also interesting use cases in the `Rapido documentation <http://rapidoplone.readthedocs.io/en/latest/>`_.
es: Puede encontrar información sobre estas características y también casos de uso interesantes en la `documentación Rapido <http://rapidoplone.readthedocs.io/en/latest/>`_.

source: Introduction To Diazo Theming
es: Introducción a la tematización diazo

source: Use the :guilabel:`Theming` control panel to make a copy of Plone's default theme (barceloneta)
es: Utilice el panel de control :guilabel:`Temas` para hacer una copia del tema por defecto de Plone (barceloneta)

source: Customize a theme using Diazo rules
es: Personalizar un tema usando las reglas de Diazo

source: Customize a theme by editing and compiling Less files
es: Personaliza un tema editando y compilando archivos Less

source: Diazo and :py:mod:`plone.app.theming`
es: Diazo y :py:mod:`plone.app.theming`

source: "Barceloneta" - The Default Plone Theme
es: "Barceloneta" - El tema por defecto de Plone

source: The "Theming tool"
es: La "herramienta de Tematización"

source: Building CSS in the "Theming tool"
es: Construyendo CSS en la "herramienta de Tematización"

source: ``<body>`` element CSS classes
es: Clases CSS de elemento ``<body>``

source: Conditionally activating rules
es: Reglas de activación condicional

source: Once deployed, create a Plone site.
es: Una vez implementado, cree un sitio Plone.

source: Two Approaches To Theming
es: Dos enfoques para la tematización

source: There are two main approaches to creating a custom theme:
es: Hay dos enfoques principales para crear un tema personalizado:

source: Copying the default Barceloneta theme
es: Copiar el tema por defecto de Barceloneta

source: Inheriting from the default Barceloneta theme.
es: Heredando del tema por defecto de Barceloneta.

source: In this section we'll look at the first approach, part II will explore the second approach.
es: En esta sección veremos el primer enfoque, la parte II explorará el segundo enfoque.

source: What Is Diazo?
es: ¿Qué es Diazo?

source: :program:`Diazo` is a theming engine used by Plone to make theming a site easier. At its core, a Diazo theme consists of an HTML page and :file:`rules.xml` file containing directives.
es: :program:`Diazo` es un motor de tematización utilizado por Plone para facilitar la tematización de un sitio. En esencia, un tema Diazo consiste en una página HTML y un archivo :file:'rules.xml' que contiene directivas.

source: You can find extended information about Diazo and its integration package :py:mod:`plone.app.theming` in the official docs: `Diazo docs <http://docs.diazo.org/en/latest/>`_ and `plone.app.theming docs <https://docs.plone.org/external/plone.app.theming/docs/index.html#what-is-a-diazo-theme>`_.
es: Puede encontrar información ampliada sobre Diazo y su paquete de integración :py:mod:`plone.app.theming` en la documentación oficiales: `documentación Diazo <http://docs.diazo.org/en/latest/>`_ y la `documentación plone.app.theming <https://docs.plone.org/external/plone.app.theming/docs/index.html#what-is-a-diazo-theme>`_.

source: For this part of the training you need to know the basic principles of a Diazo theme:
es: Para esta parte de la formación es necesario conocer los principios básicos de un tema Diazo:

source: Plone renders the content of the page;
es: Plone representa el contenido de la página;

source: Diazo rules inject the content into any static theme.
es: Las reglas de Diazo inyectan el contenido en cualquier tema estático.

source: Copy Barceloneta Theme
es: Copiar tema de Barceloneta

source: To create our playground we will copy the existing Barceloneta theme.
es: Para crear nuestro parque infantil copiaremos el tema de Barceloneta existente.

source: Go to the :guilabel:`Theming` control panel
es: Vaya al panel de control :guilabel:`Temas`

source: You will see the available themes. In a bare new Plone site, you will see something like this:
es: Verás los temas disponibles. En un nuevo sitio de Plone, verá algo como esto:

source: Click on the :guilabel:`Copy` button and get to the copy form
es: Haga clic en el botón :guilabel:`Copiar` y acceda al formulario de copia

source: Insert "My theme" as the name and activate it by default
es: Inserte "Mi tema" como nombre y actívelo de forma predeterminada

source: Click on :guilabel:`Create` and you get redirected to your new theme's inspector:
es: Haga clic en :guilabel:`Crear` y será redirigido al inspector de su nuevo tema:

source: Anatomy Of A Diazo Theme
es: Anatomía De Un Tema Diazo

source: The most important files:
es: Los archivos más importantes:

source: :file:`manifest.cfg`: contains metadata about the theme (`manifest reference <https://docs.plone.org/external/plone.app.theming/docs/index.html#the-manifest-file>`_);
es: archivo :file:`manifest.cfg`: contiene metadatos sobre el tema (`referencia de manifest <https://docs.plone.org/external/plone.app.theming/docs/index.html#the-manifest-file>`_);

source: :file:`rules.xml`: contains the theme rules (`rules reference <https://docs.plone.org/external/plone.app.theming/docs/index.html#rules-syntax>`_);
es: archivo :file:`rules.xml`: contiene las reglas del tema (`referencia de rules <https://docs.plone.org/external/plone.app.theming/docs/index.html#rules-syntax>`_);

source: :file:`index.html`: the static HTML of the theme.
es: archivo :file:`index.html`: el HTML estático del tema.

source: Exercise 1 - Inspecting the :file:`manifest.cfg`
es: Ejercicio 1 - Inspeccionando el :file:`manifest.cfg`

source: To better understand how your theme is arranged, start by reading the :file:`manifest.cfg` file.
es: Para entender mejor cómo está organizado tu tema, empieza por leer el archivo :file:`manifest.cfg`.

source: In the theming tool, open :file:`manifest.cfg` spend a minute or two looking through it, then see if you can answer the questions below.
es: En la herramienta de creación de temas, abra :file:`manifest.cfg` y dedique uno o dos minutos a revisarlo, luego vea si puede responder a las preguntas a continuación.

source: Where are the main rules located for your theme?
es: ¿Dónde se encuentran las reglas principales para tu tema?

source: What property in the :file:`manifest.cfg` file defines the source CSS/Less file used by the theme?
es: ¿Qué propiedad en el archivo :file:`manifest.cfg` define el archivo fuente CSS/Less utilizado por el tema?

source: What do you think is the purpose of the ``prefix`` property?
es: ¿Cuál crees que es el propósito de la propiedad ``prefix``?

source: The main rules are defined by the ``rules`` property (you could point this anywhere, however the accepted convention is to use a file named :file:`rules.xml`.
es: Las reglas principales están definidas por la propiedad ``rules`` (podría apuntar esto en cualquier lugar, sin embargo, la convención aceptada es usar un archivo llamado :file:`rules.xml`.

source: The ``development-css`` property points at the main Less file, when compiled to CSS it is placed in the location defined by the ``production-css`` property.
es: La propiedad ``development-css`` apunta al archivo Less principal, cuando se compila a CSS se coloca en la ubicación definida por la propiedad ``production-css``.

source: The ``prefix`` property defines the default location to look for non-prefixed files, for example if your prefix is set to ``/++theme++mytheme`` then a file like :file:`index.html` will be expected at ``/++theme++mytheme/index.html``
es: La propiedad ``prefix`` define la ubicación por defecto para buscar archivos sin prefijo, por ejemplo, si su prefijo está establecido en ``/++theme++mitema``, entonces se esperará un archivo como :archivo:`index.html` en ``/++theme++mitema/index.html``

source: ``<body>`` CSS Classes
es: Clases CSS ``<body>``

source: As you browse a Plone site, Plone adds rich information about your current context. This information is represented as special classes in the ``<body>`` element. Information represented by the ``<body>`` classes includes:
es: A medida que navega por un sitio de Plone, Plone añada información valiosa sobre su contexto actual. Esta información se representa como clases especiales en el elemento ``<body>``. La información representada por las clases ``<body>`` incluye:

source: the current user role, and permissions,
es: el rol de usuario actual y los permisos,

source: the current content-type and its template,
es: el tipo de contenido actual y su plantilla,

source: the site section and sub section,
es: la sección y la subsección del sitio,

source: the current subsite (if any),
es: el subsitio actual (si lo hay),

source: whether this is a frontend view,
es: ya sea que se trate de una vista frontend,

source: whether icons are enabled.
es: si los iconos están habilitados.

source: ``<body>`` Classes For An Anonymous Visitor
es: Clases ``<body>`` para un visitante Anónimo

source: Below you can see an example of the body classes for a page named "front-page", located in the root of a typical Plone site called "acme":
es: A continuación puede ver un ejemplo de las clases de cuerpo para una página llamada "front-page", ubicada en la raíz de un sitio típico de Plone llamado "acme":

source: ``<body>`` Classes For A Manager
es: Clases ``<body>`` para un Administrador

source: And here is what the classes for the same page look like when viewed by a manager that has logged in:
es: Y así es como se ven las clases para la misma página cuando las ve un administrador que ha iniciado sesión:

source: Notice the addition of ``userrole-manager``.
es: Observe la adición de ``userrole-manager``.

source: Exercise 2 - Discussion about the ``<body>`` classes
es: Ejercicio 2 - Discusión sobre las clases ``<body>``

source: Look back at the ``<body>`` classes for a manager, then see if you can answer the following questions.
es: Mira hacia atrás a las clases ``<body>`` para un Administrador, luego vea si puede responder las siguientes preguntas.

source: What other roles does the manager have?
es: ¿Qué otras funciones tiene el Administrador?

source: Can you see other differences?
es: ¿Puedes ver otras diferencias?

source: What do you think the ``plone-toolbar-expanded`` class does?
es: ¿Qué crees que hace la clase ``plone-toolbar-expanded``?

source: The manager also has the role "member" and "authenticated"
es: El administrador también tiene el rol de "member" y "authenticated"

source: There are ``plone-toolbar`` classes added to the ``<body>`` element, these control the display of the toolbar
es: Hay clases ``plone-toolbar`` añadidas a la clase ``<body>``, estos controlan la visualización de la barra de herramientas

source: The ``plone-toolbar-expanded`` class is used to control styles used by the expanded version of the toolbar.
es: La clase ``plone-toolbar-expanded`` se utiliza para controlar los estilos utilizados por la versión expandida de la barra de herramientas.

source: Custom Rules
es: Reglas personalizadas

source: Let's open :file:`rules.xml`. You will see all the rules that are used in the Barceloneta theme right now. For the time being let's concentrate on how to hack these rules.
es: Abramos el archivo :file:`rules.xml`. Verás todas las reglas que se utilizan en el tema de Barceloneta en este momento. Por el momento, concentrémonos en cómo hackear estas reglas.

source: Conditionally Showing Content
es: Mostrar contenido de forma condicional

source: Suppose that we want to make the "above content" block (the one that contains breadcrumbs) conditional, and show it only for authenticated users.
es: Supongamos que queremos hacer que el bloque "contenido anterior" (el que contiene migas de pan) sea condicional y mostrarlo solo para usuarios autenticados.

source: In the :file:`rules.xml` find this line:
es: En el archivo :file:`rules.xml` encuentra esta línea:

source: This rule states that the element that comes from the content (Plone) with the id ``#viewlet-above-content`` must replace the element with the id ``#above-content`` in the static theme.
es: Esta regla establece que el elemento que proviene del contenido (Plone) con el id ''#viewlet-above-content'' debe reemplazar el elemento con el id ''#above-content'' en el tema estático.

source: We want to hide it for anonymous users (hint: We'll use the ``<body>`` classses discussed above).
es: Queremos ocultarlo para los usuarios anónimos (sugerencia: Usaremos las clases ``<body>`` discutidas anteriormente).

source: The class we are looking for is ``userrole-authenticated``. Add another property to the rule so that we produce this code:
es: La clase que estamos buscando es ``userrole-authenticated``. Añada otra propiedad a la regla para que generemos este código:

source: The attribute ``css:if-content`` allows us to put a condition on the rules based on a CSS selector that acts on the content. In this way the rule will be applied only if the body element has the class ``.userrole-authenticated``.
es: El atributo ``css:if-content`` nos permite poner una condición a las reglas en base a un selector CSS que actúa sobre el contenido. De esta manera, la regla se aplicará solo si el elemento body tiene la clase ``.userrole-authenticated``.

source: We will learn more about Diazo rules in :doc:`ttw-advanced-2`.
es: Aprenderemos más sobre las reglas de Diazo en :doc:`ttw-advanced-2`.

source: Customize CSS
es: Personalizar el CSS

source: From theming tool open the file :file:`less/barceloneta.plone.less`, that is the main Less file as specified in the manifest;
es: Desde la herramienta de tematización abra el archivo :file:`less/barceloneta.plone.less`, que es el archivo principal de Less según lo especificado en el manifiesto;

source: Add your own customization at the bottom, like:
es: Añada su propia personalización en la parte inferior, como:

source: Normally you would place this in a separate file to keep the main one clean but for this example it is enough.
es: Normalmente, colocaría esto en un archivo separado para mantener limpio el principal, pero para este ejemplo es suficiente.

source: Push the buttons :guilabel:`Save` and :guilabel:`Build CSS`
es: Presione los botones :guilabel:`Guardar` y :guilabel:`Construir CSS`

source: Go back to the Plone site and reload the page: voilá!
es: Vuelve al sitio de Plone y vuelve a cargar la página: ¡voilá!

source: At the moment you need to "Build CSS" from the main file, the one declared in the manifest (in this case :file:`less/barceloneta.plone.less`).
es: En este momento necesitas "Construir CSS" desde el archivo principal, el que se declara en el manifiesto (en este caso el archivo :file:`less/barceloneta.plone.less`).

source: Whatever Less file you edit, go back to the main one to compile. This behavior will be improved but for now, just remember this simple rule ;)
es: Sea cual sea el archivo Less que edites, vuelve al principal para compilarlo. Este comportamiento mejorará, pero por ahora, solo recuerde esta simple regla ;)

source: TTW Theming II: Create A Custom Theme Based On Barceloneta
es: TTW Theming II: Crea un tema personalizado basado en la Barceloneta

source: Create a new theme by inheriting from the :term:`Barceloneta` theme.
es: Crea un nuevo tema heredando del tema :term:`Barceloneta`.

source: Use the :file:`manifest.cfg` to register a production CSS file.
es: Utilice el archivo :file:`manifest.cfg` para registrar un archivo CSS de producción.

source: Use an ``XInclude`` to incorporate rules from the :term:`Barceloneta` theme.
es: Utilice un ``XInclude`` para incorporar reglas del tema :term:`Barceloneta`.

source: Use ``?diazo.off=1`` to view unthemed versions.
es: Use ``?diazo.off=1`` para ver versiones sin tema.

source: Use conditional rules to have a different backend theme from the anonymous visitors theme.
es: Utilice reglas condicionales para tener un tema de backend diferente del tema de visitantes anónimos.

source: Inheriting from Barceloneta theme.
es: Heredero del tema de Barceloneta.

source: Diazo rule directives and attributes.
es: Directivas y atributos de la regla Diazo.

source: Viewing the unthemed version of a Plone item.
es: Visualización de la versión sin tema de un elemento de Plone.

source: Creating a visitor-only theme.
es: Creación de un tema solo para visitantes.

source: Inheriting From Barceloneta
es: Heredar del tema Barceloneta

source: When inheriting from the Barceloneta theme keep the following in mind:
es: Al heredar del tema de Barceloneta, tenga en cuenta lo siguiente:

source: The theme provides styles and assets used by Plone's backend tools.
es: El tema proporciona estilos y activos utilizados por las herramientas de backend de Plone.

source: Inheritance involves including the Barceloneta :file:`rules.xml` (``++theme++barceloneta/rules.xml``) and styles.
es: La herencia implica incluir el tema Barceloneta en el archivo :file:`rules.xml` (``++theme++barceloneta/rules.xml``) y los estilos.

source: The prefix/unique path to the Barceloneta theme is ``++theme++barceloneta``.
es: El prefijo/ruta única al tema de Barceloneta es ``++theme++Barceloneta``.

source: It is necessary to include a copy of Barceloneta's :file:`index.html` in the root of your custom theme.
es: Es necesario incluir una copia del archivo :file:`index.html` del tema Barceloneta en la raíz de tu tema personalizado.
