Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/ttw.po
Languages: es

source: an HTML (or :file:`.pt`) file for the layout,
es: un archivo HTML (o :file:`.pt`) para el diseño,

source: a Python file to implement the logic.
es: un archivo de Python para implementar la lógica.

source: The app components are :dfn:`blocks`. A block is defined by a set of 3 files (HTML, Python, and YAML) located in the :file:`blocks` folder.
es: Los componentes de la aplicación son :dfn:`blocks`. Un bloque está definido por un conjunto de 3 archivos (HTML, Python y YAML) ubicados en la carpeta :file:`blocks`.

source: The **YAML file** defines the *elements*. An :dfn:`element` is any dynamically generated element in a block. It can be a form field (input, select, etc.), or a button (an ``ACTION`` element), or even a piece of generated HTML (a ``BASIC`` element).
es: El **archivo YAML** define los *elementos*. Un :dfn:`element` es cualquier elemento generado dinámicamente en un bloque. Puede ser un campo de formulario (entrada, selección, etc.), o un botón (un elemento ``ACTION``), o incluso un fragmento de HTML generado (un elemento ``BASIC``).

source: The **HTML file** contains the layout of the block. The templating mechanism is super simple: elements are enclosed in curly brackets, like this: ``{my_element}``.
es: El **archivo HTML** contiene el diseño del bloque. El mecanismo de plantillas es súper simple: los elementos están encerrados entre llaves, así: ``{my_element}``.

source: The **Python file** contains the application logic. We will see later how we use those Python files.
es: El **archivo de Python** contiene la lógica de la aplicación. Más adelante veremos cómo usamos esos archivos de Python.

source: Exercise 1: Create The Vote Block
es: Ejercicio 1: Crear el bloque de Votos

source: Let's start by displaying a static counter showing "0 votes" on all talks.
es: Comencemos mostrando un contador estático que muestre "0 votos" en todas las charlas.

source: First, we need to create the ``rating`` Rapido app.
es: Primero, tenemos que crear la aplicación Rapido ``rating``.

source: Go to the Plone theming control panel: http://localhost:8080/Plone/@@theming-controlpanel
es: Vaya al panel de control de temas de Plone: http://localhost:8080/Plone/@@theming-controlpanel

source: Copy the Barceloneta theme, name it ``training`` and enable it immediately,
es: Copia el tema de Barceloneta, llámalo ``training`` y actívalo inmediatamente,

source: Add a new folder named :file:`rapido`,
es: Añada una nueva carpeta llamada :file:`rapido`,

source: And add a subfolder named :file:`rating`.
es: Y añada una subcarpeta llamada :file:`rating`.

source: The Rapido app is initialized.
es: Se inicializa la aplicación Rapido.

source: And now, we need to create a ``rate`` block.
es: Y ahora, necesitamos crear un bloque de ``rate``.

source: Add a folder named :file:`blocks` in :file:`rating`,
es: Añada una carpeta llamada :file:`blocks` en :file:`rating`,

source: In :file:`blocks`, add a file named :file:`rate.html`,
es: En :file:`blocks`, añada un archivo llamado :file:`rate.html`,

source: In the file, put the following content:
es: En el archivo, coloque el siguiente contenido:

source: Once the block is ready, you can display it by visiting its URL in your browser:
es: Una vez que el bloque esté listo, puede mostrarlo visitando su URL en su navegador:

source: But we would prefer to display it inside our existing Plone pages.
es: Pero preferiríamos mostrarlo dentro de nuestras páginas Plone existentes.

source: Include Rapido Blocks In Plone Pages
es: Incluir bloques de Rapido en páginas Plone

source: We can include Rapido blocks in Plone pages using Diazo rules.
es: Podemos incluir bloques de Rapido en las páginas de Plone usando las reglas de Diazo.

source: The ``include`` rule is able to load another URL than the current page, extract a piece of HTML from it, and include it in regular Diazo rules (such as ``after``, ``before``, etc.).
es: La regla ``include`` es capaz de cargar otra URL que la página actual, extraer un fragmento de HTML de ella e incluirlo en las reglas regulares de Diazo (como ``after``, ``before``, etc.).

source: So the following rule:
es: Por lo tanto, la siguiente regla:

source: would insert the ``stats`` block under the Plone main content.
es: insertaría el bloque ``stats`` debajo del contenido principal de Plone.

source: Rapido rules can be added directly in our theme's main :file:`rules.xml` file, but it is a good practice to put them in a dedicated rule file which can be located in our app folder.
es: Las reglas de Rapido se pueden añadir directamente en el archivo principal :file:`rules.xml` de nuestro tema, pero es una buena práctica ponerlas en un archivo de reglas dedicado que se puede ubicar en nuestra carpeta de aplicaciones.

source: The app-specific rules file can be included in the main rules file as follows (where ``MYAPP`` is the name that you gave your application):
es: El archivo de reglas específicas de la aplicación se puede incluir en el archivo de reglas principal de la siguiente manera (donde ``MYAPP`` es el nombre que le dio a la aplicación):

source: Exercise 2: Display The Vote Block In Plone Pages
es: Ejercicio 2: Mostrar el bloque de voto en las páginas de Plone

source: Insert the ``rate`` block content under the Plone page main heading.
es: Inserte el contenido del bloque ``rate`` debajo del encabezado principal de la página Plone.

source: in the main :file:`rules.xml`, add the following line just after the first ``<rules>`` opening tag:
es: en el archivo principal :file:`rules.xml`, añada la siguiente línea justo después de la primera etiqueta de apertura ``<rules>``:

source: In the :file:`rating` folder, add a new file named :file:`rules.xml` containing:
es: En la carpeta :file:`rating`, añada un nuevo archivo llamado :file:`rules.xml` que contenga:

source: Let's detail what it does:
es: Vamos a detallar lo que hace:

source: the ``after`` rule targets the page heading (identified by the ``.documentFirstHeading`` selector), but it only applies when we are viewing a talk (``.template-view.portaltype-talk``),
es: la regla ``after`` se dirige al encabezado de la página (identificado por el selector ``.documentFirstHeading``), pero solo se aplica cuando estamos viendo una charla (``.template-view.portaltype-talk``),

source: the ``include`` rule retrieves the Rapido block content.
es: la regla ``include`` recupera el contenido del bloque Rapido.

source: This presumes having completed :doc:`dexterity`.
es: Esto supone haber completado :doc:`dexterity`.

source: Now, if you visit a talk page, you see the counter below the heading.
es: Ahora, si visitas una página de discusión, verás el contador debajo del encabezado.

source: Make Our Blocks Dynamic
es: Dinamice nuestros bloques

source: We can include dynamic **elements** in our block layout.
es: Podemos incluir **elementos** dinámicos en nuestro diseño de bloques.

source: Elements will be declared in the YAML file.
es: Los elementos se declararán en el archivo YAML.

source: They will computed using code provided in the Python file.
es: Se calcularán utilizando el código proporcionado en el archivo de Python.

source: The YAML file allows us to declare elements. The Python files allows computing the *element value* using a function named after the element id. And the HTML file can display elements using the curly-brackets notation. The 3 files must have the same name (only the extensions change).
es: El archivo YAML nos permite declarar elementos. Los archivos de Python permiten calcular el *valor del elemento* utilizando una función que lleva el nombre del identificador del elemento. Y el archivo HTML puede mostrar elementos usando la notación de corchetes. Los 3 archivos deben tener el mismo nombre (solo cambian las extensiones).

source: As mentioned earlier, the **Python file** contains the application logic.
es: Como se mencionó anteriormente, el **archivo Python** contiene la lógica de la aplicación.

source: This file is a set of Python functions named to correspond to the elements or the events they relate to.
es: Este archivo es un conjunto de funciones de Python nombradas para corresponder a los elementos o los eventos con los que se relacionan.

source: For a ``BASIC`` element for instance, if we provide a function with the same name as the element, its return-value will be inserted in the block at the location of the element.
es: Para un elemento ``BASIC``, por ejemplo, si proporcionamos una función con el mismo nombre que el elemento, su valor de retorno se insertará en el bloque en la ubicación del elemento.

source: For an ``ACTION``, if we provide a function with the same name as the element, it will be executed when a user clicks on the action button.
es: Para una ``ACTION``, si proporcionamos una función con el mismo nombre que el elemento, se ejecutará cuando un usuario haga clic en el botón de acción.

source: A typical element is defined and used as follows:
es: Un elemento típico se define y utiliza de la siguiente manera:

source: create a definition in the YAML file:
es: cree una definición en el archivo YAML:

source: create an implementation in the Python file:
es: cree una implementación en el archivo de Python:

source: insert the element in the HTML template:
es: inserte el elemento en la plantilla HTML:

source: Exercise 3: Create An Element To Display The Votes
es: Ejercicio 3: Crear un elemento para mostrar los votos

source: Let's replace the "``0``" value in our rate block with a computed value.
es: Reemplacemos el valor "``0``" en nuestro bloque de tarifas con un valor calculado.

source: To do this, you need to add an element to the block. For now the Python function will return ``10``.
es: Para hacer esto, debe añadir un elemento al bloque. Por ahora, la función de Python devolverá ``10``.

source: In the :file:`blocks` folder, add a new file named :file:`rate.yaml` containing:
es: En la carpeta :file:`blocks`, añada un nuevo archivo llamado :file:`rate.yaml` que contenga:

source: Add also a file named :file:`rate.py` containing:
es: Añada también un archivo llamado :file:`rate.py` que contenga:

source: And change the existing :file:`rate.html` as follows:
es: Y cambie el archivo :file:`rate.html` existente de la siguiente manera:

source: Now, if you refresh your talk page, the counter will display the value returned by your Python function.
es: Ahora, si actualizas tu página de discusión, el contador mostrará el valor devuelto por tu función de Python.

source: Create Actions
es: Crear acciones

source: An :dfn:`action` is a regular element, but it is rendered as a button.
es: Un :dfn:`action` es un elemento regular, pero se representa como un botón.

source: Its associated function in the Python file will be called when the user clicks on the button.
es: Su función asociada en el archivo Python se llamará cuando el usuario haga clic en el botón.

source: Every time the user clicks the action, the block is reloaded (so elements are refreshed).
es: Cada vez que el usuario hace clic en la acción, el bloque se vuelve a cargar (por lo que los elementos se actualizan).

source: When the block is inserted in a Plone page using a Diazo rule, the reloading will replace the current page with the bare block. This is not what we want.
es: Cuando el bloque se inserta en una página Plone utilizando una regla Diazo, la recarga reemplazará la página actual con el bloque desnudo. Esto no es lo que queremos.

source: If we want the current Plone page to be preserved, we need to activate the AJAX mode in the YAML file:
es: Si queremos que se conserve la página Plone actual, necesitamos activar el modo AJAX en el archivo YAML:

source: Exercise 4: Add The Like Button
es: Ejercicio 4: Añadir el botón Me gusta

source: Add a :guilabel:`Like` button to the block. For now, the action itself will do nothing. Let's just insert it at the right place, and make sure the block is refreshed properly when we click.
es: Añada un botón :guilabel:`Me gusta` al bloque. Por ahora, la acción en sí no hará nada. Insertémoslo en el lugar correcto y asegurémonos de que el bloque se actualice correctamente cuando hagamos clic.

source: in :file:`rate.yaml`, add a new ``like`` element and change the target to ``ajax`` After doing this, your YAML file looks as follows:
es: en :file:`rate.yaml`, añada un nuevo elemento ``like`` y cambie el objetivo a ``ajax`` Después de hacer esto, su archivo YAML se ve de la siguiente manera:

source: in :file:`rate.py`, add a new function:
es: en el archivo :file:`rate.py`, añada una nueva función:

source: and in :file:`rate.html`:
es: y en el archivo :file:`rate.html`:

source: Store Data
es: Datos Almacenados

source: Each Rapido app provides an internal storage utility able to store records.
es: Cada aplicación Rapido proporciona una utilidad de almacenamiento interno capaz de almacenar registros.

source: Records are not Plone objects, they are just simple dictionaries of basic data (strings, numbers, dates, etc.). There is no constraint on the dictionary items but Rapido will always set an ``id`` item, so this key is reserved.
es: Los registros no son objetos Plone, son simplemente diccionarios de datos básicos (cadenas, números, fechas, etc.). No hay ninguna restricción en los elementos del diccionario, pero Rapido siempre establecerá un elemento ``id``, por lo que esta clave está reservada.

source: Something like:
es: Algo así como:

source: could be a valid record.
es: podría ser un registro válido.

source: The Rapido Python API allows us to create, get or delete records:
es: La API Python de Rapido nos permite crear, obtener o eliminar registros:

source: The record items are managed like regular Python dictionary items:
es: Los elementos de registro se administran como elementos normales del diccionario de Python:

source: Exercise 5: Count Votes
es: Ejercicio 5: Contar los votos

source: The button is OK now, now let's focus on counting votes. To count the votes on a talk, you need store some information:
es: El botón está OK ahora, ahora centrémonos en contar los votos. Para contar los votos en una charla, es necesario almacenar cierta información:

source: an identifier for the talk (we will use the talk path, from the Plone ``absolute_url_path()`` method),
es: un identificador para la charla (usaremos la ruta de la conversación, del método ``absolute_url_path()`` de Plone),

source: the total votes it gets.
es: el total de votos que obtiene.

source: Let's implement the :py:func:`like` function:
es: Implementemos la función :py:func:`like`:

source: first we need to get the current talk: the Rapido :py:obj:`context` allows to get the current Plone content using :py:attr:`context.content`,
es: primero tenemos que obtener la charla actual: el Rapido :py:obj:`context` permite obtener el contenido actual de Plone usando :py:attr:`context.content`,

source: then we need to get the record corresponding to the current talk, - if it does not exist, we need to create it,
es: luego necesitamos obtener el registro correspondiente a la charla actual, - si no existe, necesitamos crearlo,

source: and then we need to increase the current total votes for that talk by 1.
es: y luego tenemos que aumentar el total actual de votos para esa charla en 1.

source: Note: we cannot just use the content ``id`` attribute as a valid identifier because it is not unique at site level, so we prefer the path.
es: Nota: no podemos usar el atributo ``id`` de contenido como un identificador válido porque no es único a nivel de sitio, por lo que preferimos la ruta.

source: Now let's make sure to display the proper total in the ``display_votes`` element:
es: Ahora asegurémonos de mostrar el total adecuado en el elemento ``display_votes``:

source: here also, we need to get the current talk,
es: aquí también, necesitamos obtener la charla actual,

source: then we get the corresponding record,
es: luego obtenemos el registro correspondiente,

source: and we get its current total votes.
es: y obtenemos su total de votos actual.

source: HTML Templating Vs TAL Templating
es: Plantillas HTML frente a plantillas TAL

source: HTML templating
es: Plantillas HTML

source: The Rapido HTML templating is very simple. It is just plain HTML with curly-bracket notations to insert elements:
es: Las plantillas HTML de Rapido son muy sencillas. Es simplemente HTML simple con notaciones de corchetes para insertar elementos:

source: If the element is an object, we can render its properties:
es: Si el elemento es un objeto, podemos renderizar sus propiedades:

source: And if the element is a dictionary, we can access its items:
es: Y si el elemento es un diccionario, podemos acceder a sus elementos:

source: It is easy to use but it cannot perform loops or conditional insertion.
es: Es fácil de usar, pero no puede realizar bucles ni inserción condicional.

source: TAL Templating
es: Plantillas TAL

source: TAL templating is the templating format used in the core of Plone. If HTML templating is too limiting, Rapido allows you to use TAL instead.
es: La creación de plantillas TAL es el formato de plantillas utilizado en el núcleo de Plone. Si las plantillas HTML son demasiado limitantes, Rapido le permite usar TAL en su lugar.

source: We just need to provide a file with the :file:`.pt` extension instead of the HTML file.
es: Solo necesitamos proporcionar un archivo con la extensión :file:`.pt` en lugar del archivo HTML.

source: The block elements are available in the :py:obj:`elements` object:
es: Los elementos de bloque están disponibles en el objeto :py:obj:`elements`:

source: Elements can be used as conditions:
es: Los elementos se pueden utilizar como condiciones:

source: If an element returns an iterable object (list, dictionary), we can make a loop:
es: Si un elemento devuelve un objeto iterable (lista, diccionario), podemos hacer un bucle:

source: The current Rapido context is available in the :py:obj:`context` object:
es: El contexto actual de Rapido está disponible en el objeto :py:obj:'context':

source: See the `TAL commands documentation <http://www.owlfish.com/software/simpleTAL/tal-guide.html>`_ for more details about TAL.
es: Consulte la `documentación de comandos TAL <http://www.owlfish.com/software/simpleTAL/tal-guide.html>`_ para obtener más detalles sobre TAL.

source: Create Custom Views
es: Crear vistas personalizadas

source: For now, we have just added small chunks of HTML in existing pages. But Rapido also allows you to create a whole new page (a Plone developer would call it a new **view**).
es: Por ahora, solo hemos añadido pequeños fragmentos de HTML en las páginas existentes. Pero Rapido también te permite crear una página completamente nueva (un desarrollador de Plone lo llamaría una nueva **view**).

source: Let's imagine we want to display one of our Rapido blocks in the main content area instead of the regular content. We *could* do it with a simple ``replace`` Diazo rule:
es: Imaginemos que queremos mostrar uno de nuestros bloques de Rapido en el área de contenido principal en lugar del contenido normal. Podríamos hacerlo con una simple regla de ``replace`` Diazo:

source: But if we do that, the regular content will not be accessible anymore. What if we want to be able to access both the regular content with its regular URL, and define an additional URL to display our block as main content?
es: Pero si hacemos eso, el contenido regular ya no será accesible. ¿Y si queremos poder acceder tanto al contenido regular con su URL regular, como definir una URL adicional para mostrar nuestro bloque como contenido principal?

source: To accomplish this, Rapido allows you to declare **neutral views**.
es: Para lograr esto, Rapido le permite declarar **puntos de vista neutrales**.

source: By adding :samp:`@@rapido/view/{<any-name>}` to a content URL we get the content's default view. The ``any-name`` value can actually be **anything**, we do not really care, we just use it to match a Diazo rule in charge of replacing the default content with our block:
es: Al añadir :samp:`@@rapido/view/{<any-name>}` a una URL de contenido, obtenemos la vista por defecto del contenido. El valor de ``any-name`` puede ser en realidad **cualquier cosa**, realmente no nos importa, solo lo usamos para que coincida con una regla de Diazo encargada de reemplazar el contenido por defecto con nuestro bloque:

source: Now if we visit for instance::
es: Ahora bien, si visitamos por ejemplo:

source: we see our block instead of the regular page content.
es: vemos nuestro bloque en lugar del contenido normal de la página.

source: (And if we visit http://localhost:8080/Plone/page1, we get the regular content of course.)
es: (Y si visitamos http://localhost:8080/Plone/page1, obtenemos el contenido regular, por supuesto.)

source: Exercise 5: Create The Top 5 Page
es: Ejercicio 5: Crear las 5 mejores páginas

source: Let's create a block to display the Talks Top 5:
es: Vamos a crear un bloque para mostrar el Top 5 de las Charlas:

source: It needs to be a specific view.
es: Tiene que ser una vista específica.

source: We will use a TAL template (but for now the content will be fake and static).
es: Usaremos una plantilla TAL (pero por ahora el contenido será falso y estático).

source: Visitors will access it from a footer link.
es: Los visitantes accederán a él desde un enlace de pie de página.

source: First we create a :file:`top5.pt` file in the :file:`blocks` folder with the following content:
es: Primero creamos un archivo :file:`top5.pt` en la carpeta :file:`blocks` con el siguiente contenido:

source: Now we add the following to our :file:`rules.xml` file:
es: Ahora añadimos lo siguiente a nuestro archivo :file:`rules.xml`:

source: And then we declare a new action in our footer:
es: Y luego declaramos una nueva acción en nuestro pie de página:

source: go to the ``site_actions`` in the Zope Management Interface::
es: vaya a la ``site_actions`` en la interfaz de administración de Zope::

source: add a new ``top5`` action, with the :guilabel:`URL (Expression)` property set to::
es: añada una nueva acción ``top5``, con la propiedad :guilabel:`URL (Expresión)` establecida en::

source: go to :menuselection:`Site Setup --> Actions`
es: vaya a :menuselection:`Configuración del sitio --> Acciones`

source: add a new action in Site actions category with name "Top 5" and as URL::
es: añada una nueva acción en la categoría Acciones del sitio con el nombre "Top 5" y como URL::

source: Index And Query Records
es: Registros de índice y consulta

source: Rapido record items can be indexed, so we can filter or sort records easily.
es: Los elementos de registro de Rapido se pueden indexar, por lo que podemos filtrar u ordenar los registros fácilmente.

source: Indexing is declared in the block YAML file using the ``index_type`` property. Example:
es: La indexación se declara en el archivo YAML de bloque utilizando la propiedad ``index_type``. Ejemplo:

source: The ``index_type`` property can have two possible values:
es: La propiedad ``index_type`` puede tener dos valores posibles:

source: A field index matches exact values, and supports comparison queries, range queries, and sorting.
es: Un índice de campo coincide con valores exactos y admite consultas de comparación, consultas de rango y ordenación.

source: A text index matches contained words (applicable for text values only).
es: Un índice de texto coincide con las palabras contenidas (aplicable solo a los valores de texto).

source: Queries use the *CQE format* (`see documentation <http://docs.repoze.org/catalog/usage.html#query-objects>`_.
es: Las consultas utilizan el formato *CQE* (`consulte la documentación <http://docs.repoze.org/catalog/usage.html#query-objects>`_.
