Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/ttw.po
Languages: es

source: Glossary
es: Glosario

source: `Amazon Web Services <https://aws.amazon.com/>`_ offers reliable, scalable, and inexpensive cloud computing services. ree to join, pay only for what you use.
es: `Amazon Web Services <https://aws.amazon.com/>`_ ofrece servicios de computación en la nube confiables, escalables y económicos. libre de unirse, pague solo por lo que usa.

source: `Linode.com <https://www.linode.com/>`_ is an American privately owned virtual private server provider company
es: `Linode.com <https://linode.com/>`_ es una empresa proveedora de servidores privada virtual de propiedad privada estadounidense

source: based in Galloway, New Jersey, United States.
es: con sede en Galloway, New Jersey, Estados Unidos.

source: `DigitalOcean, Inc. <https://www.digitalocean.com/>`_ is an American cloud infrastructure provider
es: `DigitalOcean, Inc. <https://www.digitalocean.com/>`_ es un proveedor estadounidense de infraestructura en la nube

source: headquartered in New York City with data centers worldwide.
es: con sede en la ciudad de Nueva York y centros de datos en todo el mundo.

source: `A native object database for Python <http://www.zodb.org/en/latest/>`_.
es: `Una base de datos de objetos nativos para Python <http://www.zodb.org/en/latest/>`_.

source: Through-The-Web, changes in the browser/
es: A través de la web, cambios en el navegador/

source: `Amazon S3 <https://aws.amazon.com/s3/>`_ - Object storage built to store and retrieve any amount of data from anywhere.
es: `Amazon S3 <https://aws.amazon.com/s3/>`_ - Almacenamiento de objetos creado para almacenar y recuperar cualquier cantidad de datos desde cualquier lugar.

source: `AWS OpsWorks <https://aws.amazon.com/opsworks/>`_ is a configuration management service that uses Chef,
es: `AWS OpsWorks <https://aws.amazon.com/opsworks/>`_ es un servicio de administración de configuración que usa Chef,

source: an automation platform that treats server configurations as code.
es: una plataforma de automatización que trata las configuraciones del servidor como código.

source: `Ansible <https://www.ansible.com/>`_ is an open source automation platform.
es: `Ansible <https://www.ansible.com/>`_ es una plataforma de automatización de fuente abierta.

source: Ansible can help you with configuration management, application deployment, task automation.
es: Ansible puede ayudarlo con la gestión de la configuración, la implementación de aplicaciones y la automatización de tareas.

source: `A configuration management tool written in Ruby and Erlang <https://www.chef.io/chef/>`_.
es: `Una herramienta de gestión de configuración escrita en Ruby y Erlang <https://www.chef.io/chef/>`_.

source: `AWS CloudFormation <https://aws.amazon.com/cloudformation/>`_ gives developers and systems administrators an way to create and manage a collection of related AWS resources, provisioning and updating them in an orderly and predictable fashion.
es: `AWS CloudFormation <https://aws.amazon.com/cloudformation/>`_ brinda a los desarrolladores y administradores de sistemas una forma de crear y administrar una colección de recursos relacionados de AWS, aprovisionándolos y actualizándolos de manera ordenada y predecible.

source: Travis CI is a hosted, distributed continuous integration service used to build and test software projects hosted at GitHub. Open source projects may be tested at no charge via `travis-ci.org <https://travis-ci.org>`_.
es: Travis CI es un servicio de integración continua alojado que se utiliza para crear y probar proyectos de software alojados en GitHub. Los proyectos de código abierto pueden probarse sin cargo a través de `travis-ci.org <https://travis-ci.org>`_.

source: `Solr <http://lucene.apache.org/solr/>`_ a the popular, blazing-fast, open source enterprise search platform built on Apache Lucene.
es: `Solr <http://lucene.apache.org/solr/>`_ una popular plataforma de búsqueda empresarial de código abierto, desarrollada en Apache Lucene.

source: The `Zope Configuration Mark-up Language <https://docs.plone.org/develop/addons/components/zcml.html>`_.
es: El `Lenguaje de marcado de configuración Zope <https://docs.plone.org/develop/addons/components/zcml.html>`_.

source: `Diazo theme engine guide <http://docs.diazo.org/en/latest/>`_ Diazo allows you to apply a theme contained in a static HTML web page to a dynamic website created using any server-side technology.
es: `Guía del motor de temas de Diazo <http://docs.diazo.org/en/latest/>`_ Diazo le permite aplicar un tema contenido en una página web HTML estática a un sitio web dinámico creado utilizando cualquier tecnología del lado del servidor.

source: `Dexterity <https://github.com/plone/plone.dexterity>`_, the base framework for building content types, both through-the-web and as filesystem code for Zope.
es: `Dexterity <https://github.com/plone/plone.dexterity>`_, el marco base para crear tipos de contenido, tanto a través de la web como como código del sistema de archivos para Zope.

source: The Dublin Core Schema is a small set of vocabulary terms that can be used to describe web resources (video, images, web pages, etc.), as well as physical resources such as books or CDs, and objects like artworks.
es: El Dublin Core Schema es un pequeño conjunto de términos de vocabulario que se pueden utilizar para describir recursos web (vídeo, imágenes, páginas web, etc.), así como recursos físicos como libros o CD, y objetos como obras de arte.

source: Rapido application
es: Aplicación Rapido

source: It contains the features you implement; it is a folder containing templates, Python code, and YAML files.
es: Contiene las características que implementa; es una carpeta que contiene plantillas, código Python y archivos YAML.

source: block
es: bloque

source: Blocks display a chunk of HTML which can be inserted in your Plone pages.
es: Los bloques muestran un fragmento de HTML que se puede insertar en sus páginas de Plone.

source: element
es: elemento

source: Elements are the dynamic components of your blocks. They can be input fields, buttons, or computed HTML. They can also return JSON if you call them from a JavaScript app,
es: Los elementos son los componentes dinámicos de los bloques. Pueden ser campos de entrada, botones o HTML calculado. También pueden devolver JSON si los llama desde una aplicación de JavaScript,

source: record
es: registro

source: A Rapido app is able to store data as records. Records are basic dictionaries.
es: Una aplicación Rapido es capaz de almacenar datos como registros. Los registros son diccionarios básicos.

source: About
es: Acerca de

source: Customizing Logo And CSS Of Default Theme
es: Personalización del logotipo y CSS del tema por defecto

source: In this section you will:
es: En esta sección:

source: Use the Site control panel to add a custom logo
es: Utilice el panel de control del sitio para añadir un logotipo personalizado

source: Customize the look of a Plone site by adjusting Less Variables
es: Personalice el aspecto de un sitio de Plone ajustando Menos variables

source: Add a custom toolbar logo
es: Añadir un logotipo de barra de herramientas personalizado

source: Topics covered:
es: Tópicos cubiertos:

source: The :guilabel:`Site` control panel
es: El panel de control :guilabel:`Sitio`

source: The :guilabel:`Resource Registries` Control Panel
es: El panel de control :guilabel:`Registros de recursos`

source: Resource Registries > Development Mode
es: Registros de recursos > Modo desarrollo

source: Customize Logo
es: Personalizar el logotipo

source: Go to the Plone Control Panel: :menuselection:`toolbar --> admin --> Site Setup`
es: Vaya al panel de control de Plone: :menuselection:`toolbar --> admin --> Configuración del sitio`

source: Go to the :guilabel:`Site` control panel.
es: Vaya al panel de control :guilabel:`Sitio`.

source: You will see this form:
es: Verás este formulario:

source: You can now add / remove your custom logo
es: Ahora puede añadir / eliminar su logotipo personalizado

source: See the `official docs <https://docs.plone.org/adapt-and-extend/change-the-logo.html>`_.
es: Consulte la `documentación oficial <https://docs.plone.org/adapt-and-extend/change-the-logo.html>`_.

source: Customize CSS/Less Variables
es: Personalizar variables CSS/Less

source: Go back to the Control Panel.
es: Vuelva al Panel de control.

source: Go to the :guilabel:`Resource Registries` control panel.
es: Vaya al panel de control :guilabel:`Registros de recursos`.

source: On the first tab: enable :guilabel:`Development Mode`.
es: En la primera pestaña: habilite :guilabel:`Modo de desarrollo`.

source: In the "plone" bundle below, click on :guilabel:`develop CSS`.
es: En el paquete "plone" a continuación, haga clic en :guilabel:`desarrollar CSS`.

source: Your panel should now look like this:
es: Su panel ahora debería verse así:

source: Now we can play with some Less variables:
es: Ahora podemos jugar con algunas variables Less:

source: Go to the :guilabel:`Less Variables` tab.
es: Vaya a la pestaña :guilabel:`Variables Less`.

source: Find the variable ``plone-left-toolbar-expanded`` and set it to 400px.
es: Encuentra la variable ``plone-left-toolbar-expanded`` y establécela en 400px.

source: Hit the :guilabel:`Save` button in the upper right and reload the page.
es: Presione el botón :guilabel:`Guardar` en la parte superior derecha y vuelva a cargar la página.

source: Go back to the :guilabel:`Registry` tab and hit the :guilabel:`Build` button for the ``plone`` bundle.
es: Regrese a la pestaña :guilabel:`Registro` y presione el botón :guilabel:`Construir` para el paquete ``plone``.

source: Click on the toolbar logo to expand the toolbar: voilá!
es: Haga clic en el logotipo de la barra de herramientas para expandir la barra de herramientas: ¡voilá!

source: You can play around with some other variables, if you want.
es: Puedes jugar con algunas otras variables, si quieres.

source: "Development Mode" is really expensive for the browser. Depending on the browser and on the system, you might encounter extreme slowness while rendering the page.
es: El "Modo desarrollo" es realmente caro para el navegador. Dependiendo del navegador y del sistema, es posible que encuentre una lentitud extrema al procesar la página.

source: You could see an unthemed page for a while. Remember to switch it off as soon as you finished tweaking.
es: Podrías ver una página sin tema durante un tiempo. Recuerde apagarlo tan pronto como termine de ajustarlo.

source: Configuring And Customizing
es: Configuración y personalización

source: This chapter has not yet been updated for Plone 5!
es: ¡Este capítulo aún no se ha actualizado para Plone 5!

source: The Control Panel
es: El panel de control

source: The most important parts of Plone can be configured in the control panel.
es: Las partes más importantes de Plone pueden ser configuradas en el panel de control.

source: Click on the portrait/username in the toolbar
es: Haga clic en el retrato/nombre de usuario en la barra de herramientas

source: Click :guilabel:`Site Setup`
es: Haga clic en :guilabel:`Configuración del Sitio`

source: We'll explain every page and mention some of the actions you can perform here.
es: Nosotros explicaremos cada página y mencionaremos algunas cosas que puedes hacer aquí.

source: Date and Time
es: Fecha y Hora

source: Language
es: Idioma

source: Mail
es: Correo

source: Navigation
es: Navegación

source: Site
es: Sitio

source: Add-ons
es: Complementos

source: Search
es: Buscar

source: Discussion
es: Discusión

source: Theming
es: Temas

source: Social Media
es: Redes Sociales

source: Syndication
es: Sindicación

source: Content
es: Contenido

source: Content Rules
es: Reglas de Contenido

source: Editing
es: Edición

source: Image Handling
es: Manejo de Imágenes

source: Markup
es: Etiquetado

source: Content Settings
es: Configuración de Contenido

source: Dexterity Content Types
es: Tipos de contenido Dexterity

source: Users
es: Usuarios

source: Users and Groups
es: Usuarios y Grupos

source: Security
es: Seguridad

source: HTML Filtering
es: Filtrado HTML

source: Errors
es: Errores

source: Advanced
es: Avanzado

source: Maintenance
es: Mantenimiento

source: Management Interface
es: Interfaz de Administración

source: Caching
es: Caché

source: Configuration Registry
es: Registro de Configuración

source: Resource Registries
es: Registros de Recursos

source: Below the links you will find information on your Plone, Zope and Python versions and an indicator as to whether you're running in production or development mode.
es: Debajo de los enlaces encontrará información sobre sus versiones de Plone, Zope y Python y un indicador de si se está ejecutando en modo de producción o desarrollo.

source: Change The Logo
es: Cambia el logotipo

source: Let's change the logo.
es: Cambiemos el logotipo.

source: Download a Plone Conference logo: https://www.starzel.de/plone-tutorial/ploneconf-logo-2014
es: Descargue el logotipo de la Conferencia Plone: https://www.starzel.de/plone-tutorial/ploneconf-logo-2014

source: Go to http://localhost:8080/Plone/@@site-controlpanel
es: Ir a http://localhost:8080/Plone/@@site-controlpanel

source: Upload the Logo.
es: Cargue el Logotipo.

source: In the toolbar under :guilabel:`More options` you can open the configuration for the different places where you can have portlets.
es: En la barra de herramientas bajo :guilabel:`Más opciones` puede abrir la configuración de los diferentes lugares donde puede tener portlets.

source: UI (User Interface) fit for smart content editors
es: UI (interfaz de usuario) apta para editores de contenido inteligentes

source: Various types
es: Varios tipos

source: Portlet configuration is inherited
es: La configuración de Portlet es heredada

source: Managing
es: Administrando

source: Ordering/weighting
es: Ordenando / ponderación

source: The future: may be replaced by tiles
es: En el futuro: será reemplazado por tiles

source: Example:
es: Ejemplo:

source: Go to http://localhost:8080/Plone/@@manage-portlets
es: Valla a la dirección URL http://localhost:8080/Plone/@@manage-portlets

source: Add a static portlet "Sponsors" on the right side.
es: Añada un portlet "Patrocinadores" en el lado derecho.

source: Remove the news portlet and add a new one on the left side.
es: Retire el portlet de noticias y añada uno nuevo en el lado izquierdo.

source: Go to the training folder: http://localhost:8080/Plone/the-event/training and click :guilabel:`Manage portlets`
es: Vaya a la carpeta de entrenamiento: http://localhost:8080/Plone/the-event/training y haga clic en :guilabel:`Administrar portlets`

source: Add a static portlet. "Featured training: Become a Plone-Rockstar at Mastering Plone!"
es: Añada un portlet estático. "Entrenamiento destacada: Conviértete en un Rockstar de Plone en la ¡Maestría en Plone!"

source: Use the toolbar to configure the portlets of the footer:
es: Use la barra de herramientas para configurar los portlets del pie de página:

source: Hide the portlets "Footer" and "Colophon".
es: Ocultar los portlets "Pie de página" y "Colofón".

source: Add a :guilabel:`Static text portlet` and enter "Copyright 2015 by Plone Community".
es: Añada un :guilabel:`Portlet de texto estático` e ingrese "Copyright 2015 by Plone Community".

source: Use :menuselection:`Insert --> Special Character` to add a real © sign.
es: Use :menuselection:`Insertar --> Carácter especial` para añadir un signo real ©.

source: You could turn that into a link to a copyright page later.
es: Podría convertirlo en un enlace a una página de derechos de autor más adelante.

source: Portlets save data, Viewlets usually don't. Viewlets are often used for UI-Elements and have no nice UI to customize them.
es: Los portlets guardan datos, los viewlets normalmente no lo hacen. Los viewlets se utilizan a menudo para UI-Elements y no tienen una interfaz de usuario agradable para personalizarlos.

source: Viewlets have no nice UI
es: Los viewlets no tienen una interfaz de usuario agradable

source: Not aimed at content editors
es: No está dirigido a editores de contenido

source: Not locally addable, no configurable inheritance.
es: No se puede añadir localmente, no hay herencia configurable.

source: Usually global (depends on code)
es: Usualmente global (depende del código)

source: Will be replaced by tiles?
es: ¿Será reemplazado por mosaicos?

source: The code is much simpler (we'll create one tomorrow).
es: El código es mucho más sencillo (crearemos uno mañana).

source: Live in viewlet managers, can be nested (by adding a viewlet that contains a viewlet manager).
es: En vivo en los administradores de viewlets, se puede anidar (añadiendo un viewlet que contiene un administrador de viewlets).

source: TTW (Trough-The-Web) reordering only within the same viewlet manager.
es: TTW (Trough-The-Web) reordenando solo dentro del mismo administrador de viewlets.

source: The code decides when it is shown and what it shows.
es: El código decide cuándo se muestra y qué se muestra.

source: ZMI (Zope Management Interface)
es: Interfaz de Administración de Zope (ZMI)

source: Go to http://localhost:8080/Plone/manage
es: Valla a dirección URL http://localhost:8080/Plone/manage

source: Zope is the foundation of Plone. Here you can access the inner workings of Zope and Plone alike.
es: Zope es la base de Plone. Aquí puede acceder al funcionamiento interno de Zope y Plone por igual.

source: Here you can break your site so you should know what you are doing!
es: ¡Aquí puedes romper tu sitio para que sepas lo que estás haciendo!

source: We only cover three parts of customization in the ZMI now. Later on when we added our own code we'll come back to the ZMI and will look for it.
es: Nosotros sólo cubrimos las tres partes de la personalización en el ZMI ahora. Más tarde, cuando agreguemos nuestro propio código fuente vamos a volver a la ZMI y lo buscaremos.

source: At some point you'll have to learn what all those objects are about. But not today.
es: En algún momento tendrás que aprender de qué se tratan todos esos objetos. Pero hoy no.

source: Actions (:guilabel:`portal_actions`)
es: Acciones (:guilabel:`portal_actions`)

source: Actions are mostly links. But **really flexible** links.
es: Las acciones son principalmente enlaces. Pero enlaces **realmente flexibles**.

source: Actions are configurable TTW (Through-The-Web) and through code.
es: Las acciones son configurable a través de la Web y a través de código fuente.

source: These actions are usually iterated over in viewlets and displayed.
es: Estas acciones son usualmente iteradas sobre viewlets y mostradas.

source: Examples:
es: Ejemplos:

source: Links in the Footer (:guilabel:`site_actions`)
es: Enlaces en el pie de página (:guilabel:`site_actions`)

source: Actions Dropdown (:guilabel:`folder_buttons`)
es: Menú desplegable de acciones (:guilabel:`folder_buttons`)

source: Actions have properties like:
es: Las acciones tienen propiedades como:

source: description
es: descripción

source: These are the links at the bottom of the page:
es: Estos son los enlaces al fondo de la página:

source: :guilabel:`Site Map`
es: :guilabel:`Mapa del sitio`

source: :guilabel:`Accessibility`
es: :guilabel:`Accesibilidad`

source: :guilabel:`Contact`
es: :guilabel:`Contacto`

source: :guilabel:`Site Setup`
es: :guilabel:`Configuración del sitio`

source: We want a new link to legal information, called "Imprint".
es: Queremos un nuevo enlace a la información legal, llamado "Aviso Legal".

source: Go to :guilabel:`site_actions` (we know that because we checked in ``@@manage-viewlets``)
es: Ir a :guilabel:`site_actions` (lo sabemos porque lo chequeamos en ``@@manage-viewlets``)

source: Add a CMF Action ``imprint``
es: Añadir una acción CMF ``imprimir``

source: Set the *Title* to ``Imprint`` (this will be the link text)
es: Establezca el *Título* en ``Impresión`` (este será el texto del enlace)

source: Set URL to ``string:${portal_url}/imprint``
es: Asigna dirección URL a ``string:${portal_url}/imprint``

source: Leave *condition* empty
es: Deje *condition* en blanco

source: Set permission to ``View``
es: Asigne el permiso a ``View``

source: Save
es: Guardar

source: explain
es: explicar

source: Check if the link is on the page
es: Verifique si el enlace de esta en la página funciona

source: Create new Document "Imprint" and publish
es: Cree un nuevo Documento llamado "Aviso legal" y publíquelo

source: Global Navigation
es: Navegación global

source: The horizontal navigation is called :guilabel:`portal_tabs`
es: La navegación horizontal es llamada :guilabel:`portal_tabs`

source: Go to :menuselection:`portal_actions --> portal_tabs` (`link <http://localhost:8080/Plone/portal_actions/portal_tabs/manage_main>`_)
es: Vaya a :menuselection:`portal_actions --> portal_tabs` (`enlace <http://localhost:8080/Plone/portal_actions/portal_tabs/manage_main>`_)

source: Edit ``index_html``
es: Edite ``index_html``

source: Where is the navigation?
es: ¿Donde esta la navegación?

source: The navigation shows content-objects, which are in Plone's root. Plus all actions in :guilabel:`portal_tabs`.
es: La navegación muestra objetos de contenido, que están en la raíz de Plone. Además de todas las acciones en :guilabel:`portal_tabs`.

source: Explain & edit ``index_html``.
es: Explique y Edite el objeto ``index_html``.

source: Configuring the navigation itself is done elsewhere: http://localhost:8080/Plone/@@navigation-controlpanel
es: Configurando la navegación por si mismo es hecho en cualquier parte: http://localhost:8080/Plone/@@navigation-controlpanel

source: If time explain:
es: Si hay tiempo explique:

source: In :guilabel:`portal_skins` we can change certain images, CSS-files and templates.
es: En :guilabel:`portal_skins` podemos cambiar ciertas imágenes, archivos CSS y plantillas.

source: :guilabel:`portal_skins` is deprecated technology
es: :guilabel:`portal_skins` es una tecnología obsoleta

source: Plone 5 got rid of most files that lived in :guilabel:`portal_skins`.
es: Plone 5 se deshizo de la mayoría de los archivos que vivían en :guilabel:`portal_skins`.

source: Change Some CSS
es: Cambiar algo de CSS

source: Go to ZMI
es: Ir a ZMI

source: Go to :guilabel:`portal_skins`
es: Ir a :guilabel:`portal_skins`

source: Go to :guilabel:`plone_styles`
es: Ir a :guilabel:`plone_styles`

source: Go to :file:`ploneCustom.css`
es: Ir al archivo :file:`ploneCustom.css`

source: Click :guilabel:`customize`
es: Haga clic en :guilabel:`customize`

source: The CSS you add to this file is instantly active on the site.
es: El CSS que añada a este archivo está instantáneamente activo en el sitio.

source: Change the footer
es: Cambiar el pie de página

source: Go to :guilabel:`portal_view_customizations`
es: Valla a :guilabel:`portal_view_customizations`

source: Search ``plone.footer``, and click :guilabel:`Customize`
es: Buscar ``plone.footer``, y haga clic en :guilabel:`Customize`

source: Replace the content with the following
es: Reemplace el contenido con lo siguiente

source: Further Tools In The ZMI
es: Más herramientas en el ZMI

source: There are many more notable items in the ZMI. We'll visit some of them later.
es: Hay muchos más elementos notables en el ZMI, los visitaremos más tarde.

source: :guilabel:`portal_properties` (deprecated)
es: :guilabel:`portal_properties` (obsoleto)

source: Summary
es: Resumen
