Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/views_3.po
Languages: es

source: Views III: A Talk list
es: Vistas - Parte III: Una lista de Charlas

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: Now we don't want to provide information about one specific item but on several items. What now? We can't look at several items at the same time as context.
es: Ahora no queremos proporcionar información sobre un elemento específico, sino en varios elementos. ¿Y ahora qué? No podemos mirar a varios elementos al mismo tiempo que el contexto.

source: Using portal_catalog
es: Usando portal_catalog

source: Let's say we want to show a list of all the talks that were submitted for our conference. We can just go to the folder and select a display-method that suits us. But none does because we want to show the target-audience in our listing.
es: Digamos que queremos mostrar una lista de todas las charlas que se presentaron durante la conferencia. Sólo podemos ir a la carpeta y seleccione un método de visualización que nos convenga. Pero ninguno lo hace porque queremos para mostrar al público objetivo en nuestro listado.

source: So we need to get all the talks. For this we use the python-class of the view to query the catalog for the talks.
es: Así que tenemos que conseguir todas las charlas. Para ello utilizamos la vista de la clase Python para consultar en el catálogo las charlas.

source: The catalog is like a search-engine for the content on our site. It holds information about all the objects as well as some of their attributes like title, description, workflow_state, keywords that they were tagged with, author, content_type, it's path in the site etc. But it does not hold the content of "heavy" fields like images or files, richtext-fields and field that we just defined ourselves.
es: El catálogo es como un motor de búsqueda por el contenido de nuestro sitio. Contiene información sobre todos los objetos, así como algunos de sus atributos como título, descripción, desde estado de flujo de trabajo, palabras clave que fueron etiquetadas, autor, tipo de contenido, su ruta en el sitio, etc. Sin embargo, no se mantiene el contenido de campos "pesado" como imágenes o archivos, campos texto enriquecidos y el campo que acabamos de definir nosotros mismos.

source: It is the fast way to get content that exists in the site and do something with it. From the results of the catalog we can get the objects themselves but often we don't need them, but only the properties that the results already have.
es: Es la forma más rápida de obtener el contenido que existe en el sitio y hacer algo con él. A partir de los resultados del catálogo podemos conseguir los mismos objetos, pero a menudo no lo necesita, pero sólo las propiedades que los resultados ya tienen.

source: ``browser/configure.zcml``
es: El archivo ``browser/configure.zcml``

source: ``browser/views.py``
es: El archivo ``browser/views.py``

source: We query the catalog for two things:
es: Nosotros consultamos el catálogo para dos cosas:

source: We get the path of the current context to query only for objects in the current path. Otherwise we'd get all talks in the whole site. If we moved some talks to a different part of the site (e.g. a sub-conference for universities with a special talk-list) we might not want so see them in our listing.
es: Obtenemos la ruta del contexto actual para consultar sólo para los objetos en la ruta actual. De lo contrario íbamos a obtener todas las charlas en todo el sitio. Si nos trasladamos algunas charlas a una parte diferente del sitio (por ejemplo, un sub-conferencia para universidades con una especial lista charla) puede ser que no quiera ver así en nuestra lista.

source: We iterate over the list of results that the catalog returns us.
es: Nosotros iteramos sobre la lista de resultados que el catálogo nos devuelve.

source: We create a dictionary that holds all the information we want to show in the template. This way we don't have to put any complex logic into the template.
es: Creamos un diccionario que contiene toda la información que queremos mostrar en la plantilla. De esta manera no tiene que poner ninguna lógica compleja en la plantilla.

source: brains and objects
es: Cerebros y objetos

source: Objects are normally not loaded into memory but lie dormant in the Database ZODB. Waking objects up can be slow, especially if you're waking up a lot of objects. Fortunately our talks are not especially heavy since they are:
es: Los objetos normalmente no se cargan en la memoria, pero permanecen latentes en el base de datos ZODB. Despertar objetos hasta puede ser lento, especialmente si usted está despertando una gran cantidad de objetos. Afortunadamente nuestros tipos de contenidos no son especialmente pesados, ya que son:

source: dexterity-objects which are lighter than their archetypes-brothers
es: objetos dexterity que son más ligeros que sus hermanos archetypes

source: relatively few since we don't have thousands of talks at our conference
es: relativamente pocos, ya que no tenemos miles de charlas en nuestra conferencia

source: We want to show the target-audience but that attributes of the talks is not in the catalog. This is why we need to get to the objects themselves.
es: Queremos mostrar la audiencia destinada de la charla, pero esos atributos de las charlas no está en el catálogo. Esto es por qué necesitamos llegar a los objetos mismos.

source: We could also add a new index to the catalog that will add 'audience' to the properties of the brains, we have to weight pros and cons:
es: También podríamos agregar un nuevo índice al catálogo que agregará 'audience' a las propiedades de los cerebros. Tenemos que ponderar los pros y contras:

source: talks are important and thus most likely always in memory
es: charlas son importantes y por lo tanto más probable es que siempre este en memoria

source: prevent bloating of catalog with indexes
es: prevenir la inflamación del catálogo con índices

source: The code to add such an index would look like this::
es: El código para agregar este índice se vería como el siguiente::

source: We'd have to register this factory function as a named adapter in the ``configure.zcml``. Assuming you've put the code above into a file named indexers.py
es: Tendríamos que registrar esta función factory como un adaptador llamado en el archivo ``configure.zcml``. Suponiendo que haya puesto el código fuente anterior en un archivo llamado indexers.py

source: We will add some indexers later on.
es: Vamos a agregar algunos índices más adelante.

source: Why use the catalog at all? It checks for permissions, and only returns the talks that the current user may see. They might be private or hidden to you since they are part of a top-secret conference for core-developers (there is no such thing!).
es: ¿Por qué utilizar el catálogo en absoluto?, comprueba los permisos, y sólo devuelve las charlas que el usuario actual puede ver. Puede ser que sean privados u ocultos a usted, ya que son parte de una súper conferencia secreta para los desarrolladores del núcleo de Plone (¡no hay tal cosa!).

source: Most objects in plone act like dictionaries, so you can do ``context.values()`` to get all it's contents.
es: La mayoría de los objetos en Plone son como diccionarios, por lo que podían hacer ``context.values()`` para obtener todos sus contenidos.

source: For historical reasons some attributes of brains and objects are written differently::
es: Por razones históricas, algunos atributos de los cerebros y los objetos se escriben de manera diferente:

source: Who can guess what ``brain.title`` will return since the brain has no such attribute?
es: ¿Quién puede adivinar lo que ``brain.title`` volverán ya que el cerebro no tiene ese atributo?

source: Answer: Acquisition will get the attribute from the nearest parent. ``brain.__parent__`` is ``<CatalogTool at /Plone/portal_catalog>``. The attribute ``title`` of the ``portal_catalog`` is 'Indexes all content in the site'.
es: Respuesta: La Adquisición obtendrá el atributo de servidor principal más cercano. ``brain.__parent__`` es ``<CatalogTool at /Plone/portal_catalog>``. El atributo ``title`` del ``portal_catalog`` es 'Indexado en todo el contenido en el sitio'.

source: Acquisition can be harmful. Brains have no attribute 'getLayout' ``brain.getLayout()``::
es: La Adquisición puede ser nocivo. Los cerebros no tienen el atributo 'getLayout' ``brain.getLayout()``::

source: The same is true for methods::
es: Lo mismo es cierto para los métodos::

source: Querying the catalog
es: Consultando el catálogo

source: There are many `catalog indexes <http://docs.plone.org/4/en/develop/plone/searching_and_indexing/indexing.html>`_ to query. Here are some examples::
es: Hay muchos `índices de catálogo <http://docs.plone.org/4/en/develop/plone/searching_and_indexing/indexing.html>`_ para consultar. He aquí algunos ejemplos::

source: Calling the catalog without parameters return the whole site::
es: Llamando al catálogo sin parámetros devuelven todo el sitio::

source: Exercises
es: Ejercicios

source: Since you now know how to query the catalog it is time for some exercise.
es: Ya que ahora saben cómo consultar el catálogo es el momento para un poco de ejercicio.

source: Exercise 1
es: Ejercicio 1

source: Add a method ``get_news`` to ``TalkListView`` that returns a list of brains of all News Items that are published and sort them in the order of their publishing-date.
es: Agregue un método ``get_news`` a ``TalkListView`` que devuelve una lista de los cerebros de todos los elementos de Noticias que se publican y ordenarlos en el orden de su publicación fecha.

source: Solution
es: Solución

source: Exercise 2
es: Ejercicio 2

source: Add a method that returns all published keynotes as objects.
es: Agregar un método que regresa todas los tipos de contenidos Talk de tipo keynotes publicadas como objetos.

source: The template for the listing
es: La plantilla para la lista

source: Next you create a template in which you use the results of the method 'talks'.
es: A continuación, crear una plantilla en la usa los resultados del método 'talks'.

source: Try to keep logic mostly in python. This is for two reasons:
es: Trate de mantener la lógica mayormente en Python. Esto es por dos razones:

source: Readability:
es: Legibilidad:

source: It's much easier to read python than complex tal-structures
es: Es mucho más fácil de leer Python que complejas estructuras de TAL.

source: Speed:
es: Velocidad:

source: Python-code is faster than code executed in templates. It's also easy to add caching to methods.
es: El código Python es más rápido que el código ejecutado en las plantillas. También es fácil de añadir almacenamiento en caché a los métodos.

source: DRY:
es: Don't Repeat Yourself (DRY):

source: In Python you can reuse methods and easily re-factor code. Refactoring TAL usually means having to do big changes in the html-structure which results in incomprehensible diffs.
es: En Python se puede volver a utilizar métodos y refactorizar código fácilmente. Refactorizando TAL generalmente significa tener que hacer grandes cambios en la estructura HTML que se traduce en diffs incomprensible.

source: The MVC-Schema does not directly apply to Plone but look at it like this:
es: El esquema MVC no se aplica directamente a Plone pero míralo de esta manera:

source: Model:
es: Modelo:

source: the object
es: el objeto

source: View:
es: Vista:

source: the template
es: la plantilla

source: Controller:
es: Controlador:

source: the view
es: la vista

source: The view and the controller are very much mixed in Plone. Especially when you look at some of the older code of Plone you'll see that the policy of keeping logic in python and representation in templates was not always enforced.
es: La vista y el controlador están muy mezclados en Plone. Especialmente cuando nos fijamos en algunos de los códigos más antiguos de Plone verás que la política de mantener la lógica en Python y representación en las plantillas no siempre se cumple.

source: But you should nevertheless do it! You'll end up with more than enough logic in the templates anyway.
es: ¡Pero usted debe, no obstante, que lo haga! Usted va a terminar con más que suficiente lógica en las plantillas de todos modos.

source: Add this simple table to ``templates/talklistview.pt``:
es: Agregar esta sencilla tabla al archivo ``templates/talklistview.pt``:

source: Afterwards you transform it into a listing:
es: Después usted lo transforma dentro de una lista:

source: There are some some things that need explanation:
es: Hay algunas cosas que necesitan explicación:

source: This iterates over the list of dictionaries returned by the view. ``view/talks`` calls the method ``talks`` of our view and each ``talk`` is in turn one of the dictionaries that are returned by this method. Since TAL's path-expressions for the lookup of values in dictionaries is the same as the attributes of objects we can write ``talk/somekey`` as we could ``view/somemethod``. Handy but sometimes irritating since from looking at the page-template alone we have often no way of knowing if something is an attribute, a method or the value of a dict. It would be a good practice to write ``tal:repeat="talk python:view.talks()"``.
es: Este itera sobre la lista de diccionarios devueltos por la vista. La vista ``view/talks`` llama al método ``talks`` de nuestro vista y cada ``talk`` es a su vez regresa uno de los diccionarios que son devueltos por este método. Desde las expresiones de ruta TAL para la búsqueda de los valores en los diccionarios es la misma que los atributos de los objetos se puede escribir ``talk/somekey`` como pudimos ``view/somemethod``. Práctico, pero a veces irritante ya de mirar la page template solos a menudo no tenemos forma de saber si algo es un atributo, un método o el valor de un diccionario. Sería una buena práctica para escribir ``tal:repeat="talk python:view.talks()"``.

source: 'speaker' is a key in the dict 'talk'. We could also write ``tal:content="python:talk['speaker']"``
es: 'speaker' es una clave en el diccionario 'talk'. También podríamos escribir ``tal:content="python:talk['speaker']"``

source: This is a fallback if no talks are returned. It then return an empty list (remember ``results = []``?)
es: Esta es una alternativa en caso de no se devuelven las charlas. A continuación, devolver una lista vacía (¿recuerda ``results = []``?)

source: Exercise
es: Ejercicio

source: Modify the view to only python-expressions.
es: Modificar la vista para solamente expresiones Python.

source: To follow the mantra "don't repeat yourself" we define ``talks`` instead of calling the method twice.
es: Para seguir el principio "don't repeat yourself" nosotros definimos ``talks`` vez de llamar al método dos veces.

source: Setting a custom view as default-view on an object
es: Configuración de una vista personalizada como vista por defecto en un objeto

source: We don't want to always have to append /@@talklistview to our folder to get the view. There is a very easy way to set the view to the folder using the ZMI.
es: No queremos tener siempre que a anexar /@@talklistview a nuestra carpeta para obtener la vista. Hay una manera muy fácil de configurar la vista de la carpeta con el ZMI.

source: If we append ``/manage_propertiesForm`` we can set the property "layout" to ``talklistview``.
es: Si agregamos ``/manage_propertiesForm`` podemos establecer la propiedad "layout" para la vista ``talklistview``.

source: To make views configurable so that editors can choose them we have to register the view for the content-type at hand in it's FTI. To enable if for all folders we add a new file ``profiles/default/types/Folder.xml``
es: Para hacer vistas configurables para que los editores pueden elegir entonces tenemos que registrar la vista para el tipo de contenido que nos ocupa, en que es FTI. Para activar si todas las carpetas tiene esta vista se añade un nuevo archivo ``profiles/default/types/Folder.xml``

source: After reapplying the typeinfo-profile of out addon (or simply reinstalling it) the content-type "Folder" is extended with our additional view-method and appears in the display-dropdown.
es: Después de volver a aplicar el perfil typeinfo del complemento (o, simplemente, volver a instalarlo) el tipo de contenido "Carpeta" se amplía con nuestro método de vista adicional y aparece en la lista desplegable Mostrar.

source: The ``purge="False"`` appends the view to the already existing ones instead of replacing them.
es: La opción ``purge="False"`` anexa a la vista de los ya existentes en lugar de reemplazarlos.

source: Adding some javascript (collective.js.datatables)
es: Agregando un poco de Javascript (collective.js.datatables)

source: Here we use one of many nice feature build into Plone. The class="listing" gives the table a nice style and makes the table sortable with some javascript.
es: Aquí se utiliza una de las muchas agradables característica construida en Plone. La class="listing" da la tabla un buen estilo y hace que la tabla se puede ordenar con un poco de Javascript.

source: But we could improve that table further by using a nice javascript-library called "datatables". It might even become part of the Plone-core at some point.
es: Pero podríamos mejorar esa tabla aún más mediante el uso de una buena librería Javascript llamada "datatables". Incluso podría llegar a ser parte del core de Plone en algún momento.

source: Like for many js-libraries there is already a package that doe the plone-integration for us: ``collective.js.datatables``. Like all python-packages you can find it on pypi: https://pypi.python.org/pypi/collective.js.datatables
es: Al igual que para muchas librerías Javascript, ya hay un paquete que hace la integración de Plone por nosotros: ``collective.js.datatables``. Al igual que todos los paquetes Python usted lo puede encontrar en PYPI: https://pypi.python.org/pypi/collective.js.datatables

source: We already added the addon to our buildout, you just have to activate it in our template.
es: Ya hemos añadido el complemento a nuestra buildout, sólo tienes que activarlo en nuestra plantilla.

source: We don't need the css-class ``listing`` anymore since it might clash with datatables (it does not but still...).
es: Nosotros no necesitamos la clase CSS ``listing`` nunca más, ya que podría entrar en conflicto con la librería datatables (no es así, pero aún así ...).

source: The documentation of datatables is beyond our training.
es: La documentación de la librería datatables está más allá de nuestro entrenamiento.

source: We use METAL again but this time to fill a different slot. The "javascript_head_slot" is part of the html's ``<head>``-area in Plone and can be extended this way. We could also just put the code inline but having nicely ordered html is a good practice.
es: Utilizamos METAL de nuevo pero esta vez para llenar un slot diferente. El "javascript_head_slot" es parte de área <head> del HTML en Plone y se puede ampliar de esta manera. También podríamos simplemente poner el código fuente en línea, pero con HTML muy bien ordenado es una buena práctica.

source: Let's test it: http://localhost:8080/Plone/talklistview
es: Hagamos una prueba con la siguiente dirección URL: http://localhost:8080/Plone/talklistview

source: We add the ``jquery.datatables.js`` file directly to the HEAD slot of the HTML without using Plone JavaScript registry (portal_javascript). By using the registry you could enable merging of js files and advanced caching. A GenericSetup profile is included in the collective.js.datatables package.
es: Añadimos el archivo ``jquery.datatables.js`` directamente a la ranura HEAD del HTML sin utilizar un registro en la herramienta Plone JavaScript registry (portal_javascript). Al utilizar el registro podría permitir la fusión de los archivos js y almacenamiento en caché avanzado. Un perfil GenericSetup está incluido en el paquete collective.js.datatables.

source: Summary
es: Resumen

source: We created a nice listing, that can be called at any place in the website.
es: Hemos creado un bonito listado, que se puede llamar en cualquier lugar en el sitio web.
