Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/views_1.po
Languages: es

source: Views I
es: Views - Parte I

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: A simple browser view
es: Una simple browser view

source: We need to add some boilerplate-code to be able to create a view. Before we write the talk-view itself we need to step back and talk *a little* about views and templates.
es: Tenemos que agregar un poco de código fuente repetitivo para poder crear una vista. Antes de que escribimos la vista de Charla en sí necesitamos dar un paso atrás y hablar *un poco* acerca de las vistas y plantillas.

source: A basic view in Plone is usually a ``BrowserView``. It can hold a lot of python-code but it can also be only a empty ``BrowserView``-class that renders a template when called. Such an empty class is what we create at first so we can concentrate on the template.
es: Una vista básica en Plone suele ser una ``BrowserView``. Ese puede contener una gran cantidad de código Python, pero también puede ser sólo una clase ``BrowserView`` vacía que hace una plantilla cuando se le llama. Tal clase vacía es lo que creamos en un primer momento para que podamos concentrarnos en la plantilla.

source: Add a new directory ``src/ploneconf.site/ploneconf/site/browser``. By convention the dir ``browser`` should hold all UI displayed in the browser.
es: Agregue un nuevo directorio ``src/ploneconf.site/ploneconf/site/browser``. Por convención el directorio ``browser`` debe contener todas las interfaz de usuario que se muestran en el navegador.

source: Add an empty file ``browser/__init__.py``
es: Agregar un archivo vacío ``browser/__init__.py``

source: We need to tell Plone to consider this directory. Modify the existing ``configure.zcml`` and add
es: Necesitamos decirle a Plone que considerar este directorio. Modifique el archivo ``configure.zcml`` existente y agregue el siguiente código fuente:

source: Then add a file ``browser/configure.zcml``:
es: Entonces agregue un archivo ``browser/configure.zcml``:

source: Add a file ``browser/views.py``::
es: Agregue un archivo ``browser/views.py``::

source: This might seem a lot of boilerplate if we only want to render a template but every bit of it can be changed to achieve different effects. It's not useless code but actually very powerful stuff. We only ignore it for now and concentrate on the template.
es: Esto puede parecer una gran cantidad de texto modelo si sólo queremos hacer una plantilla, pero cada poco de eso se puede cambiar para lograr diferentes efectos. No es un código inútil, pero actualmente las cosas realmente son muy poderosas. Nosotros sólo ignoramos por ahora y nos concentramos en la plantilla.

source: Add a directory ``browser/templates`` and add an file ``browser/templates/demoview.pt``
es: Agregar un directorio ``browser/templates`` y agregue un archivo ``browser/templates/demoview.pt``

source: Restart Plone and open http://localhost:8080/Plone/@@demoview.
es: Reiniciar Plone y abra en la direccion http://localhost:8080/Plone/@@demoview.

source: You should see "Hello World".
es: Usted podrá ver "Hello World".

source: We now have everything in place to learn about zope page templates.
es: Ahora tenemos todo en su lugar para aprender sobre las Zope Page Templates - ZPT.
