Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/viewlets_1.po
Languages: es

source: Writing Viewlets
es: Escribiendo Viewlets

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: A viewlet for the social behavior
es: Un viewlet para el comportamiento social

source: A viewlet is not a view but a snippet of html and logic that can be put in various places in the site. These places are called ``viewletmanager``.
es: Un viewlet no es una vista, pero es un fragmento de HTML y la lógica Python que se puede colocar en varios lugares en el sitio. Estos lugares se llaman ``ViewletManager``.

source: Inspect existing viewlets and their managers by going to http://localhost:8080/Plone/@@manage-viewlets.
es: Inspeccione y administre los viewlets existentes yendo a la dirección URL http://localhost:8080/Plone/@@manage-viewlets.

source: We already customized a viewlet (:file:`collophon.pt`). Now we add a new one.
es: Ya hemos personalizado un viewlet (el archivo :file:`collophon.pt`). Ahora agregamos un nuevo viewlet.

source: Viewlets don't save data (portlets do)
es: Los viewlets no guardan los datos (los portlets si lo hacen).

source: Viewlets have no user-interface (portlets do)
es: Los viewlets no tienen interfaz de usuario (los portlets lo hacen).

source: social-viewlet
es: El viewlet social-viewlet

source: Let's add a link to the site that uses the information that we collected using the social-behavior.
es: Vamos a añadir un enlace al sitio que utiliza la información que hemos recopilado utilizando el comportamiento social.

source: We register the viewlet in :file:`browser/configure.zcml`.
es: Registramos el viewlet en el archivo :file:`browser/configure.zcml`, agregando el siguiente código ZCML:

source: This registers a viewlet called ``social``. It is visible on all content that implements the interface ``ISocial`` from our behavior. It is also good practice to bind it to the `BrowserLayer`_ ``IPloneconfSiteLayer`` of our addon so it only shows up if our addon is actually installed.
es: Esto registra un viewlet llamado ``social``. Es visible en todos los contenidos que implementa la interfaz ``ISocial`` de nuestro comportamiento. También es una buena práctica de obligar a la `BrowserLayer`_ llamada ``IPloneconfSiteLayer`` de nuestro complemento para que sólo sea mostrado si nuestro complemento esta instalado en realidad.

source: The viewlet-class ``SocialViewlet`` is expected in a file ``browser/viewlets.py``.
es: La clase viewlet ``SocialViewlet`` se espera en un archivo ``browser/viewlets.py``, agregando el siguiente código Python:

source: This class does nothing except rendering the associated template (That we have to write yet)
es: Esta clase no hace nada excepto hacer que la plantilla asociada (Esa tenemos aún que escribirla)

source: If we used ``grok`` we would not need to register the viewlets in the ``configure.zcml`` but do that in python. We would add a file viewlets.py containing the viewlet-class.
es: Si utilizamos ``Grok`` no necesitaríamos registrar los viewlets en el archivo ``configure.zcml`` pero si hay que hacerlo en código Python. Nos gustaría añadir un archivo ``viewlets.py`` que contiene la clase viewlet, la cual se presenta a continuación:

source: This would do the same as the coe above using grok's paradigm of convention over configuration. In browser views the reference is called view, note that in grok viewlets it is called viewlets (in that case ``viewlet/lanyrd_link``).
es: Esto haría lo mismo que el código anterior utilizando el paradigma de ``Grok`` de la convención sobre la configuración. En las browser views la referencia es llamada ``view``, usted tenga en cuenta que en las viewlets Grok se llama ``viewlets`` (en ese caso ``viewlet/lanyrd_link``).

source: Let's add the missing template :file:`templates/social_viewlet.pt`.
es: Vamos a agregar el archivo de la plantilla restante :file:`templates/social_viewlet.pt`.

source: As you can see this is not a valid html document. That is not needed, because we don't want a complete view here, just a html snippet.
es: Como se puede ver esto no es un documento válido HTML. Eso no es necesario, porque no queremos una ``view`` completa aquí, sólo un fragmento de código HTML.

source: There is a tal define statement, querying for `view/lanyrd_link`. Like in page templates the template has access to its class.
es: Hay una sentencia ``tal:define``, para la consulta `view/lanyrd_link`. Al igual en la page templates de la plantilla tiene acceso a su clase.

source: We have to extend the Social Viewlet now to add the missing attribute:
es: Entonces, ahora tenemos que ampliar el Viewlet Social para añadir el atributo que le falta, agregando el siguiente código Python:

source: Why not to access context directly
es: ¿Por qué no acceder directamente contexto?

source: In this example, :samp:`ISocial(self.context)` does return the context directly. It is still good to use this idiom for two reasons:
es: En este ejemplo, :samp:`ISocial(self.context)` devuelve el contexto directamente. Todavía es bueno utilizar este idioma por dos razones:

source: It makes it clear, that we only want to use the ISocial aspect of the object
es: Se deja en claro, que sólo queremos usar el aspecto ISocial del objeto.

source: If we decide to use a factory, for example to store our attributes in an annotation, we would `not` get back our context, but the adapter.
es: Si decidimos utilizar una factory, por ejemplo, para almacenar nuestros atributos en una annotation, nosotros deberíamos `no` conseguir nuestro contexto, pero si el adaptador.

source: Therefore in this example you could simply write ``return self.context.lanyrd``.
es: Por lo tanto, en este ejemplo, usted puede simplemente escribir ``return self.context.lanyrd``.

source: So far, we
es: Hasta ahora, hemos hecho:

source: register the viewlet to content that has the ISocial Interface.
es: Registrar el viewlet al contenido que tiene la interfaz ISocial.

source: adapt the object to it's behavior to be able to access the fields of the behavior
es: Adaptar el objeto a su comportamiento para ser capaz de acceder a los campos del comportamiento.

source: return the link
es: Devolver el enlace.

source: Exercise 1
es: Ejercicio 1

source: Register a viewlet 'number_of_talks' in the footer that is only visible to admins (the permission you are looking for is ``cmf.ManagePortal``). Use only a template (no class) to display the number of talks already submitted. Hint: Use Aquisition to get the catalog (You know, you should not do this but there is plenty of code out there that does it...)
es: Registrar una viewlet ``number_of_talks`` en el pie de página que es visible sólo para los administradores del sitio (el permiso que usted busca es ``cmf.ManagePortal``). Utilice sólo una plantilla (sin clase) para mostrar el número de charlas ya enviadas. Sugerencia: Utilice Aquisition para obtener al catálogo (Usted sabe, no debe hacer esto, pero hay un montón de código por ahí que lo hace...)

source: Solution
es: Solución

source: Register the viewlet in :file:`browser/configure.zcml`
es: Registrar el viewlet en el archivo :file:`browser/configure.zcml`, agregando el siguiente código ZCML:

source: For the ``for`` and ``layer``-parameters ``*`` is shorthand for ``zope.interface.Interface`` and the same effect as omitting them: The viewlet will be shown for all types of pages and for all Plone sites within your Zope instance.
es: Para los parámetros ``for`` y ``layer`` el ``*`` es la abreviatura de ``zope.interface.Interface`` y el mismo efecto que la omisión de ellos: El viewlet se mostrará para todos los tipos de páginas y para todos los sitios de Plone en su instancia Zope.

source: Add the template :file:`browser/templates/number_of_talks.pt`:
es: Agregar el archivo de la plantilla :file:`browser/templates/number_of_talks.pt`, agregando el siguiente código HTML:

source: ``python:context.portal_catalog`` will return the catalog through Acquisition. Be carefull if you want to use path-expressions: ``content/portal_catalog`` calls the catalog (and returns all brains). You need to prevent this by using ``nocall:content/portal_catalog``.
es: ``python:context.portal_catalog`` devolverá el catálogo a través de la adquisición. Tenga cuidado si usted desea usar expresiones de rutas: ``content/portal_catalog`` llama el catálogo (y devuelve todos los cerebros). Es necesario para evitar esto usando ``nocall:content/portal_catalog``.

source: Relying on Acquisition is a bad idea. It would be much better to use the helper view ``plone_tools`` from ``plone/app/layout/globals/tools.py`` to get the catalog.
es: Basándose en Adquisición es una mala idea. Sería mucho mejor utilizar la helper view llamada ``plone_tools`` desde el módulo ``plone/app/layout/globals/tools.py`` para obtener el catálogo.

source: ``context/@@plone_tools/catalog`` traverses to the view ``plone_tools`` and calls it's method ``catalog``. In python it would look like this:
es: ``context/@@plone_tools/catalog`` atraviesa a la vista ``plone_tools`` y llama a su método ``catalog``. En expresiones Python debería verse así:

source: It is not a good practice to query the catalog within a template since even simple logic like this should live in Python. But it is very powerful if you are debugging or need a quick and dirty solution.
es: No es una buena práctica consultar el catálogo dentro de una plantilla, ya que incluso la simple lógica como esta debería vivir en Python. Pero es muy poderoso si está depurando o necesita una solución rápida y sucia.

source: Exercise 2
es: Ejercicio 2

source: Register a viewlet 'days_to_conference' in the header. Use a class and a template to display the number of days until the conference. You get many bonus-points if you display it in a nice format (think "In 2 days" and "Last Month") by using an existing javascript or python library.
es: Registrar una viewlet ``days_to_conference`` en la cabecera. Utilice una clase y una plantilla para mostrar el número de días hasta la conferencia. Usted consigue muchos puntos de bonificación si se muestra en un formato agradable (pensar "En 2 días" y "Último mes") utilizando un Javascript existentes o biblioteca Python.
