Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/views_2.po
Languages: es

source: Views II: A default view for "talk"
es: Vistas - Parte II: Una vista por defecto para la "charla"

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: View-Classes
es: Vista de clases

source: Earlier we wrote a demo view which we also used to experiment with page templates. Let us have a look at the zcml and the Page Template again. I have extended the code just slightly.
es: Anteriormente hemos escrito una vista de demostración que también utilizamos para experimentar con las plantillas de página. Vamos a echar un vistazo a la ZCML y la Page Template de nuevo. Yo he ampliado el código sólo un poco.

source: ``browser/configure.zcml``
es: El archivo ``browser/configure.zcml``

source: ``browser/views.py``
es: El archivo ``browser/views.py``

source: Do you remember the term MultiAdapter? The browser page is just a MultiAdapter. The ZCML statement ``browser:page`` registers a MultiAdapter and adds additional things needed for a browser view.
es: ¿Recuerdas el término MultiAdapter? La browser page es sólo un MultiAdapter. La declaración ZCML ``browser:page`` registra un MultiAdapter y agrega cosas adicionales que se necesitan para una browser view.

source: An adapter adapts things, a MultiAdapter adapts multiple things.
es: Un adaptador adapta cosas, un MultiAdapter adapta múltiple cosas.

source: When you enter an url, Zope tries to find an object for it. At the end, when Zope does not find any more objects but there is still a path item left, or there are no more path items, Zope looks for an adapter that will reply to the request.
es: Al introducir una dirección URL, Zope trata de encontrar un objeto para él. Al final, cuando Zope no encuentra ningún objeto más, pero todavía hay un elemento de ruta, o no hay más elementos de rutas, Zope busca un adaptador que va a responder a la solicitud.

source: The adapter adapts the request and the object that Zope found with the URL. The adapter class gets instantiated with the objects to be adapted, then it gets called.
es: El adaptador se adapta la solicitud y el objeto que Zope ha encontrado con la dirección URL. La clase de adaptador se crea instanciada con los objetos que han de adaptarse, entonces se llama.

source: The code above does the same thing that the standard implementation would do. It makes context and request available as variables on the object.
es: El código fuente anterior hace la misma cosa que la implementación estándar haría. Hace que el contexto y la solicitud estén disponibles como variables en el objeto.

source: I have written down these methods because it important to understand some important concepts.
es: Yo he escrito estos métodos porque es importante entender algunos conceptos importantes.

source: The init method gets called while Zope is still *trying* to find a view. At that phase, the security has not been resolved. Your code is not security checked. For historic reasons, many errors that happen in the init method can result in a page not found error instead of an exception.
es: El método init es llamado mientras Zope es todavía esta *tratando* de encontrar una vista. En esa fase, la seguridad no se ha resuelto. El código no comprueba la seguridad. Por razones históricas, muchos errores que se producen en el método init puede resultar en una página no encuentre el error en lugar de una excepción.

source: Don't do much at all in the init method. Instead you have the guarantee that the call method is called before anything else (except the init method). It has the security checks in place and so on.
es: No hagas mucho a todos en el método init. En su lugar usted tiene la garantía que el método call es llamado antes de cualquier otra cosa (excepto el método init). Tiene los controles de seguridad en su lugar y así sucesivamente.

source: From a practical standpoint, consider the call method your init method, the biggest difference is that this method is supposed to return the html already. Let your base class handle the html generation.
es: Desde un punto de vista práctico, considere el método call en su método init, la mayor diferencia es que este método debe retornar el HTML listo. Deje a su clase base manejar la generación de HTML.

source: The default-view
es: La vista por defecto

source: Now we finally add the default-view for talks in views.py
es: Ahora nosotros finalmente agregamos la vista por defecto para las charlas en views.py

source: The DefaultView base class in plone.dexterity only exists for Dextertity-Objects and has some very useful available to the template:
es: La clase base DefaultView en el paquete plone.dexterity solamente existe para los Objetos Dextertity y tiene algo de gran utilidad a disposición de la plantilla:

source: view.w is a dictionary of all the display widgets, keyed by field names. This includes widgets from alternative fieldsets.
es: view.w es un diccionario de todos los widgets de pantalla, con clave de nombres de campos. Esto incluye widgets de conjunto de campos alternativos.

source: view.widgets contains a list of widgets in schema order for the default fieldset.
es: view.widgets contiene una lista de widgets en esquema de ordenar para el conjunto de campos predeterminado.

source: view.groups contains a list of fieldsets in fieldset order.
es: view.groups contiene una lista de conjunto de campos con el fin de ordenar conjunto de campo.

source: view.fieldsets contains a dict mapping fieldset name to fieldset
es: view.fieldsets contiene un nombre de conjunto de campo mapeado un diccionario a conjunto de campo

source: On a fieldset (group), you can access a widgets list to get widgets in that fieldset
es: En un conjunto de campos (grupo), puede acceder a una lista de widgets para obtener los widgets en ese conjunto de campo

source: ``plone.dexterity.browser.view.DefaultView`` has the same features as the grok-equivalent ``plone.directives.dexterity.DisplayForm``.
es: La vista ``plone.dexterity.browser.view.DefaultView`` tiene las mismas características que el equivalente Grok ``plone.directives.dexterity.DisplayForm``.

source: The template ``templates/talkview.pt`` uses the pattern ``view/w/<fieldname>/render`` to render some widgets.
es: La plantilla ``templates/talkview.pt`` usa el patrón ``view/w/<fieldname>/render`` para hacer algunos widgets.

source: After a restart, we can test our view by going to a talk and add /talkview to the url.
es: Después de un reinicio, podemos probar nuestra vista, yendo a un tipo de contenido talk agregado y agrégale a la dirección URL /talkview.

source: We should tell Plone, that the talkview should be used as the default view for talks instead of the built-in view.
es: Debemos decirle a Plone, que la vista talkview debe ser utilizado como la vista predeterminada para las charlas en lugar de la vista incorporada.

source: This is a configuration that you can change during runtime and is stored in the database, as such it is also managed by GenericSetup profiles.
es: Esta es una configuración que puede cambiar en tiempo de ejecución y se almacena en la base de datos, como tal, también es gestionado por perfiles GenericSetup.

source: To change it ttw got to the ZMI (http://localhost:8080/Plone/manage), go to ``portal_types`` and select the type for which the new should be selectable (*talk*). Now add ``talkview`` to the list *Available view methods*. Now the new view is available in the menu *Display*. To make it the default view enter it in ``Default view method``.
es: Para cambiarlo a través de la Web valla a la ZMI (http://localhost:8080/Plone/manage), luego vaya a la herramienta ``portal_types`` y seleccione el tipo para el cual el nuevo tipo de contenido debe ser seleccionable (*talk*). Ahora agregue ``talkview`` a la lista *Available view methods*. Ahora la nueva vista está disponible en el menú *Mostrar*. Para que sea la vista predeterminada ingrese esta vista en la sección ``Default view method``.

source: open ``profiles/default/types/talk.xml``:
es: Abra el archivo ``profiles/default/types/talk.xml``:

source: We will have to either reinstall our addon or run the generic-setup step ``typeinfo`` so Plone learns about the change.
es: Vamos a tener que reinstalar nuestro complemento o ejecutar el paso GenericSetup llamado ``typeinfo`` entonces Plone aprende sobre el cambio.

source: We could also tell plone about this in the ZMI: http://localhost:8080/Plone/portal_types/talk/manage_propertiesForm
es: También podríamos decirle a Plone sobre esto en el ZMI: http://localhost:8080/Plone/portal_types/talk/manage_propertiesForm

source: Let's improve the talkview to show all the info we want.
es: Mejoremos la vista talkview para mostrar toda la información que queremos.

source: ``templates/talkview.pt``:
es: El archivo ``templates/talkview.pt``:

source: Exercise
es: Ejercicio

source: Add the new field "room" to the Talk type (TTW) and display it below Audience in the browser view, it should contain the following data:
es: Agregar el nuevo campo "room" con el tipo de contenido Talk (a través de la Web) y mostrarlo debajo del campo Audience en la browser view, debe contener los siguientes datos:

source: Title: Room
es: Título: Room

source: Possible values: Room 101, Room 102, Auditorium
es: Posible valores: Room 101, Room 102, Auditorium

source: Solution
es: Solución

source: Go to http://localhost:8080/Plone/dexterity-types/talk/@@fields and add the new fields
es: Valla a la dirección URL http://localhost:8080/Plone/dexterity-types/talk/@@fields y agregue los nuevos campos

source: Add the new HTML below the audience part:
es: Agregar el nuevo HTML siguiente en la parte de audiencia:
