Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/viewlets_2.po
Languages: es

source: A viewlet for the voteable behavior
es: Un viewlet para el comportamiento de votaciones

source: Voting Viewlet
es: Viewlet de Votaciones

source: Viewlet for IVoteable
es: El viewlet para la interfaz IVoteable.

source: the viewlet-template
es: La plantilla del viewlet.

source: add jquery include statements
es: Agregar jQuery incluyen declaraciones.

source: saving the vote on the object using annotations
es: Guardar el voto en el objeto usando anotaciones.

source: Earlier we added the logic that saves votes on the objects. We now create the user interface for it.
es: Anteriormente hemos agregado la lógica que salva los votos en los objetos. Nosotros ahora podemos crear la interfaz de usuario para esto.

source: Since we want to use the UI on more than one page (not only the talk-view but also the talk-listing) we need to put it somewhere.
es: Puesto que queremos utilizar la interfaz de usuario en más de una página (no sólo la vista ``talk-view`` sino también la vista ``talk-listing``) debemos ponerla en alguna parte.

source: To handle the user-input we don't use a form but links and ajax.
es: Para manejar el ingreso de datos del usuario nosotros no usamos un formulario pero si links y ajax.

source: The voting itself is a fact handled by another view
es: La votación en si, es en su efecto manejada por otra vista.

source: We register the viewlet in :file:`browser/configure.zcml`.
es: Registramos el viewlet en el archivo :file:`browser/configure.zcml`, agregando el siguiente código ZCML:

source: We extend the file :file:`browser/viewlets.py`
es: Nosotros extendemos en el archivo :file:`browser/viewlets.py`, agregando el siguiente código Python:

source: This will add a viewlet to a slot below the title and expect a template :file:`voting_viewlet.pt` in a folder :file:`browser/templates`.
es: Esto agregará un ``viewlet`` a una ranura debajo del título y esperará una plantilla :file:`voting_viewlet.pt` en una carpeta :file:`browser/templates`.

source: Let's create the file :file:`browser/templates/voting_viewlet.pt` without any logic
es: Vamos a agregar el archivo de la plantilla :file:`templates/social_viewlet.pt` sin ninguna lógica.

source: restart Plone
es: Reinicie Plone.

source: show the viewlet
es: Muestre el viewlet.

source: Writing the Viewlet code
es: Escribiendo el código del Viewlet

source: Update the viewlet to contain the necessary logic in :file:`browser/viewlets`
es: Actualizar en la clase ``viewlet`` que contiene la lógica necesaria en el archivo :file:`browser/viewlets.py`, con el siguiente código Python:

source: The template
es: La plantilla

source: And extend the template in :file:`browser/templates/voting_viewlet.pt`
es: Y extiende la plantilla en el archivo :file:`browser/templates/voting_viewlet.pt`, con el siguiente código ZPT:

source: We have many small parts, most of which will be hidden by javascript unless needed. By providing all these status information in HTML, we can use standard translation tools to translate. Translating strings in javascript requires extra work.
es: Tenemos muchas piezas pequeñas, la mayoría de las cuales serán ocultadas por javascript a menos que sea necesario. Al proporcionar toda esta información de estado en HTML, podemos utilizar herramientas de traducción estándar para traducir. Traducir cadenas en javascript requiere trabajo adicional.

source: We need some css that we store in :file:`static/starzel_votablebehavior.css`
es: Nosotros necesitamos algunos sentencias CSS que almacenaremos en el archivo :file:`static/starzel_votablebehavior.css`, con el siguiente código CSS:

source: The javascript code
es: El código javascript

source: To make it work in the browser, some javascript :file:`static/starzel_votablebehavior.js`
es: Para que funcione en el navegador, algunas sentencias Javascript en el archivo :file:`static/starzel_votablebehavior.js`, con el siguiente código Javascript:

source: This js-code adheres to crockfort jshint rules, so all variables are declared at the beginning of the method. We show and hide quite a few small html elements here
es: Este código Javascript se adhiere a las reglas ``jshint`` de crockfort, por lo que todas las variables se declaran al principio del método. Mostramos y ocultamos bastantes pequeños elementos html aquí.

source: Writing 2 simple view helpers
es: Escribiendo 2 simples helpers view

source: Our javascript code communicates with our site by calling views that don't exist yet. These Views do not need to render html, but should return a valid status. Exceptions set the right status and aren't being shown by javascript, so this will suit us fine.
es: Nuestro código Javascript se comunica con nuestro sitio llamando a las vistas que aún no existen. Estas vistas no necesitan mostrar código html, pero deben devolver un estatus válido. Las excepciones establecen el estado correcto y no están siendo mostradas por Javascript, por lo que nos conviene bien.

source: As you might remember, the :samp:`vote` method might return an exception, if somebody votes twice. We do not catch this exception. The user will never see this exception.
es: Como puede recordar, el método :samp:`vote` puede devolver una excepción, si alguien vota dos veces. No capturamos esta excepción. El usuario nunca verá esta excepción.

source: Catching exceptions contain a gotcha for new developers.
es: La captura de excepciones contiene un comportamiento contra-intuitivo para los nuevos desarrolladores.

source: Zope claims some exceptions for themselves. It needs them to work correctly.
es: Zope reclama algunas excepciones para sí mismos. Eso necesita que funcionen correctamente.

source: For example, if two requests try to modify something at the same time, one request will throw an exception, a :samp:`ConflictError`.
es: Por ejemplo, si dos solicitudes intentan modificar algo al mismo tiempo, una solicitud lanzará una excepción, a :samp:`ConflictError`.

source: Zope catches the exception, waits for a random amount of time, and tries to process the request again, up to three times. If you catch that exception, you are in trouble, so don't do that. Ever.
es: Zope captura la excepción, espera una cantidad de tiempo aleatoria e intenta procesar la solicitud nuevamente, hasta tres veces. Si capturas esa excepción, estás en problemas, así que no lo hagas. Nunca.

source: As so often, we must extend :file:`browser/configure.zcml`:
es: Como tantas veces, debemos extender en el archivo :file:`browser/configure.zcml`, agregando el siguiente código ZCML:

source: Then we add our simple views into the file :file:`browser/vote.py`
es: A continuación, agregamos nuestras vistas simples en el archivo :file:`browser/vote.py`, con el siguiente código Python:

source: A lot of moving parts have been created. Here is a small overview:
es: Se han creado muchas partes móviles. Aquí hay un pequeño resumen:
