Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/workflow.po
Languages: es

source: A ``policy`` is basically just a mapping of workflows to content types. Like what you see in :menuselection:`ZMI -> portal_workflow -> workflows`
es: Una ``política`` es básicamente una asignación de flujos de trabajo a tipos de contenido. Como lo que ves en :menuselection:`ZMI -> portal_workflow -> workflows`

source: This policy can control workflow ''in'' the object where it is located, and *below* it
es: Esta política puede controlar el flujo de trabajo ``en`` el objeto donde se encuentra y *debajo* de él

source: *In* means the policy applies to the object itself and its content.
es: *En* significa que la política se aplica al objeto en sí y a su contenido.

source: *Below* means that the policy applies only to any contained items (and their contents as well), but not to the original object.
es: *Abajo* significa que la política se aplica solo a los elementos contenidos (y también a su contenido), pero no al objeto original.

source: All this can be handled by GenericSetup as well
es: Todo esto también puede ser manejado por GenericSetup

source: ``portal_placeful_workflow.xml`` allows you to declare the presence of policies
es: ``portal_placeful_workflow.xml`` le permite declarar la presencia de políticas

source: This is accompanied by a folder of the same name (minus the 'xml' part, of course)
es: Esto va acompañado de una carpeta con el mismo nombre (menos la parte 'xml', por supuesto)

source: The folder contains one file per policy: ``policy_name.xml`` where *policy_name* is replaced by the actual name of your policy
es: La carpeta contiene un archivo por política: ``policy_name.xml`` donde *policy_name* se reemplaza por el nombre real de su política

source: Once you've generated a policy, you can add an 'import step' in GenericSetup to use it somewhere (this must be done in code)
es: Una vez que haya generado una política, puede añadir un 'paso de importación' en GenericSetup para usarla en algún lugar (esto debe hacerse en el código)

source: the setup:
es: la configuración:

source: Basic Roles and Permissions
es: Roles y permisos básicos

source: Roles, groups, permissions, workflows, states, transitions are all a part of Plone's robust security model. But you don't have to be a guru to understand the basic Plone permissions you will encounter on a daily basis.
es: Los roles, los grupos, los permisos, los flujos de trabajo, los estados y las transiciones forman parte del sólido modelo de seguridad de Plone. Pero no tienes que ser un gurú para entender los permisos básicos de Plone que encontrarás a diario.

source: Definitions
es: Definiciones

source: Let's start off with some basic terminology. Permissions are individual rights that give the user the ability to perform an action. Roles are a combination of permissions. Both users and groups can be assigned roles.
es: Comencemos con una terminología básica. Los permisos son derechos individuales que otorgan al usuario la capacidad de realizar una acción. Los roles son una combinación de permisos. Tanto a los usuarios como a los grupos se les pueden asignar roles.

source: Roles are a combination of permissions that you will assign to your users. Plone comes with a basic set of roles, each of which already has certain permissions assigned. Below you will learn a little bit about the defaults for each role.
es: Los roles son una combinación de permisos que asignará a los usuarios. Plone viene con un conjunto básico de roles, cada uno de los cuales ya tiene ciertos permisos asignados. A continuación, aprenderá un poco sobre los valores predeterminados para cada rol.

source: Most of your site users have the "Member" role. By default, a Member can see anything that is published, see the contents of a folder, see a list of other portal members and groups, and see portlets. Depending on how your site is customized, Members may not have access to certain portlets or specific parts of the site. I keep track of what a Member has access to by reminding myself that a Member cannot change content and can only see what has been published. You will want to assign the Member role to your every day, normal users who will not be changing content.
es: La mayoría de los usuarios de su sitio tienen el rol de "Miembro". De forma predeterminada, un miembro puede ver todo lo que se publica, ver el contenido de una carpeta, ver una lista de otros miembros y grupos del portal y ver portlets. Dependiendo de cómo esté personalizado su sitio, es posible que los miembros no tengan acceso a ciertos portlets o partes específicas del sitio. Hago un seguimiento de lo que un miembro tiene acceso recordándome a mí mismo que un miembro no puede cambiar el contenido y solo puede ver lo que se ha publicado. Querrá asignar el rol de miembro a sus usuarios normales todos los días que no cambiarán el contenido.

source: Everyone who joins your site should be assigned this role.
es: A todos los que se unan a tu sitio se les debe asignar este rol.

source: Reader
es: Lector

source: The Reader role may be almost the opposite from the Member role. Readers can view content items that are in the private state, but cannot make any changes. You should assign people the Reader role when you want them to review a piece of content that is not yet published.
es: El rol Lector puede ser casi el opuesto del rol de miembro. Los lectores pueden ver los elementos de contenido que están en estado privado, pero no pueden realizar ningún cambio. Debes asignar a las personas el rol de lector cuando quieras que revisen un contenido que aún no se ha publicado.

source: The Reader role is great for when you want only certain people to see a piece of content. You can also use the Reader role as part of a document review cycle for users who would like to review your document but not make changes to the document.
es: El rol Lector es ideal para cuando quieres que solo ciertas personas vean un fragmento de contenido. También puede utilizar el rol de lector como parte de un ciclo de revisión de documentos para los usuarios que deseen revisar el documento, pero no realizar cambios en el documento.

source: Contributor
es: Colaborador

source: A user with a Contributor role can do all the things a member can, plus add content, use version control, and view content that is not in the published state. A contributor cannot modify (edit) another user's content. The Contributor role should be given to users who will create content but not edit another person's content.
es: Un usuario con un rol de colaborador puede hacer todo lo que puede hacer un miembro, además de añadir contenido, usar el control de versiones y ver el contenido que no está en el estado publicado. Un colaborador no puede modificar (editar) el contenido de otro usuario. El rol de colaborador debe asignarse a los usuarios que crearán contenido pero no editarán el contenido de otra persona.

source: Owner
es: Propietario

source: The owner role is inherited when a user adds a piece of content. You have to have another role, like Contributor, that has the ability to add content. Once you add a piece of content, you are automatically assigned the Owner role over this content. When you are the Owner of a piece of content, you can modify that piece of content whenever you wish, no matter what state the content is in.
es: El rol de propietario se hereda cuando un usuario añada un fragmento de contenido. Tienes que tener otro rol, como Colaborador, que tenga la capacidad de añadir contenido. Una vez que añada un fragmento de contenido, se le asignará automáticamente el rol de propietario sobre este contenido. Cuando eres el propietario de un fragmento de contenido, puedes modificar ese fragmento de contenido cuando lo desees, sin importar el estado en el que se encuentre el contenido.

source: A user with the Editor role by default does not have the ability to add content, but can modify(edit) content and use version control. An Editor can also manage properties of content and can submit content for publication. The Editor role should be used when a Contributor is sending a piece of content for review.
es: Un usuario con el rol Editor de forma por defecto no tiene la capacidad de añadir contenido, pero puede modificar (editar) contenido y usar el control de versiones. Un editor también puede administrar las propiedades del contenido y puede enviar contenido para su publicación. El rol de editor debe usarse cuando un colaborador envía un fragmento de contenido para su revisión.

source: The Editor will review, and change, the content and then submit it for publication.
es: El rol Editor revisará y cambiará el contenido y luego lo enviará para su publicación.

source: Reviewer
es: Revisor

source: A Reviewer role picks up where the Editor leaves off. While a Reviewer does not have as many rights as the Editor, the Reviewer can publish content that has been sent to the submit for publication state or send it back to the owner. The Reviewer also has a special portlet just for content that needs to be reviewed.
es: Un rol Revisor continúa donde lo deja el editor. Si bien un revisor no tiene tantos derechos como el editor, el revisor puede publicar contenido que se haya enviado al estado de envío para publicación o devolverlo al propietario. El revisor también tiene un portlet especial solo para el contenido que necesita ser revisado.

source: Once an Editor has submitted content for publication, the Reviewer will review the content and then has the option to Publish or send back the content for the Contributor to review.
es: Una vez que un rol Editor ha enviado el contenido para su publicación, el revisor revisará el contenido y luego tiene la opción de publicar o devolver el contenido para que el colaborador lo revise.

source: The Reviewer has the final say if something gets published or not.
es: El rol Revisor tiene la última palabra si algo se publica o no.

source: Site Administrator
es: Administrador del Sitio

source: The Site Administrator role is very similar to the Manager role described below, but with a few exceptions. The Site Administrator has full access to manage all of the content in the portal, and can perform certain actions from the site setup such as adding and removing users.
es: El rol Administrador del sitio es muy similar al rol de administrador que se describe a continuación, pero con algunas excepciones. El rol Administrador del sitio tiene acceso completo para administrar todo el contenido del portal y puede realizar ciertas acciones desde la configuración del sitio, como añadir y eliminar usuarios.

source: They do not have access to the ZMI or to actions such as activating Plone add-ons, configuring caching or discussion settings.
es: No tienen acceso a la ZMI ni a acciones como la activación de complementos de Plone, la configuración del almacenamiento en caché o los ajustes de discusión.

source: Manager
es: Administrador

source: The Manager role is the role that can do everything. A user with the Manager role is a Site Administrator. Manager privileges are not given out lightly as this role can add, delete, and make changes to any thing in the site.
es: El rol Administrador es el rol que puede hacer todo. Un usuario con el rol de Administrador es un Administrador del sitio. Los privilegios de administrador no se otorgan a la ligera, ya que este rol puede añadir, eliminar y realizar cambios en cualquier cosa del sitio.

source: While more than one person should have this role, it definitely should not be handed out to large numbers of people. Your site Manger has access to the control panel, where many site wide settings can be changed and updated.
es: Si bien más de una persona debe tener este rol, definitivamente no debe entregarse a un gran número de personas. El rol Administrador de su sitio tiene acceso al panel de control, donde se pueden cambiar y actualizar muchas configuraciones de todo el sitio.

source: The Manager can also manage things via the :term:`ZMI` (Zope Management Interface).
es: El rol Administrador también puede administrar cosas a través de :term:`ZMI` (Interfaz de administración de Zope).

source: Giving Out Permissions
es: Otorgamiento de permisos

source: The easiest way to hand out permissions is to assign roles to groups. You can create a group and assign that group a role.
es: La forma más fácil de otorgar permisos es asignar roles a grupos. Puede crear un grupo y asignarle un rol.

source: Then, whenever you want to give someone certain permissions, you can add that user to that group. Assigning roles on a group level allows you to more easily manage large numbers of users.
es: Luego, cada vez que desee otorgar a alguien ciertos permisos, puede añadir ese usuario a ese grupo. La asignación de roles a nivel de grupo le permite administrar más fácilmente un gran número de usuarios.

source: Permissions
es: Permisos

source: Plone's security system is based on the concept of *permissions* protecting *operations* (like accessing a view, viewing a field, modifying a field, or adding a type of content) that are granted to *roles*, which in turn are granted to *users* and/or *groups*.
es: El sistema de seguridad de Plone se basa en el concepto de *permisos* que protegen *operaciones* (como acceder a una vista, ver un campo, modificar un campo o añadir un tipo de contenido) que se otorgan a *roles*, que a su vez se otorgan a *usuarios* y/o *grupos*.

source: In the context of developing content types, permissions are typically used in three different ways:
es: En el contexto del desarrollo de tipos de contenido, los permisos se suelen usar de tres maneras diferentes:

source: A content type or group of related content types often has a custom *add permission* which controls who can add this type of content.
es: Un tipo de contenido o un grupo de tipos de contenido relacionados suele tener un *permiso de adición* personalizado que controla quién puede añadir este tipo de contenido.

source: Views (including forms) are sometimes protected by custom permissions.
es: Las vistas (incluidos los formularios) a veces están protegidas por permisos personalizados.

source: Individual fields are sometimes protected by permissions, so that some users can view and edit fields that others can't see.
es: Los campos individuales a veces están protegidos por permisos, de modo que algunos usuarios pueden ver y editar campos que otros no pueden ver.

source: It is not hard to create new permissions.
es: No es difícil crear nuevos permisos.

source: Be aware that it is considered good practice to use the standard permissions wherever possible and use *workflow* to control which roles are granted these permissions on a per-instance basis.
es: Tenga en cuenta que se considera una buena práctica utilizar los permisos estándar siempre que sea posible y utilizar *workflow* para controlar a qué roles se les conceden estos permisos por instancia.

source: Standard Permissions
es: Permisos estándar

source: Many of the standard permissions can be found in ``Product.CMFCore``\'s ``permissions.zcml`` (``parts/omelette/Products/CMFCore/permissions.zcml``).
es: Muchos de los permisos estándar se pueden encontrar en el archivo ``permissions.zcml`` de ``Product.CMFCore`` (``parts/omelette/Products/CMFCore/permissions.zcml``).

source: Here, you will find a short ``id`` (also known as the *Zope 3 permission id*) and a longer ``title`` (also known as the *Zope 2 permission title*).
es: Aquí, encontrará un ``id`` corto (también conocido como el *ID de permiso de Zope 3*) y un ``título`` más largo (también conocido como el *título de permiso de Zope 2*).

source: For historical reasons, some areas in Plone use the id, whilst others use the title.
es: Por razones históricas, algunas áreas de Plone usan el id, mientras que otras usan el título.

source: As a rule of thumb:
es: Como regla general:

source: Browser views defined in ZCML use the Zope 3 permission id.
es: Las vistas de explorador definidas en ZCML utilizan el identificador de permiso de Zope 3.

source: Security checks using ``zope.security.checkPermission()`` use the Zope 3 permission id
es: Las comprobaciones de seguridad mediante ``zope.security.checkPermission()`` utilizan el id de permiso de Zope 3

source: Dexterity's ``add_permission`` FTI variable uses the Zope 3 permission id.
es: La variable FTI ``add_permission`` de Dexterity utiliza el id de permiso de Zope 3.

source: The ``rolemap.xml`` GenericSetup handler and workflows use the Zope 2 permission title.
es: El controlador y los flujos de trabajo GenericSetup ``rolemap.xml`` usan el título de permiso Zope 2.

source: Security checks using ``AccessControl``’s ``getSecurityManager().checkPermission()``, including the methods on the ``portal_membership`` tool, use the Zope 2 permission title.
es: Las comprobaciones de seguridad que utilizan ``getSecurityManager().checkPermission()`` de ``AccessControl``, incluidos los métodos de la herramienta ``portal_membership``, utilizan el título de permiso de Zope 2.

source: The most commonly used permission are shown below.
es: A continuación se muestran los permisos más utilizados.

source: The Zope 2 permission title is shown in parentheses.
es: El título del permiso Zope 2 se muestra entre paréntesis.

source: used to control access to the standard view of a content item;
es: se utiliza para controlar el acceso a la vista estándar de un elemento de contenido;

source: used to control the ability to delete child objects in a container;
es: se usa para controlar la capacidad de eliminar objetos secundarios en un contenedor;

source: used to control write access to content items;
es: se usa para controlar el acceso de escritura a los elementos de contenido;

source: used to control access to management screens;
es: se utiliza para controlar el acceso a las pantallas de gestión;

source: the standard add permission required to add content to a folder;
es: el permiso de adición estándar requerido para añadir contenido a una carpeta;

source: used to allow users to set their own member properties'
es: se utiliza para permitir que los usuarios establezcan sus propias propiedades de miembro.

source: typically used as a workflow transition guard to allow users to submit content for review;
es: normalmente se utiliza como protección de transición del flujo de trabajo para permitir que los usuarios envíen contenido para su revisión;

source: usually granted to the ``Reviewer`` role, controlling the ability to publish or reject content.
es: generalmente se otorga al rol de ``Revisor``, que controla la capacidad de publicar o rechazar contenido.

source: usually granted to the ``Site Administrator`` and ``Manager`` role, controlling the ability to add new users into the site. It is also granted to the ``Anonymous`` role if you have enabled self user registration.
es: generalmente se otorga al rol de ``Administrador del sitio`` y ``Gerente``, controlando la capacidad de añadir nuevos usuarios al sitio. También se concede al rol ``Anónimo`` si ha habilitado el registro de usuario propio.

source: Here is an example of how Permissions can be changed by event subscribers:
es: A continuación, se muestra un ejemplo de cómo los suscriptores del evento pueden cambiar los permisos:

source: Inside of `Products.CMFPlone` there is an event subscriber listening for changes to specific registry keys and will alter the permissions in the site based on the change in the setting.
es: Dentro de `Products.CMFPlone` hay un suscriptor de eventos que escucha los cambios en claves de registro específicas y modificará los permisos en el sitio en función del cambio en la configuración.

source: Multi-chain Workflows
es: Flujos de trabajo multicadena

source: Multiple workflows can be very useful in case you have concurrent processes.
es: Múltiples flujos de trabajo pueden ser muy útiles en caso de que tenga procesos simultáneos.

source: For example, an object may be published, but require translation.
es: Por ejemplo, un objeto puede estar publicado, pero requerir traducción.

source: You can track the review state in the main workflow and the translation state in another.
es: Puede realizar un seguimiento del estado de revisión en el flujo de trabajo principal y del estado de traducción en otro.

source: If you index the state variable for the second workflow in the catalog (the state variable is always available on the indexable object wrapper you only need to add an index with the appropriate name to ``portal_catalog``) you can search for all objects pending translation, for example using a *Collection*.
es: Si indexa la variable de estado para el segundo flujo de trabajo en el catálogo (la variable de estado siempre está disponible en el contenedor de objetos indexables, solo necesita añadir un índice con el nombre apropiado a ``portal_catalog``), puede buscar todos los objetos pendientes de traducción, por ejemplo, utilizando una *Collection*.

source: Workflows are mapped to types via the ``portal_workflow`` tool. There is a default workflow, indicated by the string ``(Default)``. Some types have no workflow, which means that they hold no state information and typically inherit permissions from their parent.
es: Los flujos de trabajo se asignan a los tipos a través de la herramienta ``portal_workflow``. Hay un flujo de trabajo predeterminado, indicado por la cadena ``(Default)``. Algunos tipos no tienen flujo de trabajo, lo que significa que no contienen información de estado y, por lo general, heredan permisos de su elemento primario.

source: It is also possible for types to have *multiple workflows*. You can list multiple workflows by separating their names by commas.
es: También es posible que los tipos tengan *varios flujos de trabajo*. Puede enumerar varios flujos de trabajo separando sus nombres por comas.

source: This is called a *workflow chain*.
es: A esto se le llama *cadena de flujo de trabajo*.

source: In Plone, the workflow chain of an object is looked up by multi-adapting the object and the workflow to the ``IWorkflowChain`` interface.
es: En Plone, la cadena de flujo de trabajo de un objeto se busca mediante la adaptación múltiple del objeto y el flujo de trabajo a la interfaz ``IWorkflowChain``.

source: The adapter factory should return a tuple of string workflow names (``IWorkflowChain`` is a specialisation of ``IReadSequence``, i.e. a tuple).
es: La fábrica de adaptadores debe devolver una tupla de nombres de flujo de trabajo de cadenas (``IWorkflowChain`` es una especialización de ``IReadSequence``, es decir, una tupla).

source: The default looks at the mappings in the ``portal_workflow`` tool, but it is possible to override the mapping, e.g. by using a custom adapter registered for some marker interface, which in turn could be provided by a type-specific behavior.
es: El valor por defecto mira las asignaciones en la herramienta ``portal_workflow``, pero es posible anular la asignación, por ejemplo, mediante el uso de un adaptador personalizado registrado para alguna interfaz de marcador, que a su vez podría ser proporcionada por un comportamiento específico del tipo.

source: Multiple workflows applied in a single chain co-exist in time.
es: Múltiples flujos de trabajo aplicados en una sola cadena coexisten en el tiempo.

source: Typically, you need each workflow in the chain to have a different state variable name. The standard ``portal_workflow`` API (in particular, ``doActionFor()``, which is used to change the state of an object) also assumes the transition ids are unique.
es: Normalmente, necesita que cada flujo de trabajo de la cadena tenga un nombre de variable de estado diferente. La API estándar ``portal_workflow`` (en particular, ``doActionFor()``, que se utiliza para cambiar el estado de un objeto) también asume que los identificadores de transición son únicos.
