Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/workflow.po
Languages: es

source: For example, insurance companies process claims, delivery companies track shipments, and schools accept applications for admission.
es: Por ejemplo, las compañías de seguros procesan las reclamaciones, las empresas de entrega rastrean los envíos y las escuelas aceptan solicitudes de admisión.

source: All these tasks involve several people, sometimes take a long time, and vary significantly from organization to organization.
es: Todas estas tareas involucran a varias personas, a veces toman mucho tiempo y varían significativamente de una organización a otra.

source: The goal of workflow software is to streamline and track workflow activity. Since different organizations have different workflow processes, workflow software must be flexible and easy to customize.
es: El objetivo del software de flujo de trabajo es agilizar y realizar un seguimiento de la actividad del flujo de trabajo. Dado que las diferentes organizaciones tienen diferentes procesos de flujo de trabajo, el software de flujo de trabajo debe ser flexible y fácil de personalizar.

source: The workflow system inside of Plone is an example of a State Machine.
es: El sistema de flujo de trabajo dentro de Plone es un ejemplo de una máquina de estado.

source: From `Wikipedia <https://en.wikipedia.org/wiki/Finite-state_machine>`_:
es: De `Wikipedia <https://en.wikipedia.org/wiki/Finite-state_machine>`_:

source: A finite-state machine (FSM) or finite-state automaton (plural: automata), or simply a state machine, is a behavioral model used to design computer programs. It is composed of a finite number of states associated to transitions. A transition is a set of actions that starts from one state and ends in another (or the same) state. A transition is started by a trigger, and a trigger can be an event or a condition.
es: Una máquina de estado finito (FSM) o autómata de estado finito (plural: autómatas), o simplemente una máquina de estado, es un modelo de comportamiento utilizado para diseñar programas informáticos. Está compuesto por un número finito de estados asociados a las transiciones. Una transición es un conjunto de acciones que comienza en un estado y termina en otro (o en el mismo) estado. Una transición se inicia mediante un desencadenador, y un desencadenador puede ser un evento o una condición.

source: Any object controlled by workflow is **always** in precisely one ``state`` from each workflow in its chain.
es: Cualquier objeto controlado por el flujo de trabajo está **siempre** en precisamente un ``estado`` de cada flujo de trabajo en su cadena.

source: The ``state`` in which an object is currently located controls what ``transitions`` are available to it
es: El ``estado`` en el que se encuentra actualmente un objeto controla qué ``transiciones`` están disponibles para él

source: Any workflow can be diagrammed, showing the available states and the transitions between them
es: Cualquier flujo de trabajo se puede diagramar, mostrando los estados disponibles y las transiciones entre ellos

source: Diagrams like this can be of enormous help in understanding your workflow
es: Diagramas como este pueden ser de gran ayuda para comprender su flujo de trabajo

source: You should always sketch up a diagram when you start figuring out the workflow you want
es: Siempre debes esbozar un diagrama cuando comiences a descubrir el flujo de trabajo que deseas

source: What's In a Workflow?
es: ¿Qué hay en un flujo de trabajo?

source: Workflows Control
es: Control de flujos de trabajo

source: What ``states`` and ``transitions`` are available
es: ¿Qué ``estados`` y ``transiciones`` están disponibles

source: Which ``permissions`` will be managed (permissions not managed are left untouched from their current value by the workflow)
es: ¿Cuáles ``permisos`` se administrarán (los permisos no administrados se dejan intactos de su valor actual por el flujo de trabajo)?

source: Which ``groups`` will be managed (see ``states`` below for more about this)
es: ¿Cuáles ``grupos`` se administrarán (consulte ``estados`` a continuación para obtener más información sobre esto)?

source: Which ``variables`` will be tracked by the workflow (values are set and stored every time a transition occurs)
es: ¿Cuáles ``variables`` serán rastreadas por el flujo de trabajo (los valores se establecen y almacenan cada vez que ocurre una transición)?

source: What ``worklists`` will be generated (you can return lists of content matching values tracked by ``variables``
es: ¿Qué ``listas de trabajo`` se generarán (puede devolver listas de valores de coincidencia de contenido rastreadas por ``variables``?

source: What ``scripts`` are available to be used in conjunction with ``transitions``
es: ¿Qué ``scripts`` están disponibles para ser usados junto con ``transiciones``?

source: These are basic python scripts, and are not used much anymore now that ``events`` are available
es: Estos son scripts básicos de Python, y ya no se usan mucho ahora que los ``eventos`` están disponibles

source: States Control
es: Control de los Estados

source: What transitions are available **out**
es: ¿Qué transiciones están disponibles **fuera**?

source: What ``permissions`` are assigned to which ``roles`` *locally* to the object
es: ¿Qué ``permisos`` se asignan a qué ``roles`` *localmente* al objeto?

source: What ``groups`` are assigned to which ``roles`` *locally* to the object
es: ¿Qué ``grupos`` se asignan a qué ``roles`` *localmente* al objeto?

source: This is probably the least-used aspect of workflow
es: Este es probablemente el aspecto menos utilizado del flujo de trabajo

source: It can be spectacularly useful
es: Puede ser espectacularmente útil

source: Transitions Control
es: Control de transiciones

source: What ``state`` they will end in
es: ¿En qué "estado" terminarán?

source: What conditions or ``gaurds`` are required for the transition to be available
es: ¿Qué condiciones o ``garantías`` se requieren para que la transición esté disponible?

source: These can be ``permissions`` of the user, ``roles`` a user has, ``groups`` to which the user belongs, or even the boolean value of *'TALES*' expressions
es: Estos pueden ser ``permisos`` del usuario, ``roles`` que tiene un usuario, ``grupos`` a los que pertenece el usuario, o incluso el valor booleano de las expresiones *'TALES*'

source: What ``scripts`` will be executed before and after the transition occurs (again, not used much now that we have ``events``)
es: Qué ``scripts`` se ejecutarán antes y después de que ocurra la transición (de nuevo, no se usa mucho ahora que tenemos ``eventos``)

source: How the transition is triggered
es: Cómo se desencadena la transición

source: This can be user-initiated *or* automatic
es: Esto puede ser iniciado por el usuario *o* automático

source: Automatic transitions happen when an object lands in a state from which they are a valid exit, **and** that object fulfills **all** conditions for the transition to be available.
es: Las transiciones automáticas ocurren cuando un objeto aterriza en un estado del que son una salida válida, **y** ese objeto cumple **todas** las condiciones para que la transición esté disponible.

source: If the conditions for the automated transition are **not** met, then the transition doesn't happen
es: Si las condiciones para la transición automatizada **no** se cumplen, entonces la transición no se produce

source: Updating the object to meet the conditions will not kick it off
es: Actualizar el objeto para que cumpla las condiciones no lo iniciará

source: You'll have to back it out of the current ``state`` and re-do the transition that should have kicked it off
es: Tendrás que sacarlo del ``estado`` actual y volver a hacer la transición que debería haberlo iniciado

source: How Does Workflow Work In Plone?
es: ¿Cómo funciona el flujo de trabajo en Plone?

source: The tool in Plone that handles all workflow is called ``portal_workflow``
es: La herramienta en Plone que maneja todo el flujo de trabajo se llama ``portal_workflow``

source: Types must be ``workflow`` aware
es: Los tipos deben ser compatibles con el ``flujo de trabajo``

source: Types in Plone are made *WorkflowAware* by a base content mixin from CMFCore ``WorkflowAware`` (in ``CMFCatalogAware``
es: Los tipos en Plone se hacen *WorkflowAware* mediante una mezcla de contenido base de CMFCore ``WorkflowAware`` (en ``CMFCatalogAware``

source: Workflow is assigned by *type*
es: El flujo de trabajo se asigna por *tipo*

source: Each type gets a *chain*
es: Cada tipo recibe una *cadena*

source: A chain can have more than one workflow in it
es: Una cadena puede tener más de un flujo de trabajo

source: ``portal_workflow`` is responsible for keeping track of all information about the workflow state of an object
es: ``portal_workflow`` es responsable de realizar un seguimiento de toda la información sobre el estado del flujo de trabajo de un objeto

source: A particular content object knows **nothing** about it's own workflow state
es: Un objeto de contenido en particular no sabe **nada** sobre su propio estado de flujo de trabajo

source: queries about the workflow of an object **must** be addressed to portal_workflow
es: las consultas sobre el flujo de trabajo de un objeto **deben** dirigirse a portal_workflow

source: ``portal_workflow`` is security conscious, for all aspects of workflow it respects and validates the access levels of the current user
es: ``portal_workflow`` es consciente de la seguridad, para todos los aspectos del flujo de trabajo respeta y valida los niveles de acceso del usuario actual

source: Users can only access the workflow information for which they have permissions
es: Los usuarios solo pueden acceder a la información del flujo de trabajo para la que tienen permisos

source: Moving Content Through Workflows
es: Mover contenido a través de flujos de trabajo

source: As stated above, any object with workflow is **always** in exactly **one** ``state`` for each workflow in it's chain.
es: Como se indicó anteriormente, cualquier objeto con flujo de trabajo está **siempre** exactamente en **un** ``estado`` para cada flujo de trabajo en su cadena.

source: When you initiate a transition, it is **instantaneous**.
es: Cuando inicias una transición, es **instantánea**.

source: What happens when this occurs?
es: ¿Qué sucede cuando esto ocurre?

source: The ``BeforeTransitionEvent`` is notified, and any subscribers to that event are executed
es: Se notifica a ``BeforeTransitionEvent`` y se ejecutan los suscriptores de ese evento

source: Any ``before script`` registered for the transition are executed.
es: Se ejecuta cualquier ``script before`` registrado para la transición.

source: The ``transition`` takes place
es: La ``transición`` tiene lugar

source: values are set for the variables registered by the workflow
es: los valores se establecen para las variables registradas por el flujo de trabajo

source: the new ``state`` of the object is set
es: se establece el nuevo ``estado`` del objeto

source: the new set of permissions values for roles and groups are calculated and updated
es: se calcula y actualiza el nuevo conjunto de valores de permisos para roles y grupos

source: first permissions are remapped
es: se reasignan los primeros permisos

source: then group -> role mappings are changed
es: se modifican las correspondencias grupo -> rol

source: the object is re-indexed for all *security related* indexes.
es: el objeto se vuelve a indexar para todos los índices *relacionados con la seguridad*.

source: Any ``after script`` registered for the transition is executed
es: Se ejecuta cualquier ``script posterior`` registrado para la transición

source: The ``AfterTransitionEvent`` is notified, and any subscribers to that event are executed
es: Se notifica el ``AfterTransitionEvent`` y se ejecutan los suscriptores de ese evento

source: In general, transitions are triggered by user action. This takes place when a user clicks on the *state* menu in the Plone UI and selects an available transition, or when the user presses *save* from the **Change State** dialog found in the folder listing view.
es: En general, las transiciones se desencadenan por la acción del usuario. Esto tiene lugar cuando un usuario hace clic en el menú *estado* en la interfaz de usuario de Plone y selecciona una transición disponible, o cuando el usuario presiona *guardar* desde el cuadro de diálogo **Cambiar estado** que se encuentra en la vista de lista de carpetas.

source: As stated above, automatic transitions are found as a result of undergoing manual transitions.
es: Como se indicó anteriormente, las transiciones automáticas se encuentran como resultado de someterse a transiciones manuales.

source: Step 3 above can actually be executed **multiple** times when a user triggers a ``transition``.
es: El paso 3 anterior puede ejecutarse **múltiples** veces cuando un usuario desencadena una ``transición``.

source: Events and scripts are executed for **each** transition that happens
es: Los eventos y scripts se ejecutan para **cada** transición que ocurre

source: For this reason, when subscribing to workflow events, it's a good idea to check *which* transition just happened *before* taking any actions in your handler:
es: Por este motivo, al suscribirse a eventos de flujo de trabajo, es una buena idea comprobar *cuál* transición acaba de ocurrir *antes* de realizar cualquier acción en el controlador:

source: Local Roles
es: Roles locales

source: Local Roles On Folders
es: Roles locales en carpetas

source: There may be some situations where you don't want your group to have a specific role across the entire site. You can manage that too.
es: Puede haber algunas situaciones en las que no desee que su grupo tenga un rol específico en todo el sitio. Tú también puedes manejar eso.

source: When setting up your group in the Site Setup, do not assign it a role. Go to the folder where you want the group to have specific permissions and assign the group that role on the sharing tab for the folder.
es: Al configurar el grupo en la configuración del sitio, no le asigne un rol. Vaya a la carpeta en la que desea que el grupo tenga permisos específicos y asigne al grupo ese rol en la pestaña de uso compartido de la carpeta.

source: You can assign individual users permissions at this level as well. Add the user to the sharing tab and assign the permission to that user. When you assign roles at an object level like this, you are assigning local roles.
es: También puede asignar permisos a usuarios individuales en este nivel. Añada el usuario a la pestaña de uso compartido y asigne el permiso a ese usuario. Cuando se asignan roles en un nivel de objeto como este, se están asignando roles locales.

source: Local roles give users (or groups) extra permissions in a very specific context. For example, you may have two groups: pirates and ninjas.
es: Los roles locales otorgan a los usuarios (o grupos) permisos adicionales en un contexto muy específico. Por ejemplo, puede tener dos grupos: piratas y ninjas.

source: The ninjas probably don't want the pirates mucking about with their content. In this case, you could create a folder for the ninjas and assign their group to have a local role of Owner over the folder. Uncheck the inherit permissions box and now your ninjas have their own folder where they can add content and the pirates cannot see or add anything to this folder. Similarly, if only the pirate captain should have access to a folder, add the pirate captain user to the sharing tab and select the correct permission.
es: Es probable que los ninjas no quieran que los piratas jueguen con su contenido. En este caso, puede crear una carpeta para los ninjas y asignar su grupo para que tenga un rol local de Propietario sobre la carpeta. Desmarque la casilla heredar permisos y ahora sus ninjas tienen su propia carpeta donde pueden añadir contenido y los piratas no pueden ver ni añadir nada a esta carpeta. Del mismo modo, si solo el capitán pirata debe tener acceso a una carpeta, añada el usuario capitán pirata a la pestaña de uso compartido y seleccione el permiso correcto.

source: Don't forget to uncheck the inherit permissions box, otherwise your folder will inherit permissions from the rest of the site.
es: No olvides desmarcar la casilla heredar permisos, de lo contrario, tu carpeta heredará los permisos del resto del sitio.

source: Local Roles On Groups
es: Roles locales en grupos

source: A state can also assign local roles to groups. This is akin to assigning roles to groups on Plone's Sharing tab, but the mapping of roles to groups happens on each state change, much like the mapping of roles to permissions.
es: Un estado también puede asignar roles locales a grupos. Esto es similar a la asignación de roles a grupos en la pestaña Compartir de Plone, pero la asignación de roles a grupos ocurre en cada cambio de estado, al igual que la asignación de roles a permisos.

source: Thus, you can say that in the pending_secondary state, members of the Secondary reviewers group has the ``Reviewer`` local role. This is powerful stuff when combined with the more usual role-to-permission mapping.
es: Por lo tanto, se puede decir que en el estado pending_secondary, los miembros del grupo de revisores secundarios tienen el rol local ``Revisor``. Esto es algo poderoso cuando se combina con la asignación de roles a permisos más habitual.

source: Additional Resources
es: Recursos adicionales

source: Placeful Workflow
es: Flujo de trabajo con contexto

source: Sometimes you may want a specific section of the site to allow different permissions and roles than other areas of the site such as providing an intranet are for internal staff to collaborate. In the past, if you wanted to do this, you would need to make custom content types that were identical to the standard types so you can attach an alternate workflow policy to them to limit access.
es: A veces, es posible que desee que una sección específica del sitio permita permisos y roles diferentes a los de otras áreas del sitio, como proporcionar una intranet para que colabore el personal interno. En el pasado, si quería hacer esto, tenía que crear tipos de contenido personalizados que fueran idénticos a los tipos estándar para poder adjuntarles una política de flujo de trabajo alternativa para limitar el acceso.

source: This causes extra boilerplate code and confusion amongst your users as they just want to create standard "Pages", but in this area they may have to create "Intranet Pages".
es: Esto causa código repetitivo adicional y confusión entre sus usuarios, ya que solo quieren crear "Páginas" estándar, pero en esta área es posible que tengan que crear "Páginas de Intranet".

source: Plone comes standard with a feature that addresses this specific issue.
es: Plone viene de serie con una función que aborda este problema específico.

source: Plone's "Workflow Policy Support" add-on is available, but not active by default and allows site administrators to define workflow policies that only apply in specific sections of the site.
es: El complemento "Soporte de políticas de flujo de trabajo" de Plone está disponible, pero no está activo de forma por defecto y permite a los administradores del sitio definir políticas de flujo de trabajo que solo se aplican en secciones específicas del sitio.

source: The name Placeful Workflow comes from the fact you do this in a specific place.
es: El nombre Placeful Workflow proviene del hecho de que lo haces en un lugar específico.

source: Placeful workflow allows you to define workflow policies that define content type to workflow mappings that can be applied in any sub-folder of your Plone site.
es: El flujo de trabajo de Placeful te permite definir políticas de flujo de trabajo que definen el tipo de contenido para las asignaciones de flujo de trabajo que se pueden aplicar en cualquier subcarpeta de tu sitio de Plone.

source: To get started with Placeful Workflow in Plone, you will need to first activate the add-on via the :menuselection:`Site Setup -> Add-Ons` control panel.
es: Para empezar a utilizar Placeful Workflow en Plone, primero tendrás que activar el complemento a través del panel de control :menuselection:`Configuración del sitio -> Complementos`.

source: Click :guilabel:`Activate` next to the "Workflow Policy Support" add-on and you will be ready to start assigning local policies to folders.
es: Haga clic en :guilabel:`Activar` junto al complemento "Soporte de políticas de flujo de trabajo" y estará listo para comenzar a asignar políticas locales a las carpetas.

source: Create or go to any folder inside of your site and click the workflow state menu and you will now see an option for ``Policy...``.
es: Crea o ve a cualquier carpeta dentro de tu sitio y haz clic en el menú de estado del flujo de trabajo y ahora verás una opción para ``Política...``.

source: Select this option to begin assigning local workflow mappings to this folder.
es: Seleccione esta opción para comenzar a asignar asignaciones de flujo de trabajo local a esta carpeta.

source: By default, the Placeful Workflow product has created some default mappings for you:
es: De forma predeterminada, el producto Placeful Workflow ha creado algunas asignaciones predeterminadas para usted:

source: Intranet -- Sets the default workflow policy to ``Intranet/Extranet``
es: Intranet -- Establece la política de flujo de trabajo por defecto en ``Intranet/Extranet``

source: Old Plone -- Sets the default workflow policy to ``Community Workflow``
es: Old Plone -- Establece la política de flujo de trabajo por defecto en ``Flujo de trabajo de la comunidad``

source: One State -- Sets the default workflow policy to ``Single State Workflow``
es: Un estado: establece la política de flujo de trabajo por defecto en ``Flujo de trabajo de estado único``

source: Simple Publication -- Sets the default workflow policy to ``Simple Publication Workflow``
es: Publicación simple: establece la política de flujo de trabajo por defecto en ``Flujo de trabajo de publicación simple``

source: From the ``Workflow Policies`` control panel, you can create your own custom mappings and then assign them via the ``Policy...`` menu option per folder inside your site.
es: Desde el panel de control ``Políticas de flujo de trabajo``, puede crear sus propios mapeos personalizados y luego asignarlos a través de la opción de menú ``Política...`` por carpeta dentro de su sitio.

source: Internals Of Placeful Workflow
es: Funcionamiento interno de Placeful Workflow

source: This works by providing a more specific ``adapter`` for the ``IWorkflowChain`` interface defined by DCWorkflow.
es: Esto funciona proporcionando un ``adaptador`` más específico para la interfaz ``IWorkflowChain`` definida por DCWorkflow.

source: It means that when you install this product, the ``portal_workflow`` tool is marked with an ``IPlacefulWorkflow`` interface, and from then on, the adapter defined by the product is used when looking up the workflow chain for an object
es: Esto significa que cuando se instala este producto, la herramienta ``portal_workflow`` se marca con una interfaz ``IPlacefulWorkflow`` y, a partir de ese momento, el adaptador definido por el producto se utiliza al buscar un objeto en la cadena de flujo de trabajo

source: A great example of the `marker pattern <https://docs.plone.org/external/plone.app.dexterity/docs/behaviors/providing-marker-interfaces.html>`_
es: Un gran ejemplo del `patrón marker <https://docs.plone.org/external/plone.app.dexterity/docs/behaviors/providing-marker-interfaces.html>`_

source: You add a *workflow policy* in the location where you want to have customized workflow assignments.
es: Añada una *política de flujo de trabajo* en la ubicación en la que desee tener asignaciones de flujo de trabajo personalizadas.
