Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/workflow.po
Languages: es

source: If you have two workflows in the chain and both currently have a ``submit`` action available, only the first workflow will be transitioned if you do ``portal_workflow.doActionFor(context, ‘submit’)``.
es: Si tiene dos flujos de trabajo en la cadena y ambos tienen actualmente una acción ``submit`` disponible, solo se realizará la transición del primer flujo de trabajo si hace ``portal_workflow.doActionFor(context, 'submit')``.

source: Plone will show all available transitions from all workflows in the current object’s chain in the ``State`` drop-down, so you do not need to create any custom UI for this.
es: Plone mostrará todas las transiciones disponibles de todos los flujos de trabajo en la cadena del objeto actual en el menú desplegable ``Estado``, por lo que no necesita crear ninguna interfaz de usuario personalizada para esto.

source: Plone always assumes the state variable is called ``review_state`` (which is also the variable indexed in ``portal_catalog``). Therefore, the state of a secondary workflow won’t show up unless you build some custom UI (User Interface).
es: Plone siempre asume que la variable de estado se llama ``review_state`` (que también es la variable indexada en ``portal_catalog``). Por lo tanto, el estado de un flujo de trabajo secundario no se mostrará a menos que cree una interfaz de usuario (UI) personalizada.

source: In terms of security, remember that the role-to-permission (and group-to-local-role) mappings are event-driven and are set after each transition.
es: En términos de seguridad, recuerde que las asignaciones de rol a permiso (y de grupo a rol local) se basan en eventos y se establecen después de cada transición.

source: If you have two concurrent workflows that manage the same permissions, the settings from the last transition invoked will apply.
es: Si tiene dos flujos de trabajo simultáneos que administran los mismos permisos, se aplicará la configuración de la última transición invocada.

source: If they manage different permissions (or there is a partial overlap) then only the permissions managed by the most-recently-invoked workflow will change, leaving the settings for other permissions untouched.
es: Si administran diferentes permisos (o hay una superposición parcial), solo cambiarán los permisos administrados por el flujo de trabajo invocado más recientemente, dejando intacta la configuración de otros permisos.

source: Workflow Variables
es: Variables de flujo de trabajo

source: This section is not ready for prime time
es: Esta sección no está preparada para el prime time

source: State changes result in a number of variables being recorded, such as the actor (the user that invoked the transition), the action (the id of the transition), the date and time and so on.
es: Los cambios de estado dan como resultado que se registren una serie de variables, como el actor (el usuario que invocó la transición), la acción (el identificador de la transición), la fecha y la hora, etc.

source: The list of variables is dynamic, so each workflow can define any number of variables linked to TALES expressions that are invoked to calculate the current value at the point of transition.
es: La lista de variables es dinámica, por lo que cada flujo de trabajo puede definir cualquier número de variables vinculadas a expresiones TALES que se invocan para calcular el valor actual en el punto de transición.

source: Of course, the workflow keeps track of the current state.
es: Por supuesto, el flujo de trabajo realiza un seguimiento del estado actual.

source: The state is exposed as a special type of workflow variable called the state variable. Most workflows in Plone uses the name review_state as the state variable.
es: El estado se expone como un tipo especial de variable de flujo de trabajo denominada variable de estado. La mayoría de los flujos de trabajo de Plone utilizan el nombre review_state como variable de estado.

source: Workflow variables are recorded for each state change in the workflow history.
es: Las variables de flujo de trabajo se registran para cada cambio de estado en el historial del flujo de trabajo.

source: This allows you to see when a transition occurred, who effected it, and what state the object was in before or after.
es: Esto le permite ver cuándo se produjo una transición, quién la efectuó y en qué estado se encontraba el objeto antes o después.

source: In fact, the "current state" of the workflow is internally considered to be the most recent entry in the workflow history.
es: De hecho, el "estado actual" del flujo de trabajo se considera internamente como la entrada más reciente en el historial del flujo de trabajo.

source: Workflow variables are also the basis for worklists.
es: Las variables de flujo de trabajo también son la base de los pools de trabajo.

source: They are basically canned queries run against the current state of workflow variables.
es: Básicamente, son consultas predefinidas que se ejecutan en el estado actual de las variables de flujo de trabajo.

source: Plone's review portlet shows all current worklists from all installed workflows.
es: El portlet de revisión de Plone muestra todas las listas de trabajo actuales de todos los flujos de trabajo instalados.

source: This can be a bit slow, but it does meant that you can use a single portlet to display an amalgamated list of all items on all worklists that apply to the current user. Most Plone workflows have a single worklist that matches on the review_state variable, e.g. showing all items in the pending state.
es: Esto puede ser un poco lento, pero significa que puede usar un solo portlet para mostrar una lista amalgamada de todos los elementos en todas las listas de trabajo que se aplican al usuario actual. La mayoría de los flujos de trabajo de Plone tienen una única lista de trabajo que coincide con la variable review_state, por ejemplo, mostrando todos los elementos en el estado pendiente.
