Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/workflow.po
Languages: es

source: Glossary
es: Glosario

source: `Amazon Web Services <https://aws.amazon.com/>`_ offers reliable, scalable, and inexpensive cloud computing services. ree to join, pay only for what you use.
es: `Amazon Web Services <https://aws.amazon.com/>`_ ofrece servicios de computación en la nube confiables, escalables y económicos. libre de unirse, pague solo por lo que usa.

source: `Linode.com <https://www.linode.com/>`_ is an American privately owned virtual private server provider company
es: `Linode.com <https://www.linode.com/>`_ es una empresa proveedora de servidores privada virtual de propiedad privada estadounidense

source: based in Galloway, New Jersey, United States.
es: con sede en Galloway, New Jersey, Estados Unidos.

source: `DigitalOcean, Inc. <https://www.digitalocean.com/>`_ is an American cloud infrastructure provider
es: `DigitalOcean, Inc. <https://www.digitalocean.com/>`_ es un proveedor estadounidense de infraestructura en la nube

source: headquartered in New York City with data centers worldwide.
es: con sede en la ciudad de Nueva York y centros de datos en todo el mundo.

source: `A native object database for Python <http://www.zodb.org/en/latest/>`_.
es: `Una base de datos de objetos nativos para Python <http://www.zodb.org/en/latest/>`_.

source: Through-The-Web, changes in the browser/
es: A través de la web, cambios en el navegador/

source: `Amazon S3 <https://aws.amazon.com/s3/>`_ - Object storage built to store and retrieve any amount of data from anywhere.
es: `Amazon S3 <https://aws.amazon.com/s3/>`_ - Almacenamiento de objetos creado para almacenar y recuperar cualquier cantidad de datos desde cualquier lugar.

source: `AWS OpsWorks <https://aws.amazon.com/opsworks/>`_ is a configuration management service that uses Chef,
es: `AWS OpsWorks <https://aws.amazon.com/opsworks/>`_ es un servicio de administración de configuración que usa Chef,

source: an automation platform that treats server configurations as code.
es: una plataforma de automatización que trata las configuraciones del servidor como código.

source: `Ansible <https://www.ansible.com/>`_ is an open source automation platform.
es: `Ansible <https://www.ansible.com/>`_ es una plataforma de automatización de fuente abierta.

source: Ansible can help you with configuration management, application deployment, task automation.
es: Ansible puede ayudarlo con la administración de configuraciones, el despliegue de aplicaciones y la automatización de tareas.

source: `A configuration management tool written in Ruby and Erlang <https://www.chef.io/chef/>`_.
es: `Una herramienta de gestión de configuración escrita en Ruby y Erlang <https://www.chef.io/chef/>`_.

source: `AWS CloudFormation <https://aws.amazon.com/cloudformation/>`_ gives developers and systems administrators an way to create and manage a collection of related AWS resources, provisioning and updating them in an orderly and predictable fashion.
es: `AWS CloudFormation <https://aws.amazon.com/cloudformation/>`_ brinda a los desarrolladores y administradores de sistemas una forma de crear y administrar una colección de recursos relacionados de AWS, aprovisionándolos y actualizándolos de manera ordenada y predecible.

source: Travis CI is a hosted, distributed continuous integration service used to build and test software projects hosted at GitHub. Open source projects may be tested at no charge via `travis-ci.org <https://travis-ci.org>`_.
es: Travis CI es un servicio de integración continua alojado que se utiliza para crear y probar proyectos de software alojados en GitHub. Los proyectos de código abierto pueden probarse sin cargo a través de `travis-ci.org <https://travis-ci.org>`_.

source: `Solr <http://lucene.apache.org/solr/>`_ a the popular, blazing-fast, open source enterprise search platform built on Apache Lucene.
es: `Solr <http://lucene.apache.org/solr/>`_ una popular plataforma de búsqueda empresarial de código abierto, desarrollada en Apache Lucene.

source: The `Zope Configuration Mark-up Language <https://docs.plone.org/develop/addons/components/zcml.html>`_.
es: El `Lenguaje de marcado de configuración Zope <https://docs.plone.org/develop/addons/components/zcml.html>`_.

source: `Diazo theme engine guide <http://docs.diazo.org/en/latest/>`_ Diazo allows you to apply a theme contained in a static HTML web page to a dynamic website created using any server-side technology.
es: `Guía del motor de temas Diazo <http://docs.diazo.org/en/latest/>`_ Diazo le permite aplicar un tema contenido en una página web HTML estática a un sitio web dinámico creado utilizando cualquier tecnología del lado del servidor.

source: `Dexterity <https://github.com/plone/plone.dexterity>`_, the base framework for building content types, both through-the-web and as filesystem code for Zope.
es: `Dexterity <https://github.com/plone/plone.dexterity>`_, el marco base para crear tipos de contenido, tanto a través de la web como como código del sistema de archivos para Zope.

source: The Dublin Core Schema is a small set of vocabulary terms that can be used to describe web resources (video, images, web pages, etc.), as well as physical resources such as books or CDs, and objects like artworks.
es: El Dublin Core Schema es un pequeño conjunto de términos de vocabulario que se pueden utilizar para describir recursos web (vídeo, imágenes, páginas web, etc.), así como recursos físicos como libros o CD, y objetos como obras de arte.

source: The Zope Management Interface. The ZMI is a direct interface into the backend software stack of Plone. While it can still serve as a valuable tool for Plone specialists to fix problems or accomplish certain tasks, it is not recommended as a regular tool for Plone maintenance.
es: La interfaz de administración de Zope. El ZMI es una interfaz directa en la pila de software backend de Plone. Si bien aún puede servir como una herramienta valiosa para que los especialistas de Plone solucionen problemas o realicen ciertas tareas, no se recomienda como una herramienta regular para el mantenimiento de Plone.

source: About
es: Acerca de

source: Dynamic Roles
es: Roles dinámicos

source: Plone core's ``borg.localrole`` package allows you to hook into role-resolving code and add roles dynamically. I.e. the role on the user depends on HTTP request / environment conditions and is not something set in the site database.
es: El paquete ``borg.localrole`` de Plone core le permite conectarse a código de resolución de roles y añadir roles dinámicamente. Es decir, el rol en el usuario depende de las condiciones de la solicitud HTTP / entorno y no es algo establecido en la base de datos del sitio.

source: Using Dynamic Roles
es: Uso de roles dinámicos

source: To start utilizing dynamic roles in Plone, you will need to create an Zope 3 Adapter for ``ILocalRoleProvider`` in your custom product that contains the code to return the correct roles for a user in a specific context.
es: Para comenzar a utilizar roles dinámicos en Plone, deberá crear un adaptador de Zope 3 para ``ILocalRoleProvider`` en su producto personalizado que contenga el código para devolver los roles correctos para un usuario en un contexto específico.

source: getAllRoles() is overridden to return a custom role which is not available through normal security machinery. This is required because Plone/Zope builds look-up tables based on the result of getAllRoles() and all possible roles must appear there
es: getAllRoles() se anula para devolver un rol personalizado que no está disponible a través de la maquinaria de seguridad normal. Esto es necesario porque Plone/Zope crea tablas de búsqueda basadas en el resultado de getAllRoles() y todos los roles posibles deben aparecer allí

source: getRoles() is overridden to call custom getDummyRolesOnContext() which has the actual logic to resolve the roles
es: getRoles() se anula para llamar a getDummyRolesOnContext() personalizado, que tiene la lógica real para resolver los roles

source: An example code checks whether the context object implements a marker interface and gives the user a role based on that
es: Un código de ejemplo comprueba si el objeto de contexto implementa una interfaz de marcador y asigna al usuario un rol basado en ello

source: **Note:** getRoles() function is called several times per request so you might want to cache the result.
es: **Nota:** La función getRoles() se llama varias veces por solicitud, por lo que es posible que desee almacenar el resultado en caché.

source: Example ``localroles.py``
es: Ejemplo ``localroles.py``

source: Custom local role implementation is made effective using :term:`ZCML` adapter directive in your add-ons ``configure.zcml``
es: La implementación de roles locales personalizados se hace efectiva utilizando la directiva del adaptador :term:`ZCML` en sus complementos ``configure.zcml``

source: Using GenericSetup to Manage Plone Workflows
es: Usando GenericSetup para administrar flujos de trabajo Plone

source: Workflows provide a great amount of flexibility inside of Plone. They have many moving parts such as states, transitions, permissions, variables, worklist and groups. Plone gives you the ability to configure all of these items through the web via the ZMI, but moving these settings to another environment as part of a release or migration can be error prone.
es: Los flujos de trabajo proporcionan una gran flexibilidad dentro de Plone. Tienen muchas partes móviles, como estados, transiciones, permisos, variables, listas de trabajo y grupos. Plone le brinda la capacidad de configurar todos estos elementos a través de la web a través de ZMI, pero mover estos ajustes a otro entorno como parte de una versión o migración puede ser propenso a errores.

source: The GenericSetup tool inside of plone, which has the id of ``portal_setup``, provides a way to serialize the current state of your workflow polices into a XML file that can be put into your own custom add-on packages. Using this export/import tool, you can now track changes to your workflow polices inside of your source control tools and create releases that allow exact replication of the settings to new or existing environments.
es: La herramienta GenericSetup dentro de plone, que tiene el id de ``portal_setup``, proporciona una manera de serializar el estado actual de las políticas de flujo de trabajo en un archivo XML que se puede colocar en sus propios paquetes de complementos personalizados. Con esta herramienta de exportación/importación, ahora puede realizar un seguimiento de los cambios en las políticas de flujo de trabajo dentro de las herramientas de control de código fuente y crear versiones que permitan la replicación exacta de la configuración en entornos nuevos o existentes.

source: Getting Started
es: Primeros pasos

source: Creating a workflow from scratch using the XML format is tricky at best. It is recommended that you start from the ZMI and copy/paste an existing workflow that most closely matches your business need and use it as a starting point. The changes to the workflow can be configured via the ZMI and then exported to the filesystem for inclusion in your product.
es: Crear un flujo de trabajo desde cero utilizando el formato XML es, en el mejor de los casos, complicado. Se recomienda comenzar desde la ZMI y copiar y pegar un flujo de trabajo existente que se acerque más a las necesidades de su negocio y utilizarlo como punto de partida. Los cambios en el flujo de trabajo se pueden configurar a través de ZMI y luego exportarse al sistema de archivos para su inclusión en su producto.

source: Exporting Workflow Policies
es: Exportación de políticas de flujo de trabajo

source: Once your workflow is working locally for your needs, you can export your workflow using the ``portal_setup`` tool in the ZMI.
es: Una vez que su flujo de trabajo esté funcionando localmente para sus necesidades, puede exportar su flujo de trabajo utilizando la herramienta ``portal_setup`` en el ZMI.

source: Login to the ZMI and click ``portal_setup``
es: Inicie sesión en el ZMI y haga clic en ``portal_setup``

source: Click the ``Export`` tab
es: Haga clic en la pestaña ``Exportar``

source: Check the box for ``Workflow Tool`` (and optionally ``Placeful Workflow Policies``)
es: Marque la casilla ``Herramienta de flujo de trabajo`` (y opcionalmente ``Políticas de flujo de trabajo de Placeful``)

source: Click the button at the bottom of the page to ``Export selected steps``
es: Haga clic en el botón en la parte inferior de la página para ``Exportar los pasos seleccionados``

source: This will download a files called ``setup_tool-[sometimestamp].tar.gz`` to your local computer. This tarball will include the ``workflows.xml`` profile that describes all of the content to workflow policy bindings as well as the export of each workflow policy as an xml file.
es: Esto descargará un archivo llamado ``setup_tool-[alguna-fecha-hora].tar.gz`` a tu computadora local. Este tarball incluirá el perfil ``workflows.xml`` que describe todo el contenido de los enlaces de políticas de flujo de trabajo, así como la exportación de cada política de flujo de trabajo como un archivo xml.

source: These will be the files you will place in your custom product's profiles directory so it can be imported when using it in another instance. You will need to modify the ``workflows.xml`` file prior to importing since it contains all of the bindings and you will only want to include bindings that are specific to your custom add-on.
es: Estos serán los archivos que colocará en el directorio de perfiles de su producto personalizado para que pueda importarse cuando se use en otra instancia. Deberá modificar el archivo ``workflows.xml`` antes de importar, ya que contiene todos los enlaces y solo querrá incluir enlaces que sean específicos de su complemento personalizado.

source: Example ``workflows.xml``:
es: Ejemplo ``workflows.xml``:

source: In this example, the rest of the bindings have been removed so we are only controlling the needed workflows for our product.
es: En este ejemplo, se han eliminado el resto de los enlaces, por lo que solo controlamos los flujos de trabajo necesarios para nuestro producto.

source: The tarball will have a directory called ``workflows`` that contains each workflow policy for the site. You can remove all of the stock ones and just keep the policies referenced by your ``workflows.xml`` for import later.
es: El tarball tendrá un directorio llamado ``workflows`` que contiene cada política de flujo de trabajo para el sitio. Puede eliminar todos los de stock y mantener las políticas a las que hace referencia su ``workflows.xml`` para importarlas más tarde.

source: Subsequent updates to your workflow polices can either be made directly on the files system and then re-imported into the site. Or you can make the changes via the ZMI, but you will need to remember to re-export them using this same process and placing the updated files back into your add-on code.
es: Las actualizaciones posteriores de las políticas de flujo de trabajo se pueden realizar directamente en el sistema de archivos y, a continuación, volver a importarlas en el sitio. O puede realizar los cambios a través de ZMI, pero deberá recordar volver a exportarlos utilizando este mismo proceso y volver a colocar los archivos actualizados en su código adicional.

source: Importing Workflow Policies
es: Importación de políticas de flujo de trabajo

source: There are several options available for re-importing your workflows back into the site. The ``portal_setup`` tool provides an option for doing a ``Tarball Import``, but this doesn't allow you to keep your modified workflows alongside the code in your add-on product. It is recommended that you export your workflow polices using the steps above and place them in your add-on products *default* GenericSetup policy or include them as part of an upgrade step.
es: Hay varias opciones disponibles para volver a importar los flujos de trabajo en el sitio. La herramienta ``portal_setup`` proporciona una opción para hacer una ``Importación de Tarball``, pero esto no le permite mantener sus flujos de trabajo modificados junto con el código en su producto complementario. Se recomienda exportar las políticas de flujo de trabajo siguiendo los pasos anteriores y colocarlas en la directiva GenericSetup *por defecto* de los productos complementarios o incluirlas como parte de un paso de actualización.

source: Typically, your GenericSetup profiles will be stored in the ``profiles`` directory of your add-on product. Each subdirectory of the ``profiles`` directory is usually registered as a separate GenericSetup extension profile or they are used as part of an upgrade step registered to one of these profiles.
es: Normalmente, los perfiles de GenericSetup se almacenarán en el directorio ``profiles`` del producto complementario. Cada subdirectorio del directorio ``profiles`` generalmente se registra como un perfil de extensión GenericSetup separado o se utilizan como parte de un paso de actualización registrado en uno de estos perfiles.

source: Once you have wired the GenericSetup profile folder to your product using ZCML, you can now do the following to import your workflow policies to your current site.
es: Una vez que haya conectado la carpeta de perfil GenericSetup a su producto mediante ZCML, ahora puede hacer lo siguiente para importar sus políticas de flujo de trabajo a su sitio actual.

source: Click the ``Import`` tab
es: Haga clic en la pestaña ``Importar``

source: Select your GenericSetup profile by either *id* or *title*
es: Seleccione su perfil de GenericSetup por *id* o *title*

source: Select how you want to import your profile, if you have run the import already and your policies are part of the profile directly (not upgrade steps), you will want to select the option to ``Apply all profiles``
es: Seleccione cómo desea importar su perfil, si ya ha ejecutado la importación y sus políticas son parte del perfil directamente (no pasos de actualización), querrá seleccionar la opción ``Aplicar todos los perfiles``

source: Click the button to ``Import all steps``
es: Haga clic en el botón ``Importar todos los pasos``

source: If you only want to run the ``Workflow Tool`` steps, you will need go to the ``Advanced Import Tab`` and select your profile by *id* or *title* and then check the box for just ``Workflow Tool`` and click ``Import selected steps``.
es: Si solo desea ejecutar los pasos de la ``Herramienta de flujo de trabajo``, deberá ir a la ``Pestaña de importación avanzada`` y seleccionar su perfil por *id* o *título* y luego marcar la casilla solo ``Herramienta de flujo de trabajo`` y hacer clic en ``Importar pasos seleccionados``.

source: Using upgrade profiles is similar, but you will instruct Plone to run a function when upgrading from one version to the next. This function will call up an already registered *migration profile* and run it against the site. These upgrade steps will only run if the version of your product doesn't satisfy the version requirements that were configured via ZCML.
es: El uso de perfiles de actualización es similar, pero le indicará a Plone que ejecute una función al actualizar de una versión a la siguiente. Esta función llamará a un *perfil de migración* ya registrado y lo ejecutará en el sitio. Estos pasos de actualización solo se ejecutarán si la versión del producto no cumple los requisitos de versión que se configuraron a través de ZCML.

source: Plone Workflow
es: Flujo de trabajo Plone

source: Controlling security with workflow
es: Control de la seguridad con el flujo de trabajo

source: Level
es: Nivel

source: All levels
es: Todos los niveles

source: Status
es: Estatus

source: Work in progress
es: Trabajo en Progreso

source: This chapter is still work in progress!
es: ¡Este capítulo todavía está en progreso!

source: Workflow is used in Plone for three distinct, but overlapping purposes:
es: El flujo de trabajo se utiliza en Plone para tres propósitos distintos, pero superpuestos:

source: To keep track of metadata, chiefly an object’s *state*;
es: Para realizar un seguimiento de los metadatos, principalmente el *estado* de un objeto;

source: To create content review cycles and model other types of processes;
es: Para crear ciclos de revisión de contenido y modelar otros tipos de procesos;

source: To manage object security.
es: Para gestionar la seguridad de los objetos.

source: When writing content types, we will often create custom workflows to go with them.
es: Al escribir tipos de contenido, a menudo crearemos flujos de trabajo personalizados para acompañarlos.

source: Plone’s workflow system is known as DCWorkflow. It is a *states-and-transitions* system, which means that your workflow starts in a particular *state* (the *initial state*) and then moves to other states via *transitions* (also called *actions* in CMF).
es: El sistema de flujo de trabajo de Plone se conoce como DCWorkflow. Es un sistema de *estados y transiciones*, lo que significa que su flujo de trabajo comienza en un *estado* particular (el *estado inicial*) y luego se mueve a otros estados a través de *transiciones* (también llamadas *acciones* en CMF).

source: When an object enters a particular state (including the initial state), the workflow is given a chance to update **permissions** on the object.
es: Cuando un objeto entra en un estado determinado (incluido el estado inicial), el flujo de trabajo tiene la oportunidad de actualizar los **permisos** en el objeto.

source: A workflow manages a number of permissions – typically the "core" CMF permissions like :guilabel:`View`, :guilabel:`Modify portal content` and so on – and will set those on the object at each state change.
es: Un flujo de trabajo administra una serie de permisos, por lo general, los permisos CMF "principales" como :guilabel:`View`, :guilabel:`Modify portal content`, etc., y los establecerá en el objeto en cada cambio de estado.

source: Note that this is event-driven, rather than a real-time security check: only by changing the state is the security information updated.
es: Tenga en cuenta que esto se basa en eventos, en lugar de una verificación de seguridad en tiempo real: solo cambiando el estado se actualiza la información de seguridad.

source: This is why you need to click :guilabel:`Update security settings` at the bottom of the ``portal_workflow`` screen in the ZMI when you change your workflows’ security settings and want to update existing objects.
es: Esta es la razón por la que debe hacer clic en :guilabel:`Actualizar configuración de seguridad` en la parte inferior de la pantalla ``portal_workflow`` en el ZMI cuando cambie la configuración de seguridad de sus flujos de trabajo y desee actualizar los objetos existentes.

source: TODO:
es: TAREAS PENDIENTES:

source: Add a use case story thread that runs through each of the sections to illustrate how each concept works
es: Añada un hilo de historia de caso de uso que recorra cada una de las secciones para ilustrar cómo funciona cada concepto

source: Add in more screen shots of the :term:`TTW` (Trough-The_web) experience of using workflows in Plone
es: Añada más capturas de pantalla de la experiencia :term:`TTW` (Trough-The_web) de usar flujos de trabajo en Plone

source: Introduction To Workflows
es: Introducción a los flujos de trabajo

source: What Is A Workflow?
es: ¿Qué es un flujo de trabajo?

source: Workflow is the series of interactions that should happen to complete a task. Business organizations have many kinds of workflow.
es: El flujo de trabajo es la serie de interacciones que deben ocurrir para completar una tarea. Las organizaciones empresariales tienen muchos tipos de flujo de trabajo.
