Repository: plone-ve/training
Catalog: _locales/*/LC_MESSAGES/zpt_2.po
Languages: es

source: Customizing existing templates
es: Personalizar plantillas existentes

source: Get the code!
es: ¡Obtén el código!

source: Get the code for this chapter (:doc:`More info <sneak>`) using this command in the buildout-directory:
es: Obtén el código para este capítulo (:doc:`Más información <sneak>`) usando este comando en el directorio buildout:

source: To dive deeper into real plone-data we now look at some existing templates and customize them.
es: Para profundizar más en los datos real de plone, nosotros ahora miraremos algunas plantillas existentes y las personalizaremos.

source: newsitem.pt
es: El archivo newsitem.pt

source: We want to show the date a News Item is published. This way people can see at a glance it the are looking at current or old news.
es: Queremos mostrar la fecha de una Noticia se publica. De esta manera la gente puede ver a simple vista que la está mirando las noticias de actualidad o viejo.

source: To do this we will customize the templates that is used to render News Items.
es: Para ello vamos a personalizar las plantillas que se utilizan para representar una Noticia.

source: We'll basically do the same as when we used at ``portal_skins`` (we customized the footer), but now we'll do it all by hand in our package.
es: Básicamente haremos lo mismo que cuando se utilizó en ``portal_skins`` (personalizamos el pie de página), pero ahora vamos a hacerlo todo a mano en nuestro paquete.

source: Create the directoy ``browser/template_overrides``
es: Cree el directorio ``browser/template_overrides``

source: Add the following to ``browser/configure.zcml``:
es: Agregue el siguiente en el archivo ``browser/configure.zcml``:

source: For completeness, add :samp:`z3c.jbot` to the dependencies in :file:`setup.py` to the :samp:`install_requires` list.
es: Para completar, agregue :samp:`z3c.jbot` a las dependencias en el archivo :file:`setup.py` a la lista :samp:`install_requires`.

source: Find the file ``plone/app/contenttypes/browser/templates/newsitem.pt`` in the directory ``omelette`` (in vagrant this is in ``/home/vagrant/omelette``).
es: Buscar el archivo ``plone/app/contenttypes/browser/templates/newsitem.pt`` en el directorio ``omelette`` (en la instalación Vagrant esto esta en ``/home/vagrant/omelette``).

source: Copy it into the new folder ``cp /home/vagrant/omelette/plone/app/contenttypes/browser/templates/newsitem.pt /vagrant/buildout/src/ploneconf.site/ploneconf/site/browser/template_overrides``
es: Cópielo dentro de la nueva carpeta ``cp /home/vagrant/omelette/plone/app/contenttypes/browser/templates/newsitem.pt /vagrant/buildout/src/ploneconf.site/ploneconf/site/browser/template_overrides``

source: Rename the new file from ``newsitem.pt`` to ``plone.app.contenttypes.browser.templates.newsitem.pt``.
es: Renombre el nuevo archivo desde ``newsitem.pt`` a ``plone.app.contenttypes.browser.templates.newsitem.pt``.

source: Restart Plone
es: Reinicie Plone

source: Now Plone should use the new file to override the original one.
es: Ahora Plone debería usar el nuevo archivo sobrescribiendo el original.

source: Edit the template ``plone.app.contenttypes.browser.templates.newsitem.pt`` and insert the following after line 39:
es: Edite la plantilla ``plone.app.contenttypes.browser.templates.newsitem.pt`` e inserte el siguiente después de la linea 39:

source: Open an existing news-item in the browser
es: Abra un existente elemento de Noticia en el navegador Web

source: This will show something like: ``2013-10-02 19:21:15``. Not very user-friendly. Let's extend the code and use one of many helpers plone offers.
es: Esto mostrara algo como esto: ``2013-10-02 19:21:15``. No es muy amigable. Vamos a ampliar el código y utilizar una de las muchas funciones helpers que ofrece Plone.

source: Now we should see the date in a user-friendly format like ``17.02.2013``.
es: Ahora debería verse la fecha en un formato amigable como ``17.02.2013``.

source: With ``nocall:`` we prevent the method ``toLocalizedTime`` from being called, since we only want to make it available for use.
es: Con ``nocall:`` prevenimos que el método ``toLocalizedTime`` sea llamado, ya que sólo queremos que esté disponible para su uso.

source: The method ``toLocalizedTime`` is provided by the BrowserView ``Products.CMFPlone.browser.ploneview.Plone`` and runs the date-object through Plone's ``translation_service`` and returns the Date in the current locales format, thus transforming ``2013-02-17 19:21:15`` in ``17.02.2013``.
es: El método ``toLocalizedTime`` es proveído por la BrowserView ``Products.CMFPlone.browser.ploneview.Plone`` y ejecuta el objecto Fecha a través del ``translation_service`` de Plone y regresa la Fecha en el actual formato de locales, así transformando ``2013-02-17 19:21:15`` en ``17.02.2013``.

source: On older Plone-versions we used ``python:context.toLocalizedTime(context.Date(), longFormat=False)``. That called the python-script ``toLocalizedTime.py`` in the Folder ``Products/CMFPlone/skins/plone_scripts/``.
es: En antigua versiones de Plone nosotros usamos ``python:context.toLocalizedTime(context.Date(), longFormat=False)``. Que llamo al script python ``toLocalizedTime.py`` en la Carpeta ``Products/CMFPlone/skins/plone_scripts/``.

source: That folder ``plone_scripts`` still holds a multitude of useful scripts that are widely used. But they are all deprecated and will hopefully be gone in Plone 5 and replaced by proper python-methods in browserviews.
es: Esa carpeta ``plone_scripts`` todavía tiene una gran cantidad de scripts útiles que son ampliamente utilizados. Pero todos ellos están obsoletos y que se espera retirar en Plone 5 y sean reemplazados por métodos Python adecuados en BrowserViews.

source: summary_view.pt
es: El archivo summary_view.pt

source: We use the view "Summary View" to list news-releases. They should also have the date. The template associated with that view is ``summary_view.pt``.
es: Utilizamos la vista "Vista de resumen" a la lista de noticias publicadas. También deben tener la fecha. La plantilla asociada con esa vista es ``summary_view.pt``.

source: Let's look for the template folder_summary_view.pt::
es: Echemos un vistazo a la plantilla folder_summary_view.pt::

source: Copy it to ``browser/template_overrides/`` and rename it to ``plone.app.contenttypes.browser.templates.summary_view.pt``.
es: Cópielo al directorio ``browser/template_overrides/`` y renómbrelo a ``plone.app.contenttypes.browser.templates.summary_view.pt``.

source: Add the following after line 29:
es: Agregue lo siguiente después de la linea 29:

source: The method ``toLocalizedTime`` is already defined in the template whose macro this templates uses. Why is that?
es: El método ``toLocalizedTime`` ya está definido en la plantilla cuya macro usa esta plantillas. ¿Porqué es eso?

source: The secret is line 15 of ``summary_view.pt``:
es: El secreto es la linea del archivo ``summary_view.pt``:

source: ``use-macro`` tells Plone to reuse the macro ``entries`` from the view ``standard_view`` which is found in template ``plone/app/contenttypes/browser/templates/standard_view.pt``.
es: ``use-macro`` le dice a Plone reusar el macro ``entries`` desde la vista``standard_view`` la cual se encuentra en la plantilla ``plone/app/contenttypes/browser/templates/standard_view.pt``.

source: The templates ``summary_view.pt`` and ``folder_summary_view.pt`` (which is the same but for folders, not collections) are very widely used and also widely customized, so you might as well get to know it a little.
es: Las plantillas ``summary_view.pt`` y ``folder_summary_view.pt`` (las cuales es lo mismo, pero para las carpetas, no para las colecciones) están muy difundidas y también ampliamente personalizadas, para requisitos particulares, por lo que también podría llegar a conocerlo un poco.

source: Our addition renders the date of the respective objects that the template iterates over (thus ``item`` instead of ``context`` since ``context`` would be the collection aggregating the news items).
es: Nuestra adiciones hace que la fecha de los objetos respectivo que las iteraciones de plantilla (por lo tanto ``item`` en lugar de ``context`` desde ``context`` sería la colección de la agregación de las noticias).

source: The date is only displayed if the variable ``item_type`` (defined in line 42 of ``standard_view.pt``) is ``News Item``.
es: La fecha solamente es mostrada si la variable ``item_type`` (definida en la linea 42 de la vista ``standard_view.pt``) sea ``News Item``.

source: There is a lot more going on in ``standard_view.pt`` and ``summary_view.pt`` but we'll leave it at that.
es: Hay mucho más en ``standard_view.pt`` y ``summary_view.pt`` pero vamos a dejar las cosas así.

source: In default Plone without ``plone.app.contenttypes`` this would be ``folder_summary_view.pt``, a skin-template for Archetypes that can be found in the folder ``Products/CMFPlone/skins/plone_content/``. The customzed template would be ``Products.CMFPlone.skins.plone_content.folder_summary_view.pt``.
es: En defecto de Plone sin ``plone.app.contenttypes`` esto sería ``folder_summary_view.pt``, una plantilla de piel de Archetypes se puede encontrar en la carpeta ``Products/CMFPlone/skins/plone_content/``. La plantilla personalizada sería ``Products.CMFPlone.skins.plone_content.folder_summary_view.pt``.

source: The Archetypes-template for News Items is ``newsitems_view.pt`` from the same folder. The customized template would then have to be named ``Products.CMFPlone.skins.plone_content.folder_summary_view.pt``.
es: La plantilla Archetypes de Noticia es ``newsitems_view.pt`` de la misma carpeta. La plantilla personalizada tendría que ser nombrada ``Products.CMFPlone.skins.plone_content.folder_summary_view.pt``.

source: Keep in mind that not only the names have changed but also the content!
es: ¡Tenga en cuenta que no sólo los nombres han cambiado, sino también el contenido!

source: Finding the right template
es: Buscando la correcta plantilla

source: We changed the display of the listing of news-items at http://localhost:8080/Plone/news. But how do we know which template to customize?
es: Hemos cambiado la pantalla de la lista de elementos de noticias en http://localhost:8080/Plone/news. Pero, ¿cómo sabemos que plantilla para personalizar?

source: If you don't know which template the page you're looking at uses you can do an educated guess, start a debug-session or use ``plone.app.debugtoolbar``.
es: Si usted no sabe con qué plantilla utiliza la página que estás viendo, usted puede hacer una conjetura, iniciar una sesión de depuración o use el paquete ``plone.app.debugtoolbar`` par obtener una vista que ofrece información de depuración del actual contexto.

source: We could check the html with firebug and look for a structure in the content-area that looks unique. We could also look for the css-class of he body
es: Pudimos comprobar el HTML con la herramienta Firebug y buscar una estructura en el área de contenido que parece único. También podríamos buscar la clase CSS del cuerpo

source: The class ``template-summary_view`` tells us that the name of the view (but not necessarily the name of the template) is ``summary_view``. So we could search all ``*.zcml``-Files for ``name="summary_view"`` or search all templates calls ``summary_view.pt`` and probably find the view and also the corresponding template. But only probably because it would not tell us if the template is already being overridden.
es: La clase ``template-summary_view`` nos dice que el nombre de la vista (pero no necesariamente el nombre de la plantilla) el cual es ``summary_view``. Así que podríamos buscar en todos los archivos ``*.zcml`` la cadena ``name="summary_view"`` o buscar todas las plantillas llama ``summary_view.pt`` y probablemente encontrar la vista y también la plantilla correspondiente. Pero probablemente sólo porque esa no nos diría si ya está siendo sobrescrita la plantilla.

source: The safest method is using ``plone.app.debugtoolbar``. We already have it in our buildout and only need to install it. It adds a "Debug"-Dropdown on top of the page. The Section "Published" shows the complete path to the template that is used to render the page you are seeing.
es: El método es más seguro está usando el paquete ``plone.app.debugtoolbar``. Ya lo tenemos en nuestra configuración buildout definidos y sólo hay que instalarlo. Ese agregue un menú desplegable "Debug" en la parte superior de la página. La sección "Publicado" muestra la ruta completa a la plantilla que se utiliza para representar la página que estás viendo.

source: The debug-session to find the template is a little more complicated. Since we have ``Products.PDBDebugMode`` in our buildout we can call ``/pdb`` on our page.
es: La sesión de depuración para encontrar la plantilla es un poco más complicado. Entonces tenemos el producto ``Products.PDBDebugMode`` en nuestra configuración buildout podemos llamar ``/pdb`` desde nuestra página.

source: The object that the url points to is by default ``self.context``. But the first problem is, that the url we're seeing is not the url of the collection where we want to modify since the collection is the default-page of the folder ``news``.
es: El objeto que las URL apunta por defecto ``self.context``. Pero el primer problema es que la dirección URL que estamos viendo no es la dirección URL de la colección en la que queremos modificar ya que la colección es la página por defecto de la carpeta ``news``.

source: Now we see that we already customized the template.
es: Ahora puede ver que nosotros personalizamos la plantilla.

source: skin-templates
es: Plantillas skins

source: Why don't we always only use templates? Because we might want to do something more complicated than get an attribute form the context and render it's value in some html-tag.
es: ¿Por qué no siempre sólo utilizamos plantillas? Porque lo que se quiere hacer es algo más complicado que obtener un atributo de formulario en el contexto y hacer su valor en alguna etiqueta HTML.

source: There is a deprecated technology called 'skin-templates' that allows you to simply add some page-template (e.g. 'old_style_template.pt') to a certain folder in the ZMI or your egg) and you can access it in the browser by opening a url like http://localhost:8080/Plone/old_style_template and it will be rendered. But we don't use it and you too should not even though these skin-templates are still all over Plone.
es: Es una tecnología obsoleta llamada 'skin-templates' que le permite añadir simplemente alguna página en la plantilla (por ejemplo, 'old_style_template.pt') a una carpeta determinada en el ZMI o su paquete egg) y se puede acceder a ella en el navegador mediante la dirección URL como esta http://localhost:8080/Plone/old_style_template y se mostrara. Pero nosotros no lo usamos y usted también no hay que a pesar de que estos de las skin-templates siguen siendo todo Plone.

source: Since we use ``plone.app.contenttypes`` we do not encounter many skin-templates when dealing with content any more. But more often than not you'll have to customize an old site that still uses skin-templates.
es: Desde que usamos ``plone.app.contenttypes`` no encontramos nunca más muchas plantillas skin cuando se trata de contenidos. Pero más a menudo que usted no tendrás que personalizar un sitio antiguo que aún utiliza la plantillas skin.

source: Until now the templates of the default content-types are skin-templates for example. Since we use ``plone.app.contenttypes`` we do not encounter many skin-templates when dealing with content any more. But more often than not you'll have to customize an old site that still uses skin-templates. You could append ``/document_view`` to any part of a plone-site to render the default template for documents. You will often get errors since the template ``document_view.pt`` expects the context to have a field 'text' that it attempts to render.
es: Hasta ahora las plantillas de los tipos de contenido por defecto son skin-templates de ejemplo. Desde que usamos ``plone.app.contenttypes`` no encontramos muchos skin-templates cuando se trata de contenidos nunca más. Pero más a menudo que usted no tendrás que personalizar un sitio antiguo que aún utiliza la skin-templates. Se podría añadir ``/document_view`` a cualquier parte de un sitio plone para hacer que la plantilla predeterminada para los documentos. Es frecuente tener errores ya que la plantilla ``document_view.pt`` espera que el contexto para tener un campo de "texto" que intenta representar.

source: Skin templates and python-scripts in portal_skin are deprecated because:
es: Las plantillas Skins y los script Python ubicados en la herramienta portal_skin están descontinuados porque:

source: they use restricted python
es: ellos son Python restringido

source: they have no nice way to attach python-code to them
es: no tienen buena manera de adjuntar código Python a ellos

source: they are always callable for everything (they can't be easily bound to an interface)
es: ellos están siempre llamable para todo el mundo (ellos no pueden ser fácilmente unidos a una interfaz)
